[
  {
    "title": "Accelerating Secure Collaborative Machine Learning with Protocol-Aware RDMA",
    "abstract": "Abstract:Secure Collaborative Machine Learning (SCML) suffers from high communication cost caused by secure computation protocols. While modern datacenters offer high-bandwidth and low-latency networks with Remote Direct Memory Access (RDMA) capability, existing SCML implementation remains to use TCP sockets, leading to inefficiency. We present CORA1 to implement SCML over RDMA. By using a protocol-aware design, CORA identifies the protocol used by the SCML program and sends messages directly to the remote party's protocol buffer, improving the efficiency of message exchange. CORA exploits the chance that the SCML task is determined before execution and the pattern is largely input-irrelevant, so that CORA can plan message destinations on remote hosts at compile time. CORA can be readily deployed with existing SCML frameworks such as Piranha with its socket-like interface. We evaluate CORA in SCML training tasks, and our results show that CORA can reduce communication cost by up to 11x and achieve 1.2x - 4.2x end-to-end speedup over TCP in SCML training.",
    "author": "Authors:Zhenghang Ren, Mingxuan Fan, Zilong Wang, Junxue Zhang, and Chaoliang Zeng,iSING Lab@The Hong Kong University of Science and Technology;Zhicong Huang and Cheng Hong,Ant Group;Kai Chen,iSING Lab@The Hong Kong University of Science and Technology and University of Science and Technology of China",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/ren",
    "comment": ""
  },
  {
    "title": "ABACuS: All-Bank Activation Counters for Scalable and Low Overhead RowHammer Mitigation",
    "abstract": "Abstract:We introduce ABACuS, a new low-cost hardware-counterbased RowHammer mitigation technique that performance-, energy-, and area-efficiently scales with worsening RowHammer vulnerability. We observe that both benign workloads and RowHammer attacks tend to access DRAM rows with the same row address in multiple DRAM banks at around the same time. Based on this observation, ABACuS's key idea is to use a single shared row activation counter to track activations to the rows with the same row address in all DRAM banks. Unlike state-of-the-art RowHammer mitigation mechanisms that implement a separate row activation counter for each DRAM bank, ABACuS implements fewer counters (e.g., only one) to track an equal number of aggressor rows.Our comprehensive evaluations show that ABACuS securely prevents RowHammer bitflips at low performance/energy overhead and low area cost. We compare ABACuS to four state-of-the-art mitigation mechanisms. At a nearfuture RowHammer threshold of 1000, ABACuS incurs only 0.58% (0.77%) performance and 1.66% (2.12%) DRAM energy overheads, averaged across 62 single-core (8-core) workloads, requiring only 9.47 KiB of storage per DRAM rank. At the RowHammer threshold of 1000, the best prior lowarea-cost mitigation mechanism incurs 1.80% higher average performance overhead than ABACuS, while ABACuS requires 2.50× smaller chip area to implement. At a future RowHammer threshold of 125, ABACuS performs very similarly to (within 0.38% of the performance of) the best prior performance- and energy-efficient RowHammer mitigation mechanism while requiring 22.72× smaller chip area. We show that ABACuS's performance scales well with the number of DRAM banks. At the RowHammer threshold of 125, ABACuS incurs 1.58%, 1.50%, and 2.60% performance overheads for 16-, 32-, and 64-bank systems across all single-core workloads, respectively. ABACuS is freely and openly available athttps://github.com/CMU-SAFARI/ABACuS.",
    "author": "Authors:Ataberk Olgun, Yahya Can Tugrul, Nisa Bostanci, Ismail Emir Yuksel, Haocong Luo, Steve Rhyner, Abdullah Giray Yaglikci, Geraldo F. Oliveira, and Onur Mutlu,ETH Zurich",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/olgun",
    "comment": ""
  },
  {
    "title": "On Data Fabrication in Collaborative Vehicular Perception: Attacks and Countermeasures",
    "abstract": "Abstract:Collaborative perception, which greatly enhances the sensing capability of connected and autonomous vehicles (CAVs) by incorporating data from external resources, also brings forth potential security risks. CAVs' driving decisions rely on remote untrusted data, making them susceptible to attacks carried out by malicious participants in the collaborative perception system. However, security analysis and countermeasures for such threats are absent. To understand the impact of the vulnerability, we break the ground by proposing various real-time data fabrication attacks in which the attacker delivers crafted malicious data to victims in order to perturb their perception results, leading to hard brakes or increased collision risks. Our attacks demonstrate a high success rate of over 86% on high-fidelity simulated scenarios and are realizable in real-world experiments. To mitigate the vulnerability, we present a systematic anomaly detection approach that enables benign vehicles to jointly reveal malicious fabrication. It detects 91.5% of attacks with a false positive rate of 3% in simulated scenarios and significantly mitigates attack impacts in real-world scenarios.",
    "author": "Authors:Qingzhao Zhang, Shuowei Jin, Ruiyang Zhu, Jiachen Sun, and Xumiao Zhang,University of Michigan;Qi Alfred Chen,University of California, Irvine;Z. Morley Mao,University of Michigan and Google",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/zhang-qingzhao",
    "comment": ""
  },
  {
    "title": "Understanding the Security and Privacy Implications of Online Toxic Content on Refugees",
    "abstract": "Abstract:Deteriorating conditions in regions facing social and political turmoil have resulted in the displacement of huge populations known as refugees. Technologies such as social media have helped refugees adapt to challenges in their new homes. While prior works have investigated refugees' computer security and privacy (S&P) concerns, refugees' increasing exposure to toxic content and its implications have remained largely unexplored. In this paper, we answer how toxic content can influence refugees' S&P actions, goals, and barriers, and how their experiences shape these factors. Through semi-structured interviews with refugee liaisons (n=12), focus groups (n=9, 27 participants), and an online survey (n=29) with refugees, we discover unique attack contexts (e.g., participants are targeted after responding to posts directed against refugees) and how intersecting identities (e.g., LGBTQ+, women) exacerbate attacks. In response to attacks, refugees take immediate actions (e.g., selective blocking) or long-term behavioral shifts (e.g., ensuring uploaded photos are void of landmarks) These measures minimize vulnerability and discourage attacks, among other goals, while participants acknowledge barriers to measures (e.g., anonymity impedes family reunification). Our findings highlight lessons in better equipping refugees to manage toxic content attacks.",
    "author": "Authors:Arjun Arunasalam,Purdue University;Habiba Farrukh,University of California, Irvine;Eliz Tekcan and Z. Berkay Celik,Purdue University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/arunasalam",
    "comment": ""
  },
  {
    "title": "Automated Large-Scale Analysis of Cookie Notice Compliance",
    "abstract": "Abstract:Privacy regulations such as the General Data Protection Regulation (GDPR) require websites to inform EU-based users about non-essential data collection and to request their consent to this practice. Previous studies have documented widespread violations of these regulations. However, these studies provide a limited view of the general compliance picture: they are either restricted to a subset of notice types, detect only simple violations using prescribed patterns, or analyze notices manually. Thus, they are restricted both in their scope and in their ability to analyze violations at scale.We present the first general, automated, large-scale analysis of cookie notice compliance. Our method interacts with cookie notices, e.g., by navigating through their settings. It observes declared processing purposes and available consent options using Natural Language Processing and compares them to the actual use of cookies. By virtue of the generality and scale of our analysis, we correct for the selection bias present in previous studies focusing on specific Consent Management Platforms (CMP). We also provide a more general view of the overall compliance picture using a set of 97k websites popular in the EU. We report, in particular, that 65.4% of websites offering a cookie rejection option likely collect user data despite explicit negative consent.",
    "author": "Authors:Ahmed Bouhoula, Karel Kubicek, Amit Zac, Carlos Cotrini, and David Basin,ETH Zurich",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/bouhoula",
    "comment": ""
  },
  {
    "title": "You Cannot Escape Me: Detecting Evasions of SIEM Rules in Enterprise Networks",
    "abstract": "Abstract:Cyberattacks have grown into a major risk for organizations, with common consequences being data theft, sabotage, and extortion. Since preventive measures do not suffice to repel attacks, timely detection of successful intruders is crucial to stop them from reaching their final goals. For this purpose, many organizations utilize Security Information and Event Management (SIEM) systems to centrally collect security-related events and scan them for attack indicators using expert-written detection rules. However, as we show by analyzing a set of widespread SIEM detection rules, adversaries can evade almost half of them easily, allowing them to perform common malicious actions within an enterprise network without being detected. To remedy these critical detection blind spots, we propose the idea of adaptive misuse detection, which utilizes machine learning to compare incoming events to SIEM rules on the one hand and known-benign events on the other hand to discover successful evasions. Based on this idea, we present AMIDES, an open-source proof-of-concept adaptive misuse detection system. Using four weeks of SIEM events from a large enterprise network and more than 500 hand-crafted evasions, we show that AMIDES successfully detects a majority of these evasions without any false alerts. In addition, AMIDES eases alert analysis by assessing which rules were evaded. Its computational efficiency qualifies AMIDES for real-world operation and hence enables organizations to significantly reduce detection blind spots with moderate effort.",
    "author": "Authors:Rafael Uetz, Marco Herzog, and Louis Hackländer,Fraunhofer FKIE;Simon Schwarz,University of Göttingen;Martin Henze,RWTH Aachen University & Fraunhofer FKIE",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/uetz",
    "comment": ""
  },
  {
    "title": "Can Virtual Reality Protect Users from Keystroke Inference Attacks?",
    "abstract": "Abstract:Virtual Reality (VR) has gained popularity by providing immersive and interactive experiences without geographical limitations. It also provides a sense of personal privacy through physical separation. In this paper, we show that despite assumptions of enhanced privacy, VR is unable to shield its users from side-channel attacks that steal private information. Ironically, this vulnerability arises from VR's greatest strength, its immersive and interactive nature. We demonstrate this by designing and implementing a new set of keystroke inference attacks in shared virtual environments, where an attacker (VR user) can recover the content typed by another VR user by observing their avatar. While the avatar displays noisy telemetry of the user's hand motion, an intelligent attacker can use that data to recognize typed keys and reconstruct typed content, without knowing the keyboard layout or gathering labeled data. We evaluate the proposed attacks using IRB-approved user studies across multiple VR scenarios. For 13 out of 15 tested users, our attacks accurately recognize 86%-98% of typed keys, and the recovered content retains up to 98% of the meaning of the original typed content. We also discuss potential defenses.",
    "author": "Authors:Zhuolin Yang, Zain Sarwar, Iris Hwang, Ronik Bhaskar, Ben Y. Zhao, and Haitao Zheng,University of Chicago",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/yang-zhuolin",
    "comment": ""
  },
  {
    "title": "Neural Network Semantic Backdoor Detection and Mitigation: A Causality-Based Approach",
    "abstract": "Abstract:Different from ordinary backdoors in neural networks which are introduced with artificial triggers (e.g., certain specific patch) and/or by tampering the samples, semantic backdoors are introduced by simply manipulating the semantic, e.g., by labeling green cars as frogs in the training set. By focusing on samples with rare semantic features (such as green cars), the accuracy of the model is often minimally affected. Since the attacker is not required to modify the input sample during training nor inference time, semantic backdoors are challenging to detect and remove. Existing backdoor detection and mitigation techniques are shown to be ineffective with respect to semantic backdoors. In this work, we propose a method to systematically detect and remove semantic backdoors. Specifically we propose SODA (Semantic BackdOor Detection and MitigAtion) with the key idea of conducting lightweight causality analysis to identify potential semantic backdoor based on how hidden neurons contribute to the predictions and to remove the backdoor by adjusting the responsible neurons' contribution towards the correct predictions through optimization. SODA is evaluated with 21 neural networks trained on 6 benchmark datasets and 2 kinds of semantic backdoor attacks for each dataset. The results show that it effectively detects and removes semantic backdoors and preserves the accuracy of the neural networks.",
    "author": "Authors:Bing Sun, Jun Sun, and Wayne Koh,Singapore Management University;Jie Shi,Huawei Singapore",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/sun-bing",
    "comment": ""
  },
  {
    "title": "Finding Traceability Attacks in the Bluetooth Low Energy Specification and Its Implementations",
    "abstract": "Abstract:Bluetooth Low Energy (BLE) provides an efficient and convenient means for connecting a wide range of devices and peripherals. While its designers attempted to make tracking devices difficult through the use of MAC address randomization, a comprehensive analysis of the untraceability for the entire BLE protocol has not previously been conducted. In this paper, we create a formal model for BLE untraceability to reason about additional ways in which the specification allows for user tracking. Our model, implemented using ProVerif, transforms the untraceability problem into a reachability problem, and uncovers four previously unknown issues, namely IRK (Identity Resolving Key) reuse, BD_ADDR (MAC Address of Bluetooth Classic) reuse, CSRK (Connection Signature Resolving Key) reuse, and ID_ADDR (Identity Address) reuse, enabling eight passive or active tracking attacks against BLE. We then build another formal model using Diff-Equivalence (DE) as a comparison to our reachability model. Our evaluation of the two models demonstrates the soundness of our reachability model, whereas the DE model is neither sound nor complete. We further confirm these vulnerabilities in 13 different devices, ranging from embedded systems to laptop computers, with each device having at least 2 of the 4 issues. We finally provide mitigations for both developers and end users. In so doing, we demonstrate that BLE systems remain trackable under several common scenarios.",
    "author": "Authors:Jianliang Wu,Purdue University & Simon Fraser University;Patrick Traynor,University of Florida;Dongyan Xu, Dave (Jing) Tian, and Antonio Bianchi,Purdue University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/wu-jianliang",
    "comment": ""
  },
  {
    "title": "Devil in the Room: Triggering Audio Backdoors in the Physical World",
    "abstract": "Abstract:Recent years have witnessed deep learning techniques endowing modern audio systems with powerful capabilities. However, the latest studies have revealed its strong reliance on training data, raising serious threats from backdoor attacks. Different from most existing works that study audio backdoors in the digital world, we investigate the mismatch between the trigger and backdoor in the physical space by examining sound channel distortion. Inspired by this observation, this paper proposes TrojanRoom to bridge the gap between digital and physical audio backdoor attacks. TrojanRoom utilizes the room impulse response (RIR) as a physical trigger to enable injection-free backdoor activation. By synthesizing dynamic RIRs and poisoning a source class of samples during data augmentation, TrojanRoom enables any adversary to launch an effective and stealthy attack using the specific impulse response in a room. The evaluation shows over 92% and 97% attack success rates on both state-of-the-art speech command recognition and speaker recognition systems with negligible impact on benign accuracy below 3% at a distance of over 5m. The experiments also demonstrate that TrojanRoom could bypass human inspection and voice liveness detection, as well as resist trigger disruption and backdoor defense.",
    "author": "Authors:Meng Chen,Zhejiang University;Xiangyu Xu,Southeast University;Li Lu, Zhongjie Ba, Feng Lin, and Kui Ren,Zhejiang University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/chen-meng",
    "comment": ""
  },
  {
    "title": "Atropos: Effective Fuzzing of Web Applications for Server-Side Vulnerabilities",
    "abstract": "Abstract:Server-side web applications are still predominantly implemented in the PHP programming language. Even nowadays, PHP-based web applications are plagued by many different types of security vulnerabilities, ranging from SQL injection to file inclusion and remote code execution. Automated security testing methods typically focus on static analysis and taint analysis. These methods are highly dependent on accurate modeling of the PHP language and often suffer from (potentially many) false positive alerts. Interestingly, dynamic testing techniques such as fuzzing have not gained acceptance in web applications testing, even though they avoid these common pitfalls and were rapidly adopted in other domains, e. g., for testing native applications written in C/C++.In this paper, we present ATROPOS, a snapshot-based, feedback-driven fuzzing method tailored for PHP-based web applications. Our approach considers the challenges associated with web applications, such as maintaining session state and generating highly structured inputs. Moreover, we propose a feedback mechanism to automatically infer the key-value structure used by web applications. Combined with eight new bug oracles, each covering a common class of vulnerabilities in server-side web applications, ATROPOS is the first approach to fuzz web applications effectively and efficiently. Our evaluation shows that ATROPOS significantly outperforms the current state of the art in web application testing. In particular, it finds, on average, at least 32% more bugs, while not reporting a single false positive on different test suites. When analyzing real-world web applications, we identify seven previously unknown vulnerabilities that can be exploited even by unauthenticated users.",
    "author": "Authors:Emre Güler and Sergej Schumilo,Ruhr University Bochum;Moritz Schloegel, Nils Bars, Philipp Görz, and Xinyi Xu,CISPA Helmholtz Center for Information Security;Cemal Kaygusuz,Ruhr University Bochum;Thorsten Holz,CISPA Helmholtz Center for Information Security",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/g%C3%BCler",
    "comment": ""
  },
  {
    "title": "FraudWhistler: A Resilient, Robust and Plug-and-play Adversarial Example Detection Method for Speaker Recognition",
    "abstract": "Abstract:With the in-depth integration of deep learning, state-of-the-art speaker recognition systems have achieved breakthrough progress. However, the intrinsic vulnerability of deep learning to Adversarial Example (AE) attacks has brought new severe threats to real-world speaker recognition systems. In this paper, we propose FraudWhistler, a practical AE detection system, which is resilient to various AE attacks, robust in complex physical environments, and plug-and-play for deployed systems. Its basic idea is to make use of an intrinsic characteristic of AE, i.e., the instability of model prediction for AE, which is totally different from benign samples. FraudWhistler generates several audio variants for the original audio sample with some distortion techniques, obtains multiple outputs of the speaker recognition system for these audio variants, and based on that FraudWhistler extracts some statistics representing the instability of the original audio sample and further trains a one-class SVM classifier to detect adversarial example. Extensive experimental results show that FraudWhistler achieves 98.7% accuracy on AE detection outperforming SOTA works by 13%, and 84% accuracy in the worst case against an adaptive adversary.",
    "author": "Authors:Kun Wang,Zhejiang University;Xiangyu Xu,Southeast University;Li Lu, Zhongjie Ba, Feng Lin, and Kui Ren,Zhejiang University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/wang-kun",
    "comment": ""
  },
  {
    "title": "Swipe Left for Identity Theft: An Analysis of User Data Privacy Risks on Location-based Dating Apps",
    "abstract": "Abstract:Location-based dating (LBD) apps enable users to meet new people nearby and online by browsing others' profiles, which often contain very personal and sensitive data.  We systematically analyze 15 LBD apps on the prevalence of privacy risks  that can result in abuse by adversarial users who want to stalk, harass, or harm others. Through a systematic manual analysis of these apps,  we assess which personal and sensitive data is shared with other users,  both as (intended) data exposure and as inadvertent yet powerful leaks in API traffic that is otherwise hidden from a user,  violating their mental model of what they share on LBD apps. We also show that 6 apps allow for pinpointing a victim's exact location, enabling physical threats to users' personal safety.  All these data exposures and leaks—supported by easy account creation—enable targeted or large-scale, long-term, and stealthy profiling and tracking of LBD app users. While privacy policies acknowledge personal data processing, and a tension exists between app functionality and user privacy, significant data privacy risks remain. We recommend user control, data minimization, and API hardening as countermeasures to protect users' privacy.",
    "author": "Authors:Karel Dhondt, Victor Le Pochat, Yana Dimova, Wouter Joosen, and Stijn Volckaert,DistriNet, KU Leuven",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/dhondt",
    "comment": ""
  },
  {
    "title": "Dancer in the Dark: Synthesizing and Evaluating Polyglots for Blind Cross-Site Scripting",
    "abstract": "Abstract:Cross-Site Scripting (XSS) is a prevalent and well known security problem in web applications.  Numerous methods to automatically analyze and detect these vulnerabilities exist.  However, all of these methods require that either code or feedback from the application is available to guide the detection process.  In larger web applications, inputs can propagate from a frontend to an internal backend that provides no feedback to the outside.  None of the previous approaches are applicable in this scenario, known as blind XSS (BXSS). In this paper, we address this problem and present the first comprehensive study on BXSS.  As no feedback channel exists, we verify the presence of vulnerabilities through blind code execution.  For this purpose, we develop a method for synthesizing polyglots, small XSS payloads that execute in all common injection contexts.  Seven of these polyglots are already sufficient to cover a state-of-the-art XSS testbed. In a validation on real-world client-side vulnerabilities, we show that their XSS detection rate is on par with existing taint tracking approaches. Based on these polyglots, we conduct a study of BXSS vulnerabilities on the Tranco Top 100,000 websites.  We discover 20 vulnerabilities in 18 web-based backend systems. These findings demonstrate the efficacy of our detection approach and point at a largely unexplored attack surface in web security.",
    "author": "Authors:Robin Kirchner,Technische Universität Braunschweig;Jonas Möller,Technische Universität Berlin;Marius Musch and David Klein,Technische Universität Braunschweig;Konrad Rieck,Technische Universität Berlin;Martin Johns,Technische Universität Braunschweig",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/kirchner",
    "comment": ""
  },
  {
    "title": "ResolverFuzz: Automated Discovery of DNS Resolver Vulnerabilities with Query-Response Fuzzing",
    "abstract": "Abstract:Domain Name System (DNS) is a critical component of the Internet. DNS resolvers, which act as the cache between DNS clients and DNS nameservers, are the central piece of the DNS infrastructure, essential to the scalability of DNS. However, finding the resolver vulnerabilities is non-trivial, and this problem is not well addressed by the existing tools. To list a few reasons, first, most of the known resolver vulnerabilities are non-crash bugs that cannot be directly detected by the existing oracles (or sanitizers). Second, there lacks rigorous specifications to be used as references to classify a test case as a resolver bug. Third, DNS resolvers are stateful, and stateful fuzzing is still challenging due to the large input space.In this paper, we present a new fuzzing system termed ResolverFuzz to address the aforementioned challenges related to DNS resolvers, with a suite of new techniques being developed. First, ResolverFuzz performs constrained stateful fuzzing by focusing on the short query-response sequence, which has been demonstrated as the most effective way to find resolver bugs, based on our study of the published DNS CVEs. Second, to generate test cases that are more likely to trigger resolver bugs, we combine probabilistic context-free grammar (PCFG) based input generation with byte-level mutation for both queries and responses. Third, we leverage differential testing and clustering to identify non-crash bugs like cache poisoning bugs. We evaluated ResolverFuzz against 6 mainstream DNS software under 4 resolver modes. Overall, we identify 23 vulnerabilities that can result in cache poisoning, resource consumption, and crash attacks. After responsible disclosure, 19 of them have been confirmed or fixed, and 15 CVE numbers have been assigned.",
    "author": "Authors:Qifan Zhang and Xuesong Bai,University of California, Irvine;Xiang Li,Tsinghua University;Haixin Duan,Tsinghua University; Zhongguancun Laboratory; Quan Cheng Laboratory;Qi Li,Tsinghua University;Zhou Li,University of California, Irvine",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/zhang-qifan",
    "comment": ""
  },
  {
    "title": "Ahoy SAILR! There is No Need to DREAM of C: A Compiler-Aware Structuring Algorithm for Binary Decompilation",
    "abstract": "Abstract:Contrary to prevailing wisdom, we argue that the measure of binary decompiler success is not to eliminate all gotos or reduce the complexity of the decompiled code but to get as close as possible to the original source code. Many gotos exist in the original source code (the Linux kernel version 6.1 contains 3,754) and, therefore, should be preserved during decompilation, and only spurious gotos should be removed.Fundamentally, decompilers insert spurious gotos in decompilation because structuring algorithms fail to recover C-style structures from binary code. Through a quantitative study, we find that the root cause of spurious gotos is compiler-induced optimizations that occur at all optimization levels (17% in non-optimized compilation). Therefore, we believe that to achieve high-quality decompilation, decompilers must be compiler-aware to mirror (and remove) the goto-inducing optimizations.In this paper, we present a novel structuring algorithm called SAILR that mirrors the compilation pipeline of GCC and precisely inverts goto-inducing transformations. We build an open-source decompiler on angr (the angr decompiler) and implement SAILR as well as otherwise-unavailable prior work (Phoenix, DREAM, and rev.ng's Combing) and evaluate them, using a new metric of how close the decompiled code structure is to the original source code, showing that SAILR markedly improves on prior work. In addition, we find that SAILR performs well on binaries compiled with non-GCC compilers, which suggests that compilers similarly implement goto-inducing transformations.",
    "author": "Authors:Zion Leonahenahe Basque, Ati Priya Bajaj, Wil Gibbs, Jude O'Kain, Derron Miao, Tiffany Bao, Adam Doupé, Yan Shoshitaishvili, and Ruoyu Wang,Arizona State University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/basque",
    "comment": ""
  },
  {
    "title": "Racing on the Negative Force: Efficient Vulnerability Root-Cause Analysis through Reinforcement Learning on Counterexamples",
    "abstract": "Abstract:Root-Cause Analysis (RCA) is crucial for discovering security vulnerabilities from fuzzing outcomes. Automating this process through triaging the crashes observed during the fuzzing process, however, is considered to be challenging. Particularly, today's statistical RCA approaches are known to be exceedingly slow, often taking tens of hours or even a week to analyze a crash. This problem comes from the biased sampling such approaches perform. More specifically, given an input inducing a crash in a program, these approaches sample around the input by mutating it to generate new test cases; these cases are used to fuzz the program, in a hope that a set of program elements (blocks, instructions or predicates) on the execution path of the original input can be adequately sampled so their correlations with the crash can be determined. This process, however, tends to generate the input samples more likely causing the crash, with their execution paths involving a similar set of elements, which become less distinguishable until a large number of samples have been made. We found that this problem can be effectively addressed by sampling around \"counterexamples'', the inputs causing a significant change to the current estimates of correlations. These inputs though still involving the elements often do not lead to the crash. They are found to be effective in differentiating program elements, thereby accelerating the RCA process. Based upon the understanding, we designed and implemented a reinforcement learning (RL) technique that rewards the operations involving counterexamples. By balancing random sampling with the exploitation on the counterexamples, our new approach, called RACING, is shown to substantially elevate the scalability and the accuracy of today's statistical RCA, outperforming the state-of-the-art by more than an order of magnitude.",
    "author": "Authors:Dandan Xu,SKLOIS, Institute of Information Engineering, Chinese Academy of Sciences, China, and School of Cyber Security, University of Chinese Academy of Sciences, China;Di Tang, Yi Chen, and XiaoFeng Wang,Indiana University Bloomington;Kai Chen,SKLOIS, Institute of Information Engineering, Chinese Academy of Sciences, China, and School of Cyber Security, University of Chinese Academy of Sciences, China;Haixu Tang,Indiana University Bloomington;Longxing Li,SKLOIS, Institute of Information Engineering, Chinese Academy of Sciences, China, and School of Cyber Security, University of Chinese Academy of Sciences, China",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/xu-dandan",
    "comment": ""
  },
  {
    "title": "WEBRR: A Forensic System for Replaying and Investigating Web-Based Attacks in The Modern Web",
    "abstract": "Abstract:After a sophisticated attack or data breach occurs at an organization, a postmortem forensic analysis must be conducted to reconstruct and understand the root causes of the attack. Unfortunately, the majority of proposed forensic analysis systems rely on system-level auditing, making it difficult to reconstruct and investigate web-based attacks, due to the semantic-gap between system- and web-level semantics. This limited visibility into web-based attacks has recently become increasingly concerning because web-based attacks are commonly employed by nation-state adversaries to penetrate and achieve the initial compromise of an enterprise network. To enable forensic analysts to replay and investigate web-based attacks, we propose WebRR, a novel OS- and device- independent record and replay (RR) forensic auditing system for Chromium-based web browsers. While there exist prior works that focus on web-based auditing, current systems are either record-only or suffer from critical limitations that prevent them from deterministically replaying attacks. WebRR addresses these limitation by introducing a novel design that allows it to record and deterministically replay modern web applications by leveragingJavaScript Execution Unit Partitioning.Our evaluation demonstrates that WebRR is capable of replaying web-based attacks that fail to replay on prior state-of-the-art systems. Furthermore, we demonstrate that WebRR can replay highly-dynamic modern websites in a deterministic fashion with an average runtime overhead of only 3.44%",
    "author": "Authors:Joey Allen,Palo Alto Networks;Zheng Yang, Feng Xiao, and Matthew Landen,Georgia Institute of Technology;Roberto Perdisci,Georgia Institute of Technology and University of Georgia;Wenke Lee,Georgia Institute of Technology",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/allen",
    "comment": ""
  },
  {
    "title": "Unleashing the Power of Type-Based Call Graph Construction by Using Regional Pointer Information",
    "abstract": "Abstract:When dealing with millions of lines of C code, we still cannot have the cake and eat it: type analysis for call graph construction is scalable yet highly imprecise.  We address this precision issue through a practical observation: many function pointers are simple; they are not referenced by other pointers, nor do they derive their values by dereferencing other pointers.  As a result, simple function pointers can be resolved with precise and affordable pointer aliasing information. In this work, we advocate Kelp with two concerted stages.  First, instead of directly using type analysis, Kelp performs regional pointer analysis along def-use chains to early and precisely resolve the indirect calls through simple function pointers.  Second, Kelp then leverages type analysis to handle the remaining indirect calls.  The ﬁrst stage is efﬁcient as Kelp selectively reasons about simple function pointers, thereby avoiding prohibitive performance penalties.  The second stage is precise as the candidate address-taken functions for checking type compatibility are largely reduced thanks to the ﬁrst stage.  Our experiments on twenty large-scale and popular software programs show that, on average, Kelp can reduce spurious callees by 54.2% with only a negligible additional time cost of 8.5% (equivalent to 6.3 seconds) compared to the previous approach.  More excitingly, when evaluating the call graphs through the lens of three various downstream clients (i.e., thread-sharing analysis, value-ﬂow bug detection, and directed grey-box fuzzing), Kelp can signiﬁcantly enhance their effectiveness for better vulnerability understanding, hunting, and reproduction.",
    "author": "Authors:Yuandao Cai, Yibo Jin, and Charles Zhang,The Hong Kong University of Science and Technology",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/cai-yuandao",
    "comment": ""
  },
  {
    "title": "The Effect of Design Patterns on (Present and Future) Cookie Consent Decisions",
    "abstract": "Abstract:Today most websites in the EU present users with a consent banner asking about the use of cookies or other tracking technologies. Data Protection Authorities (DPAs) need to ensure that users can express their true preferences when faced with these banners, while simultaneously satisfying the EU GDPR requirements. To address the needs of the French DPA, we conducted an online experiment among 3,947 participants in France exploring the impact of six different consent banner designs on the outcome of users' consent decision. We also assessed participants' knowledge and privacy preferences, as well as satisfaction with the banners. In contrast with previous results, we found that a \"bright pattern\" that highlights the decline option has a substantial effect on users' decisions. We also find that two new designs based on behavioral levers have the strongest effect on the outcome of the consent decision, and participants' satisfaction with the banners. Finally, our study provides novel evidence that the effect of design persists in a short time frame: designs can significantly affect users' future choices, even when faced with neutral banners.",
    "author": "Authors:Nataliia Bielova,Inria research centre at Université Côte d'Azur;Laura Litvine and Anysia Nguyen,Behavioural Insights Team (BIT);Mariam Chammat,Interministerial Directorate for Public Transformation (DITP);Vincent Toubiana,Commission Nationale de l'Informatique et des Libertés (CNIL);Estelle Hary,RMIT University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/bielova",
    "comment": ""
  },
  {
    "title": "RECORD: A RECeption-Only Region Determination Attack on LEO Satellite Users",
    "abstract": "Abstract:Low Earth orbit (LEO) satellite communication has recently experienced a dramatic increase of usage in diverse application sectors. Naturally, the aspect of location privacy is becoming crucial, most notably in security or military applications. In this paper, we present a novel passive attack called RECORD, which is solely based on the reception of messages to LEO satellite users on the ground, threatening their location privacy. In particular, we show that by observing only the downlink of \"wandering\" communication satellites over wide beams can be exploited at scale from passive attackers situated on Earth to estimate the region in which users are located. We build our own distributed satellite reception platform to implement the RECORD attack. We analyze the accuracy and limiting factors of this new attack using real-world measurements from our own Iridium satellite communication. Our experimental results reveal that by observing only 2.3 hours of traffic, it is possible to narrow down the position of an Iridium user to an area below 11 km of radius (compared to the satellite beam size of 4700 km diameter). We conduct additional extensive simulative evaluations, which suggest that it is feasible to narrow down the unknown location of a user even further, for instance, to below 5 km radius when the observation period is increased to more than 16 hours. We finally discuss the transferability of RECORD to different LEO constellations and highlight possible countermeasures.",
    "author": "Authors:Eric Jedermann,RPTU Kaiserslautern-Landau;Martin Strohmeier and Vincent Lenders,armasuisse;Jens Schmitt,RPTU Kaiserslautern-Landau",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/jedermann",
    "comment": ""
  },
  {
    "title": "A Taxonomy of C Decompiler Fidelity Issues",
    "abstract": "Abstract:Decompilation is an important part of analyzing threats in computer security. Unfortunately, decompiled code contains less information than the corresponding original source code, which makes understanding it more difficult for the reverse engineers who manually perform threat analysis. Thus, the fidelity of decompiled code to the original source code matters, as it can influence reverse engineers' productivity. There is some existing work in predicting some of the missing information using statistical methods, but these focus largely on variable names and variable types. In this work, we more holistically evaluate decompiler output from C-language executables and use our findings to inform directions for future decompiler development. More specifically, we use open-coding techniques to identify defects in decompiled code beyond missing names and types. To ensure that our study is robust, we compare and evaluate four different decompilers. Using thematic analysis, we build a taxonomy of decompiler defects. Using this taxonomy to reason about classes of issues, we suggest specific approaches that can be used to mitigate fidelity issues in decompiled code.",
    "author": "Authors:Luke Dramko and Jeremy Lacomis,Carnegie Mellon University;Edward J. Schwartz,Carnegie Mellon University Software Engineering Institute;Bogdan Vasilescu and Claire Le Goues,Carnegie Mellon University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/dramko",
    "comment": ""
  },
  {
    "title": "CAMP: Compiler and Allocator-based Heap Memory Protection",
    "abstract": "Abstract:The heap is a critical and widely used component of many applications. Due to its dynamic nature, combined with the complexity of heap management algorithms, it is also a frequent target for security exploits. To enhance the heap's security, various heap protection techniques have been introduced, but they either introduce significant runtime overhead or have limited protection. We present CAMP, a new sanitizer for detecting and capturing heap memory corruption. CAMP leverages a compiler and a customized memory allocator. The compiler adds boundary-checking and escape-tracking instructions to the target program, while the memory allocator tracks memory ranges, coordinates with the instrumentation, and neutralizes dangling pointers. With the novel error detection scheme, CAMP enables various compiler optimization strategies and thus eliminates redundant and unnecessary check instrumentation. This design minimizes runtime overhead without sacrificing security guarantees. Our evaluation and comparison of CAMP with existing tools, using both real-world applications and SPEC CPU benchmarks, show that it provides even better heap corruption detection capability with lower runtime overhead.",
    "author": "Authors:Zhenpeng Lin, Zheng Yu, Ziyi Guo, Simone Campanoni, Peter Dinda, and Xinyu Xing,Northwestern University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/lin-zhenpeng",
    "comment": ""
  },
  {
    "title": "\"Belt and suspenders\" or \"just red tape\"?: Investigating Early Artifacts and User Perceptions of IoT App Security Certification",
    "abstract": "Abstract:As IoT security regulations and standards emerge, the industry has begun adopting the traditional enforcement model for software compliance to the IoT domain, wherein Commercially Licensed Evaluation Facilities (CLEFs) certify vendor products on behalf of regulators (and in turn consumers). Since IoT standards are in their formative stages, we investigate a simple but timely question: does the traditional model work for IoT security, and more importantly, does it work as well as consumers expect it to? This paper investigates the initial artifacts resultant from IoT compliance certiﬁcation, and user perceptions of compliance, in the context of certiﬁed mobile-IoT apps, i.e., critical companion and automation apps that expose an important IoT attack surface, with a focus on three key questions: (1) are certiﬁed IoT products vulnerable?, (2) are vulnerable-but-certiﬁed products non-compliant?, and ﬁnally, (3) how do consumers perceive compliance enforcement? Our systematic analysis of 11 mobile-IoT apps certiﬁed by IOXT, along with an analysis of 5 popular compliance standards, and a user study with 173 users, together yield 17 key ﬁndings. We ﬁnd signiﬁcant vulnerabilities that indicate gaps in certiﬁcation, but which do not violate the standards due to ambiguity and discretionary language. Further, these vulnerabilities contrast with the overwhelming trust that users place in compliance certiﬁcation and certiﬁed apps. We conclude with a discussion on future directions towards a \"belt and suspenders\" scenario of effective assurance that most users desire, from the status quo of \"just red tape\", through objective checks and balances that empower the regulators and consumers to reform compliance enforcement for IoT.",
    "author": "Authors:Prianka Mandal, Amit Seal Ami, Victor Olaiya, Sayyed Hadi Razmjo, and Adwait Nadkarni,William & Mary",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/mandal",
    "comment": ""
  },
  {
    "title": "Go Go Gadget Hammer: Flipping Nested Pointers for Arbitrary Data Leakage",
    "abstract": "Abstract:Rowhammer is an increasingly threatening vulnerability that grants an attacker the ability to flip bits in memory without directly accessing them. Despite efforts to mitigate Rowhammer via software and defenses built directly into DRAM modules, more recent generations of DRAM are actually more susceptible to malicious bit-flips than their predecessors. This phenomenon has spawned numerous exploits, showing how Rowhammer acts as the basis for various vulnerabilities that target sensitive structures, such as Page Table Entries (PTEs) or opcodes, to grant control over a victim machine.However, in this paper, we consider Rowhammer as a more general vulnerability, presenting a novel exploit vector for Rowhammer that targets particular code patterns. We show that if victim code is designed to return benign data to an unprivileged user, and uses nested pointer dereferences, Rowhammer can flip these pointers to gain arbitrary read access in the victim's address space. Furthermore, we identify gadgets present in the Linux kernel, and demonstrate an end-to-end attack that precisely flips a targeted pointer. To do so we developed a number of improved Rowhammer primitives, including kernel memory massaging, Rowhammer synchronization, and testing for kernel flips, which may be of broader interest to the Rowhammer community. Compared to prior works' leakage rate of .3 bits/s, we show that such gadgets can be used to read out kernel data at a rate of 82.6 bits/s.By targeting code gadgets, this work expands the scope and attack surface exposed by Rowhammer. It is no longer sufficient for software defenses to selectively pad previously exploited memory structures in flip-safe memory, as any victim code that follows the pattern in question must be protected.",
    "author": "Authors:Youssef Tobah,University of Michigan;Andrew Kwong,UNC Chapel Hill;Ingab Kang,University of Michigan;Daniel Genkin,Georgia Tech;Kang G. Shin,University of Michigan",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/tobah",
    "comment": ""
  },
  {
    "title": "FFXE: Dynamic Control Flow Graph Recovery for Embedded Firmware Binaries",
    "abstract": "Abstract:Control Flow Graphs (CFG) play a significant role as an intermediary analysis in many advanced static and dynamic software analysis techniques. As firmware security and validation for embedded systems becomes a greater concern, accurate CFGs for embedded firmware binaries are crucial for adapting many valuable software analysis techniques to firmware, which can enable more thorough functionality and security analysis. In this work, we present a portable new dynamic CFG recovery technique based on dynamic forced execution that allows us to resolve indirect branches to registered callback functions, which are dependent on asynchronous changes to volatile memory. Our implementation, the Forced Firmware Execution Engine (FFXE), written in Python using the Unicorn emulation framework, is able to identify 100% of known callback functions in our test set of 36 firmware images, something none of the other techniques we tested against were able to do reliably. Using our results and observations, we compare our engine to 4 other CFG recovery techniques and provide both our thoughts on how this work might enhance other tools, and how it might be further developed. With our contributions, we hope to help enable the application of traditionally software-focused security analysis techniques to the hardware interactions that are integral to embedded system firmware.",
    "author": "Authors:Ryan Tsang, Asmita, and Doreen Joseph,University of California, Davis;Soheil Salehi,University of Arizona;Prasant Mohapatra and Houman Homayoun,University of California, Davis",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/tsang",
    "comment": ""
  },
  {
    "title": "Your Firmware Has Arrived: A Study of Firmware Update Vulnerabilities",
    "abstract": "Abstract:Embedded devices are increasingly ubiquitous in our society. Firmware updates are one of the primary mechanisms to mitigate vulnerabilities in embedded systems. However, the firmware update procedure also introduces new attack surfaces, particularly through vulnerable firmware verification procedures. Unlike memory corruption bugs, numerous vulnerabilities in firmware updates stem from incomplete or incorrect verification steps, to which existing firmware analysis methods are not applicable. To bridge this gap, we propose ChkUp, an approach to Check for firmware Update vulnerabilities. ChkUp can resolve the program execution paths during firmware updates using cross-language inter-process control flow analysis and program slicing. With these paths, ChkUp locates firmware verification procedures, examining and validating their vulnerabilities. We implemented ChkUp and conducted a comprehensive analysis on 12,000 firmware images. Then, we validated the alerts in 150 firmware images from 33 device families, leading to the discovery of both zero-day and n-day vulnerabilities. Our findings were disclosed responsibly, resulting in the assignment of 25 CVE IDs and one PSV ID at the time of writing.",
    "author": "Authors:Yuhao Wu, Jinwen Wang, Yujie Wang, Shixuan Zhai, and Zihan Li,Washington University in St. Louis;Yi He,Tsinghua University;Kun Sun,George Mason University;Qi Li,Tsinghua University;Ning Zhang,Washington University in St. Louis",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/wu-yuhao",
    "comment": ""
  },
  {
    "title": "Opportunistic Data Flow Integrity for Real-time Cyber-physical Systems Using Worst Case Execution Time Reservation",
    "abstract": "Abstract:With the proliferation of safety-critical real-time systems in our daily life, it is imperative that their security is protected to guarantee their functionalities. To this end, one of the most powerful modern security primitives is the enforcement of data flow integrity. However, the run-time overhead can be prohibitive for real-time cyber-physical systems. On the other hand, due to strong safety requirements on such real-time cyber-physical systems, platforms are often designed with enough reservation such that the system remains real-time even if it is experiencing the worst-case execution time. We conducted a measurement study on eight popular CPS systems and found the worst-case execution time is often at least five times the average run time.In this paper, we propose opportunistic data flow integrity, OP-DFI, that takes advantage of the system reservation to enforce data flow integrity to the CPS software. To avoid impacting the real-time property, OP-DFI tackles the challenge of slack estimation and run-time policy swapping to take advantage of the extra time in the system opportunistically. To ensure the security protection remains coherent, OP-DFI leverages in-line reference monitors and hardware-assisted features to perform dynamic fine-grained sandboxing. We evaluated OP-DFI on eight real-time CPS. With a worst-case execution time overhead of 2.7%, OP-DFI effectively performs DFI checking on 95.5% of all memory operations and 99.3% of safety-critical control-related memory operations on average.",
    "author": "Authors:Yujie Wang, Ao Li, Jinwen Wang, Sanjoy Baruah, and Ning Zhang,Washington University in St. Louis",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/wang-yujie",
    "comment": ""
  },
  {
    "title": "MAGIC: Detecting Advanced Persistent Threats via Masked Graph Representation Learning",
    "abstract": "Abstract:Advance Persistent Threats (APTs), adopted by most delicate attackers, are becoming increasing common and pose great threat to various enterprises and institutions. Data provenance analysis on provenance graphs has emerged as a common approach in APT detection. However, previous works have exhibited several shortcomings: (1) requiring attack-containing data and a priori knowledge of APTs, (2) failing in extracting the rich contextual information buried within provenance graphs and (3) becoming impracticable due to their prohibitive computation overhead and memory consumption.In this paper, we introduce MAGIC, a novel and flexible self-supervised APT detection approach capable of performing multi-granularity detection under different level of supervision. MAGIC leverages masked graph representation learning to model benign system entities and behaviors, performing efficient deep feature extraction and structure abstraction on provenance graphs. By ferreting out anomalous system behaviors via outlier detection methods, MAGIC is able to perform both system entity level and batched log level APT detection. MAGIC is specially designed to handle concept drift with a model adaption mechanism and successfully applies to universal conditions and detection scenarios. We evaluate MAGIC on three widely-used datasets, including both real-world and simulated attacks. Evaluation results indicate that MAGIC achieves promising detection results in all scenarios and shows enormous advantage over state-of-the-art APT detection approaches in performance overhead.",
    "author": "Authors:Zian Jia and Yun Xiong,Shanghai Key Laboratory of Data Science, School of Computer Science, Fudan University, China;Yuhong Nan,School of Software Engineering, Sun Yat-sen University, China;Yao Zhang,Shanghai Key Laboratory of Data Science, School of Computer Science, Fudan University, China;Jinjing Zhao,National Key Laboratory of Science and Technology on Information System Security, China;Mi Wen,Shanghai University of Electric Power, China",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/jia-zian",
    "comment": ""
  },
  {
    "title": "Security and Privacy Analysis of Samsung's Crowd-Sourced Bluetooth Location Tracking System",
    "abstract": "Abstract:We present a detailed analysis of Samsung's Offline Finding (OF) protocol, which is part of Samsung's Find My Mobile system for locating Samsung mobile devices and Galaxy SmartTags.  The OF protocol uses Bluetooth Low Energy (BLE) to broadcast a unique beacon for a lost device. This beacon is then picked up by nearby Samsung phones or tablets (the helper devices), which then forward the beacon and the location it was detected at, to a vendor server. The owner of a lost device can then query the server to locate their device. We examine several security and privacy related properties of the OF protocol and its implementation. These include: the feasibility of tracking an OF device through its BLE data, the feasibility of unwanted tracking of a person by exploiting the OF network, the feasibility for the vendor to de-anonymise location reports to determine the locations of the owner or the helper devices, and the feasibility for an attacker to compromise the integrity of the location reports. Our findings suggest that there are privacy risks on all accounts, arising from issues in the design and the implementation of the OF protocol.",
    "author": "Authors:Tingfeng Yu, James Henderson, Alwen Tiu, and Thomas Haines,School of Computing, The Australian National University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/yu-tingfeng",
    "comment": ""
  },
  {
    "title": "Practical Security Analysis of Zero-Knowledge Proof Circuits",
    "abstract": "Abstract:As privacy-sensitive applications based on zero-knowledge proofs (ZKPs) gain increasing traction, there is a pressing need to detect vulnerabilities in ZKP circuits. This paper studies common vulnerabilities in Circom (the most popular domain-specific language for ZKP circuits) and describes a static analysis framework for detecting these vulnerabilities. Our technique operates over an abstraction called the circuit dependence graph (CDG) that captures key properties of the circuit and allows expressing semantic vulnerability patterns as queries over the CDG abstraction. We have implemented 9 different detectors using this framework and performed an experimental evaluation on over 258 circuits from popular Circom projects on GitHub. According to our evaluation, these detectors can identify vulnerabilities, including previously unknown ones, with high precision and recall.",
    "author": "Authors:Hongbo Wen,University of California, Santa Barbara;Jon Stephens,The University of Texas at Austin and Veridise;Yanju Chen,University of California, Santa Barbara;Kostas Ferles,Veridise;Shankara Pailoor,The University of Texas at Austin and Veridise;Kyle Charbonnet,Ethereum Foundation;Isil Dillig,The University of Texas at Austin and Veridise;Yu Feng,University of California, Santa Barbara, and Veridise",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/wen",
    "comment": ""
  },
  {
    "title": "Hermes: Unlocking Security Analysis of Cellular Network Protocols by Synthesizing Finite State Machines from Natural Language Specifications",
    "abstract": "Abstract:In this paper, we present Hermes, an end-to-end framework to automatically generate formal representations from natural language cellular specifications. We first develop a neural constituency parser, NEUTREX, to process transition-relevant texts and extract transition components (i.e., states, conditions, and actions). We also design a domain-specific language to translate these transition components to logical formulas by leveraging dependency parse trees. Finally, we compile these logical formulas to generate transitions and create the formal model as finite state machines. To demonstrate the effectiveness of Hermes, we evaluate it on 4G NAS, 5G NAS, and 5G RRC specifications and obtain an overall accuracy of 81-87%, which is a substantial improvement over the state-of-the-art. Our security analysis of the extracted models uncovers 3 new vulnerabilities and identifies 19 previous attacks in 4G and 5G specifications, and 7 deviations in commercial 4G basebands.",
    "author": "Authors:Abdullah Al Ishtiaq, Sarkar Snigdha Sarathi Das, Syed Md Mukit Rashid, Ali Ranjbar, Kai Tu, Tianwei Wu, Zhezheng Song, Weixuan Wang, Mujtahid Akon, Rui Zhang, and Syed Rafiul Hussain,Pennsylvania State University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/al-ishtiaq",
    "comment": ""
  },
  {
    "title": "Sync+Sync: A Covert Channel Built on fsync with Storage",
    "abstract": "Abstract:Scientists have built a variety of covert channels for secretive information transmission with CPU cache and main memory. In this paper, we turn to a lower level in the memory hierarchy, i.e., persistent storage. Most programs store intermediate or eventual results in the form of files and some of them call fsync to synchronously persist a file with storage device for orderly persistence. Our quantitative study shows that one program would undergo significantly longer response time for fsync call if the other program is concurrently calling fsync, although they do not share any data. We further find that, concurrent fsync calls contend at multiple levels of storage stack due to sharing software structures (e.g., Ext4's journal) and hardware resources (e.g., disk's I/O dispatch queue).We accordingly build a covert channel named Sync+Sync. Sync+Sync delivers a transmission bandwidth of 20,000 bits per second at an error rate of about 0.40% with an ordinary solid-state drive. Sync+Sync can be conducted in cross-disk partition, cross-file system, cross-container, cross-virtual machine, and even cross-disk drive fashions, without sharing data between programs. Next, we launch side-channel attacks with Sync+Sync and manage to precisely detect operations of a victim database (e.g., insert/update and B-Tree node split). We also leverage Sync+Sync to distinguish applications and websites with high accuracy by detecting and analyzing their fsync frequencies and flushed data volumes. These attacks are useful to support further fine-grained information leakage.",
    "author": "Authors:Qisheng Jiang and Chundong Wang,ShanghaiTech University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/jiang-qisheng",
    "comment": ""
  },
  {
    "title": "AutoFHE: Automated Adaption of CNNs for Efficient Evaluation over FHE",
    "abstract": "Abstract:Secure inference of deep convolutional neural networks (CNNs) under RNS-CKKS involves polynomial approximation of unsupported non-linear activation functions. However, existing approaches have three main limitations: 1) Inflexibility: The polynomial approximation and associated homomorphic evaluation architecture are customized manually for each CNN architecture and do not generalize to other networks. 2) Suboptimal Approximation: Each activation function is approximated instead of the function represented by the CNN. 3) Restricted Design: Either high-degree or low-degree polynomial approximations are used. The former retains high accuracy but slows down inference due to bootstrapping operations, while the latter accelerates ciphertext inference but compromises accuracy. To address these limitations, we present AutoFHE, which automatically adapts standard CNNs for secure inference under RNS-CKKS. The key idea is to adopt layerwise mixed-degree polynomial activation functions, which are optimized jointly with the homomorphic evaluation architecture in terms of the placement of bootstrapping operations. The problem is modeled within a multi-objective optimization framework to maximize accuracy and minimize the number of bootstrapping operations. AutoFHE can be applied flexibly on any CNN architecture, and it provides diverse solutions that span the trade-off between accuracy and latency. Experimental evaluation over RNS-CKKS encrypted CIFAR datasets shows that AutoFHE accelerates secure inference by 1.32x to 1.8x compared to methods employing high-degree polynomials. It also improves accuracy by up to 2.56% compared to methods using low-degree polynomials. Lastly, AutoFHE accelerates inference and improves accuracy by 103x and 3.46%, respectively, compared to CNNs under TFHE.",
    "author": "Authors:Wei Ao and Vishnu Naresh Boddeti,Michigan State University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/ao",
    "comment": ""
  },
  {
    "title": "Closed-Form Bounds for DP-SGD against Record-level Inference",
    "abstract": "Abstract:Machine learning models trained with differentially-private (DP) algorithms such as DP-SGD enjoy resilience against a wide range of privacy attacks. Although it is possible to derive bounds for some attacks based solely on an (ε,δ)-DP guarantee, meaningful bounds require a small enough privacy budget (i.e., injecting a large amount of noise), which results in a large loss in utility. This paper presents a new approach to evaluate the privacy of machine learning models against specific record-level threats, such as membership and attribute inference, without the indirection through DP. We focus on the popular DP-SGD algorithm, and derive simple closed-form bounds. Our proofs model DP-SGD as an information theoretic channel whose inputs are the secrets that an attacker wants to infer (e.g., membership of a data record) and whose outputs are the intermediate model parameters produced by iterative optimization. We obtain bounds for membership inference that match state-of-the-art techniques, whilst being orders of magnitude faster to compute. Additionally, we present a novel data-dependent bound against attribute inference. Our results provide a direct, interpretable, and practical way to evaluate the privacy of trained models against specific inference threats without sacrificing utility.",
    "author": "Authors:Giovanni Cherubin,Microsoft Security Response Center;Boris Köpf,Microsoft Azure Research;Andrew Paverd,Microsoft Security Response Center;Shruti Tople,Microsoft Azure Research;Lukas Wutschitz,Microsoft M365 Research;Santiago Zanella-Béguelin,Microsoft Azure Research",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/cherubin",
    "comment": ""
  },
  {
    "title": "SmartCookie: Blocking Large-Scale SYN Floods with a Split-Proxy Defense on Programmable Data Planes",
    "abstract": "Abstract:Despite decades of mitigation efforts, SYN flooding attacks continue to increase in frequency and scale, and adaptive adversaries continue to evolve. Meanwhile, volumes of benign traffic in modern networks are also growing rampantly. As a result, network providers, which run thousands of servers and process 100s of Gbps of traffic, find themselves urgently requiring defenses that are secure against adaptive adversaries, scalable against large volumes of traffic, and highly performant for benign applications. Unfortunately, existing defenses local to a single device (e.g., purely software-based or hardware-based) are failing to keep up with growing attacks and struggle to provide performance, security, or both. In this paper, we present SmartCookie, the first system to run cryptographically secure SYN cookie checks on high-speed programmable switches, for both security and performance. Our novel split-proxy defense leverages emerging programmable switches to block 100% of SYN floods in the switch data plane and also uses state-of-the-art kernel technologies such as eBPF to enable scalability for serving benign traffic. SmartCookie defends against adaptive adversaries at two orders of magnitude greater attack traffic than traditional CPU-based software defenses, blocking attacks of 136.9 Mpps without packet loss. We also achieve 2x-6.5x lower end-to-end latency for benign traffic compared to existing switch-based hardware defenses.",
    "author": "Authors:Sophia Yoo, Xiaoqi Chen, and Jennifer Rexford,Princeton University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/yoo",
    "comment": ""
  },
  {
    "title": "When the User Is Inside the User Interface: An Empirical Study of UI Security Properties in Augmented Reality",
    "abstract": "Abstract:Augmented reality (AR) experiences place users inside the user interface (UI), where they can see and interact with three-dimensional virtual content. This paper explores UI security for AR platforms, for which we identify three UI security-related properties: Same Space (how does the platform handle virtual content placed at the same coordinates?), Invisibility (how does the platform handle invisible virtual content?), and Synthetic Input (how does the platform handle simulated user input?). We demonstrate the security implications of different instantiations of these properties through five proof-of-concept attacks between distrusting AR application components (i.e., a main app and an included library) — including a clickjacking attack and an object erasure attack. We then empirically investigate these UI security properties on five current AR platforms: ARCore (Google), ARKit (Apple), Hololens (Microsoft), Oculus (Meta), and WebXR (browser). We find that all platforms enable at least three of our proof-of-concept attacks to succeed. We discuss potential future defenses, including applying lessons from 2D UI security and identifying new directions for AR UI security.",
    "author": "Authors:Kaiming Cheng, Arkaprabha Bhattacharya, Michelle Lin, Jaewook Lee, Aroosh Kumar, Jeffery F. Tian, Tadayoshi Kohno, and Franziska Roesner,University of Washington",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/cheng-kaiming",
    "comment": ""
  },
  {
    "title": "ACAI: Protecting Accelerator Execution with Arm Confidential Computing Architecture",
    "abstract": "Abstract:Trusted execution environments in several existing and upcoming CPUs demonstrate the success of confidential computing, with the caveat that tenants cannot securely use accelerators such as GPUs and FPGAs. In this paper, we reconsider the Arm Confidential Computing Architecture (CCA) design, an upcoming TEE feature in Armv9-A, to address this gap. We observe that CCA offers the right abstraction and mechanisms to allow confidential VMs to use accelerators as a first-class abstraction. We build ACAI, a CCA-based solution, with a principled approach of extending CCA security invariants to device-side access to address several critical security gaps. Our experimental results on GPU and FPGA demonstrate the feasibility of ACAI while maintaining security guarantees.",
    "author": "Authors:Supraja Sridhara, Andrin Bertschi, Benedict Schlüter, Mark Kuhne, Fabio Aliberti, and Shweta Shinde,ETH Zurich",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/sridhara",
    "comment": ""
  },
  {
    "title": "How WEIRD is Usable Privacy and Security Research?",
    "abstract": "Abstract:In human factor fields such as human-computer interaction (HCI) and psychology, researchers have been concerned that participants mostly come from WEIRD (Western, Educated, Industrialized, Rich, and Democratic) countries. This WEIRD skew may hinder understanding of diverse populations and their cultural differences. The usable privacy and security (UPS) field has inherited many research methodologies from research on human factor fields. We conducted a literature review to understand the extent to which participant samples in UPS papers were from WEIRD countries and the characteristics of the methodologies and research topics in each user study recruiting Western or non-Western participants. We found that the skew toward WEIRD countries in UPS is greater than that in HCI. Geographic and linguistic barriers in the study methods and recruitment methods may cause researchers to conduct user studies locally. In addition, many papers did not report participant demographics, which could hinder the replication of the reported studies, leading to low reproducibility. To improve geographic diversity, we provide the suggestions including facilitate replication studies, address geographic and linguistic issues of study/recruitment methods, and facilitate research on the topics for non-WEIRD populations.",
    "author": "Authors:Ayako A. Hasegawa and Daisuke Inoue,NICT;Mitsuaki Akiyama,NTT",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/hasegawa",
    "comment": ""
  },
  {
    "title": "\"I Don't Know If We're Doing Good. I Don't Know If We're Doing Bad\": Investigating How Practitioners Scope, Motivate, and Conduct Privacy Work When Developing AI Products",
    "abstract": "Abstract:How do practitioners who develop consumer AI products scope, motivate, and conduct privacy work? Respecting privacy is a key principle for developing ethical, human-centered AI systems, but we cannot hope to better support practitioners without answers to that question. We interviewed 35 industry AI practitioners to bridge that gap. We found that practitioners viewed privacy as actions taken against pre-defined intrusions that can be exacerbated by the capabilities and requirements of AI, but few were aware of AI-specific privacy intrusions documented in prior literature. We found that their privacy work was rigidly defined and situated, guided by compliance with privacy regulations and policies, and generally demotivated beyond meeting minimum requirements. Finally, we found that the methods, tools, and resources they used in their privacy work generally did not help address the unique privacy risks introduced or exacerbated by their use of AI in their products. Collectively, these findings reveal the need and opportunity to create tools, resources, and support structures to improve practitioners' awareness of AI-specific privacy risks, motivations to do AI privacy work, and ability to address privacy harms introduced or exacerbated by their use of AI in consumer products.",
    "author": "Authors:Hao-Ping (Hank) Lee,Carnegie Mellon University;Lan Gao and Stephanie Yang,Georgia Institute of Technology;Jodi Forlizzi and Sauvik Das,Carnegie Mellon University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/lee",
    "comment": ""
  },
  {
    "title": "A High Coverage Cybersecurity Scale Predictive of User Behavior",
    "abstract": "Abstract:Psychometric security scales can enable various crucial tasks (e.g., measuring changes in user behavior over time), but, unfortunately, they often fail to accurately predict actual user behavior. We hypothesize that one can enhance prediction accuracy via more comprehensive scales measuring a wider range of security-related factors. To test this hypothesis, we ran a series of four online studies with a total of 1,471 participants. First, we developed the extended security behavior scale (ESBS), a high-coverage scale containing substantially more items than prior ones, and collected responses to characterize its underlying structure. Then, we conducted a follow-up study to confirm ESBS' structural validity and reliability. Finally, over the course of two studies, we elicited user responses to our scale and prior ones while measuring three security behaviors reflected by Internet browser data. Then, we constructed predictive machine-learning models and found that ESBS can predict these behaviors with statistically significantly higher accuracy than prior scales (6.17%–8.53% ROC AUC), thus supporting our hypothesis.",
    "author": "Authors:Yukiko Sawaya,KDDI Research Inc.;Sarah Lu,Massachusetts Institute of Technology;Takamasa Isohara,KDDI Research Inc.;Mahmood Sharif,Tel Aviv University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/sawaya",
    "comment": ""
  },
  {
    "title": "NetShaper: A Differentially Private Network Side-Channel Mitigation System",
    "abstract": "Abstract:The widespread adoption of encryption in network protocols has significantly improved the overall security of many Internet applications. However, these protocols cannot prevent network side-channel leaks—leaks of sensitive information through the sizes and timing of network packets. We present NetShaper, a system that mitigates such leaks based on the principle of traffic shaping. NetShaper's traffic shaping provides differential privacy guarantees while adapting to the prevailing workload and congestion condition, and allows configuring a tradeoff between privacy guarantees, bandwidth and latency overheads. Furthermore, NetShaper provides a modular and portable tunnel endpoint design that can support diverse applications. We present a middlebox-based implementation of NetShaper and demonstrate its applicability in a video streaming and a web service application.",
    "author": "Authors:Amir Sabzi, Rut Vora, Swati Goswami, Margo Seltzer, Mathias Lécuyer, and Aastha Mehta,University of British Columbia",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/sabzi",
    "comment": ""
  },
  {
    "title": "Splitting the Difference on Adversarial Training",
    "abstract": "Abstract:The existence of adversarial examples points to a basic weakness of deep neural networks. One of the most effective defenses against such examples, adversarial training, entails training models with some degree of robustness, usually at the expense of a degraded natural accuracy. Most adversarial training methods aim to learn a model that finds, for each class, a common decision boundary encompassing both the clean and perturbed examples. In this work, we take a fundamentally different approach by treating the perturbed examples of each class as a separate class to be learned, effectively splitting each class into two classes: \"clean\" and \"adversarial.\" This split doubles the number of classes to be learned, but at the same time considerably simplifies the decision boundaries. We provide a theoretical plausibility argument that sheds some light on the conditions under which our approach can be expected to be beneficial. Likewise, we empirically demonstrate that our method learns robust models while attaining optimal or near-optimal natural accuracy, e.g., on CIFAR-10 we obtain near-optimal natural accuracy of 95.01% alongside significant robustness across multiple tasks. The ability to achieve such near-optimal natural accuracy, while maintaining a significant level of robustness, makes our method applicable to real-world applications where natural accuracy is at a premium.  As a whole, our main contribution is a general method that confers a significant level of robustness upon classifiers with only minor or negligible degradation of their natural accuracy.",
    "author": "Authors:Matan Levi and Aryeh Kontorovich,Ben-Gurion University of the Negev",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/levi",
    "comment": ""
  },
  {
    "title": "Quantifying Privacy Risks of Prompts in Visual Prompt Learning",
    "abstract": "Abstract:Large-scale pre-trained models are increasingly adapted to downstream tasks through a new paradigm called prompt learning. In contrast to fine-tuning, prompt learning does not update the pre-trained model's parameters. Instead, it only learns an input perturbation, namely prompt, to be added to the downstream task data for predictions. Given the fast development of prompt learning, a well-generalized prompt inevitably becomes a valuable asset as significant effort and proprietary data are used to create it. This naturally raises the question of whether a prompt may leak the proprietary information of its training data. In this paper, we perform the first comprehensive privacy assessment of prompts learned by visual prompt learning through the lens of property inference and membership inference attacks. Our empirical evaluation shows that the prompts are vulnerable to both attacks. We also demonstrate that the adversary can mount a successful property inference attack with limited cost. Moreover, we show that membership inference attacks against prompts can be successful with relaxed adversarial assumptions. We further make some initial investigations on the defenses and observe that our method can mitigate the membership inference attacks with a decent utility-defense trade-off but fails to defend against property inference attacks. We hope our results can shed light on the privacy risks of the popular prompt learning paradigm. To facilitate the research in this direction, we will share our code and models with the community.",
    "author": "Authors:Yixin Wu, Rui Wen, and Michael Backes,CISPA Helmholtz Center for Information Security;Pascal Berrang,University of Birmingham;Mathias Humbert,University of Lausanne;Yun Shen,Netapp;Yang Zhang,CISPA Helmholtz Center for Information Security",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/wu-yixin",
    "comment": ""
  },
  {
    "title": "Understanding How to Inform Blind and Low-Vision Users about Data Privacy through Privacy Question Answering Assistants",
    "abstract": "Abstract:Understanding and managing data privacy in the digital world can be challenging for sighted users, let alone blind and low-vision (BLV) users. There is limited research on how BLV users, who have special accessibility needs, navigate data privacy, and how potential privacy tools could assist them. We conducted an in-depth qualitative study with 21 US BLV participants to understand their data privacy risk perception and mitigation, as well as their information behaviors related to data privacy. We also explored BLV users' attitudes towards potential privacy question answering (Q&A) assistants that enable them to better navigate data privacy information. We found that BLV users face heightened security and privacy risks, but their risk mitigation is often insufficient.  They do not necessarily seek data privacy information but clearly recognize the benefits of a potential privacy Q&A assistant.  They also expect privacy Q&A assistants to possess cross-platform compatibility, support multi-modality, and demonstrate robust functionality. Our study sheds light on BLV users' expectations when it comes to usability, accessibility, trust and equity issues regarding digital data privacy.",
    "author": "Authors:Yuanyuan Feng,University of Vermont;Abhilasha Ravichander,Allen Institute for Artificial Intelligence;Yaxing Yao,Virginia Tech;Shikun Zhang and Rex Chen,Carnegie Mellon University;Shomir Wilson,Pennsylvania State University;Norman Sadeh,Carnegie Mellon University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/feng-yuanyuan",
    "comment": ""
  },
  {
    "title": "Two Shuffles Make a RAM: Improved Constant Overhead Zero Knowledge RAM",
    "abstract": "Abstract:We optimize Zero Knowledge (ZK) proofs of statements expressed as RAM programs over arithmetic values. Our arithmetic-circuit-based read/write memory uses only 4 input gates and 6 multiplication gates per memory access. This is an almost 3× total gate improvement over prior state of the art (Delpech de Saint Guilhem et al., SCN'22).We implemented our memory in the context of ZK proofs based on vector oblivious linear evaluation (VOLE), and we further optimized based on techniques available in the VOLE setting. Our experiments show that (1) our total runtime improves over that of the prior best VOLE-ZK RAM (Franzese et al., CCS'21) by 2-20× and (2) on a typical hardware setup, we can achieve ≈ 600K RAM accesses per second.We also develop improved read-only memory and set ZK data structures. These are used internally in our read/write memory and improve over prior work.",
    "author": "Authors:Yibin Yang,Georgia Institute of Technology;David Heath,University of Illinois Urbana-Champaign",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/yang-yibin",
    "comment": ""
  },
  {
    "title": "Dissecting Privacy Perspectives of Websites Around the World: \"Aceptar Todo, Alle Akzeptieren, Accept All...\"",
    "abstract": "Abstract:Privacy has become a significant concern as the processing, storage, and sharing of collected data expands. In order to take precautions against this increasing issue, countries and different government entities have enacted laws for the protection of privacy, and articles regarding acquiring consent from the user to collect data (i.e., via cookies) have been regulated such as the right of one to be informed and to manage their preferences. Even though there are many regulations, still many websites do not transparently provide their users with their privacy practices and cookie consent notices, and restrict one's rights or make it difficult to set/choose their privacy preferences. The main objective of this study is to analyze whether websites from around the world inform their users about the collection of their data and to identify how easy or difficult for users to set their privacy preferences in practice. While observing the differences between countries, we also aim to examine whether there is an effect of geographical location on privacy approaches and whether the applications and interpretations of countries that follow and comply with the same laws are similar. For this purpose, we have developed an automated tool to scan the privacy notices on the 500 most popular websites in different countries around the world. Our extensive analysis indicates that in some countries users are rarely informed and even in countries with high cookie consent notifications, offering the option to refuse is still very low despite the fact that it is part of their regulations. The highest rate of reject buttons on cookie banners in the countries studied is 35%. Overall, although the law gives the user the right to refuse consent and be informed, we have concluded that this does not apply in practice in most countries. Moreover, in many cases, the implementations are convoluted and not user-friendly at all.",
    "author": "Authors:Aysun Ogut, Berke Turanlioglu, Doruk Can Metiner, Albert Levi, Cemal Yilmaz, and Orcun Cetin,Sabanci University, Tuzla, Istanbul, Turkiye;Selcuk Uluagac,Cyber-Physical Systems Security Lab, Florida International University, Miami, Florida, USA",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/ogut",
    "comment": ""
  },
  {
    "title": "Voice App Developer Experiences with Alexa and Google Assistant: Juggling Risks, Liability, and Security",
    "abstract": "Abstract:Voice applications (voice apps) are a key element in Voice Assistant ecosystems such as Amazon Alexa and Google Assistant, as they provide assistants with a wide range of capabilities that users can invoke with a voice command. Most voice apps, however, are developed by third parties—i.e., not by Amazon/Google—and they are included in the ecosystem through marketplaces akin to smartphone app stores but with crucial differences, e.g., the voice app code is not hosted by the marketplace and is not run on the local device. Previous research has studied the security and privacy issues of voice apps in the wild, finding evidence of bad practices by voice app developers. However, developers' perspectives are yet to be explored.In this paper, we report a qualitative study of the experiences of voice app developers and the challenges they face. Our findings suggest that: 1) developers face several risks due to liability pushed on to them by the more powerful voice assistant platforms, which are linked to negative privacy and security outcomes on voice assistant platforms; and 2) there are key issues around monetization, privacy, design, and testing rooted in problems with the voice app certification process. We discuss the implications of our results for voice app developers, platforms, regulators, and research on voice app development and certification.",
    "author": "Authors:William Seymour,King's College London;Noura Abdi,Liverpool Hope University;Kopo M. Ramokapane,University of Bristol;Jide Edu,University of Strathclyde;Guillermo Suarez-Tangil,IMDEA Networks Institute;Jose Such,King's College London & Universitat Politecnica de Valencia",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/seymour",
    "comment": ""
  },
  {
    "title": "Scalable Multi-Party Computation Protocols for Machine Learning in the Honest-Majority Setting",
    "abstract": "Abstract:In this paper, we present a novel and scalable multi-party computation (MPC) protocol tailored for privacy-preserving machine learning (PPML) with semi-honest security in the honest-majority setting. Our protocol utilizes the Damgaard-Nielsen (Crypto '07) protocol with Mersenne prime fields. By leveraging the special properties of Mersenne primes, we are able to design highly efficient protocols for securely computing operations such as truncation and comparison. Additionally, we extend the two-layer multiplication protocol in ATLAS (Crypto '21) to further reduce the round complexity of operations commonly used in neural networks.Our protocol is very scalable in terms of the number of parties involved. For instance, our protocol completes the online oblivious inference of a 4-layer convolutional neural network with 63 parties in  0.1 seconds and 4.6 seconds in the LAN and WAN settings, respectively. To the best of our knowledge, this is the first fully implemented protocol in the field of PPML that can successfully run with such a large number of parties. Notably, even in the three-party case, the online phase of our protocol is more than 1.4x faster than the Falcon (PETS '21) protocol.",
    "author": "Authors:Fengrun Liu,University of Science and Technology of China & Shanghai Qi Zhi Institute;Xiang Xie,Shanghai Qi Zhi Institute & PADO Labs;Yu Yu,Shanghai Jiao Tong University & State Key Laboratory of Cryptology",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/liu-fengrun",
    "comment": ""
  },
  {
    "title": "Cascade: CPU Fuzzing via Intricate Program Generation",
    "abstract": "Abstract:Generating interesting test cases for CPU fuzzing is akin to generating programs that exercise unusual states inside the CPU. The performance of CPU fuzzing is heavily influenced by the quality of these programs and by the overhead of bug detection. Our analysis of existing state-of-the-art CPU fuzzers shows that they generate programs that are either overly simple or execute a small fraction of their instructions due to invalid control flows. Combined with expensive instruction-granular bug detection mechanisms, this leads to inefficient fuzzing campaigns. We present Cascade, a new approach for generating valid RISC-V programs of arbitrary length with highly randomized and interdependent control and data flows. Cascade relies on a new technique called asymmetric ISA pre-simulation for entangling control flows with data flows when generating programs. This entanglement results in non-termination when a program triggers a bug in the target CPU, enabling Cascade to detect a CPU bug at program granularity without introducing any runtime overhead. Our evaluation shows that long Cascade programs are more effective in exercising the CPU's internal design. Cascade achieves 28.2x to 97x more coverage than the state-of-the-art CPU fuzzers and uncovers 37 new bugs (28 new CVEs) in 5 RISC-V CPUs with varying degrees of complexity. The programs that trigger these bugs are long and intricate, impeding triaging. To address this challenge, Cascade features an automated pruning method that reduces a program to a minimal number of instructions that trigger the bug.",
    "author": "Authors:Flavien Solt, Katharina Ceesay-Seitz, and Kaveh Razavi,ETH Zurich",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/solt",
    "comment": ""
  },
  {
    "title": "Spider-Scents: Grey-box Database-aware Web Scanning for Stored XSS",
    "abstract": "Abstract:As web applications play an ever more important role in society, so does ensuring their security. A large threat to web application security is XSS vulnerabilities, and in particular, stored XSS. Due to the complexity of web applications and the difficulty of properly injecting XSS payloads into a web application, many of these vulnerabilities still evade current state-of-the-art scanners. We approach this problem from a new direction—by injecting XSS payloads directly into the database we can completely bypass the difficulty of injecting XSS payloads into a web application. We thus propose Spider-Scents, a novel method for grey-box database-aware scanning for stored XSS, that maps database values to the web application and automatically finds unprotected outputs. Spider-Scents reveals code smells that expose stored XSS vulnerabilities. We evaluate our approach on a set of 12 web applications and compare with three state-of-the-art black-box scanners. We demonstrate improvement of database coverage, ranging from 79% to 100% database coverage across the applications compared to the range of 2% to 60% for the other scanners. We systematize the relationship between unprotected outputs, vulnerabilities, and exploits in the context of stored XSS. We manually analyze unprotected outputs reported by Spider-Scents to determine their vulnerability and exploitability. In total, this method finds 85 stored XSS vulnerabilities, outperforming the union of state-of-the-art's 32.",
    "author": "Authors:Eric Olsson and Benjamin Eriksson,Chalmers University of Technology;Adam Doupé,Arizona State University;Andrei Sabelfeld,Chalmers University of Technology",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/olsson",
    "comment": ""
  },
  {
    "title": "Less is More: Revisiting the Gaussian Mechanism for Differential Privacy",
    "abstract": "Abstract:Differential privacy (DP) via output perturbation has been a de facto standard for releasing query or computation results on sensitive data. Different variants of the classic Gaussian mechanism have been developed to reduce the magnitude of the noise and improve the utility of sanitized query results.  However, we identify that all existing Gaussian mechanisms suffer from the curse of full-rank covariance matrices, and hence the expected accuracy losses of these mechanisms equal the trace of the covariance matrix of the noise. Particularly, for query results with multiple entries, in order to achieve DP, the expected accuracy loss of the classic Gaussian mechanism, that of the analytic Gaussian mechanism, and that of the  Matrix-Variate Gaussian (MVG) mechanism are lower bounded by terms that scales linearly with the number of entries.To lift this curse, we design a Rank-1 Singular Multivariate Gaussian (R1SMG) mechanism. It achieves DP on high dimension query results by perturbing the results with noise following a singular multivariate Gaussian distribution, whose covariance matrix  is a randomly generated rank-1 positive semi-definite matrix.  In contrast, the classic Gaussian mechanism and its variants all consider deterministic full-rank covariance matrices. Our idea  is motivated by a clue from Dwork et al.'s seminal work on the classic Gaussian mechanism that has been ignored in the literature: when projecting multivariate Gaussian noise with a full-rank covariance matrix onto a set of orthonormal basis, only the coefficient of a single basis can contribute to the privacy guarantee.This paper makes the following technical contributions.(i) The R1SMG mechanisms achieves DP guarantee on high dimension query results in, while its expected accuracy loss is lower bounded by a term that is on a lower order of magnitude by at least the dimension of query results compared with that of the classic Gaussian mechanism, of the analytic Gaussian mechanism, and of the MVG mechanism.(ii) Compared with other mechanisms, the R1SMG mechanism is  more stable and less likely to generate noise with large magnitude that overwhelms the query results, because the kurtosis and skewness of the nondeterministic accuracy loss introduced by this mechanism is larger than that introduced by other mechanisms.",
    "author": "Authors:Tianxi Ji,Texas Tech University;Pan Li,Case Western Reserve University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/ji",
    "comment": ""
  },
  {
    "title": "DaCapo: Automatic Bootstrapping Management for Efficient Fully Homomorphic Encryption",
    "abstract": "Abstract:By supporting computation on encrypted data, fully homomorphic encryption (FHE) offers the potential for privacy-preserving computation offloading. However, its applicability is constrained to small programs because each FHE multiplication increases the scale of a ciphertext with a limited scale capacity. By resetting the accumulated scale, bootstrapping enables a longer FHE multiplication chain. Nonetheless, manual bootstrapping placement poses a significant programming burden to avoid scale overflow from insufficient bootstrapping or the substantial computational overhead of unnecessary bootstrapping. Additionally, the bootstrapping placement affects costs of FHE operations due to changes in scale management, further complicating the overall management process.This work proposes DaCapo, the first automatic bootstrapping management compiler. Aiming to reduce bootstrapping counts, DaCapo analyzes live-out ciphertexts at each program point and identifies candidate points for inserting bootstrapping operations. DaCapo estimates the FHE operation latencies under different scale management scenarios for each bootstrapping placement plan at each candidate point, and decides the bootstrapping placement plan with minimal latency. This work evaluates DaCapo with deep learning models that existing FHE compilers cannot compile due to a lack of bootstrapping support. The evaluation achieves 1.21x speedup on average compared to manually implemented FHE programs.",
    "author": "Authors:Seonyoung Cheon, Yongwoo Lee, Dongkwan Kim, and Ju Min Lee,Yonsei University;Sunchul Jung and Taekyung Kim,CryptoLab. Inc.;Dongyoon Lee,Stony Brook University;Hanjun Kim,Yonsei University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/cheon",
    "comment": ""
  },
  {
    "title": "Code is not Natural Language: Unlock the Power of Semantics-Oriented Graph Representation for Binary Code Similarity Detection",
    "abstract": "Abstract:Binary code similarity detection (BCSD) has garnered significant attention in recent years due to its crucial role in various binary code-related tasks, such as vulnerability search and software plagiarism detection. Currently, BCSD systems are typically based on either instruction streams or control flow graphs (CFGs). However, these approaches have limitations. Instruction stream-based approaches treat binary code as natural languages, overlooking well-defined semantic structures. CFG-based approaches exploit only the control flow structures, neglecting other essential aspects of code. Our key insight is that unlike natural languages, binary code has well-defined semantic structures, including intra-instruction structures, inter-instruction relations (e.g., def-use, branches), and implicit conventions (e.g. calling conventions). Motivated by that, we carefully examine the necessary relations and structures required to express the full semantics and expose them directly to the deep neural network through a novel semantics-oriented graph representation. Furthermore, we propose a lightweight multi-head softmax aggregator to effectively and efficiently fuse multiple aspects of the binary code. Extensive experiments show that our method significantly outperforms the state-of-the-art (e.g., in the x64-XC retrieval experiment with a pool size of 10000, our method achieves a recall score of 184%, 220%, and 153% over Trex, GMN, and jTrans, respectively).",
    "author": "Authors:Haojie He,School of Electronic Information and Electrical Engineering, Shanghai Jiao Tong University;Xingwei Lin,Ant Group;Ziang Weng and Ruijie Zhao,School of Electronic Information and Electrical Engineering, Shanghai Jiao Tong University;Shuitao Gan,Laboratory for Advanced Computing and Intelligence Engineering;Libo Chen,School of Electronic Information and Electrical Engineering, Shanghai Jiao Tong University;Yuede Ji,University of North Texas;Jiashui Wang,Ant Group;Zhi Xue,School of Electronic Information and Electrical Engineering, Shanghai Jiao Tong University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/he-haojie",
    "comment": ""
  },
  {
    "title": "Is It a Trap? A Large-scale Empirical Study And Comprehensive Assessment of Online Automated Privacy Policy Generators for Mobile Apps",
    "abstract": "Abstract:Privacy regulations protect and promote the privacy of individuals by requiring mobile apps to provide a privacy policy that explains what personal information is collected and how these apps process this information. However, developers often do not have sufficient legal knowledge to create such privacy policies. Online Automated Privacy Policy Generators (APPGs) can create privacy policies, but their quality and other characteristics can vary. In this paper, we conduct the first large-scale empirical study and comprehensive assessment of APPGs for mobile apps. Specifically, we scrutinize 10 APPGs on multiple dimensions. We further perform the market penetration analysis by collecting 46,472 Android app privacy policies from Google Play, discovering that nearly 20.1% of privacy policies could be generated by existing APPGs. Lastly, we point out that generated policies in our study do not fully comply with GDPR, CCPA, or LGPD. In summary, app developers must carefully select and use the appropriate APPGs with careful consideration to avoid potential pitfalls.",
    "author": "Authors:Shidong Pan and Dawen Zhang,CSIRO's Data61 & Australian National University;Mark Staples,CSIRO's Data61;Zhenchang Xing,CSIRO's Data61 & Australian National University;Jieshan Chen, Xiwei Xu, and Thong Hoang,CSIRO's Data61",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/pan-shidong-trap",
    "comment": ""
  },
  {
    "title": "ModelGuard: Information-Theoretic Defense Against Model Extraction Attacks",
    "abstract": "Abstract:Malicious utilization of a query interface can compromise the confidentiality of ML-as-a-Service (MLaaS) systems via model extraction attacks. Previous studies have proposed to perturb the predictions of the MLaaS system as a defense against model extraction attacks. However, existing prediction perturbation methods suffer from a poor privacy-utility balance and cannot effectively defend against the latest adaptive model extraction attacks. In this paper, we propose a novel prediction perturbation defense named ModelGuard, which aims at defending against adaptive model extraction attacks while maintaining a high utility of the protected system. We develop a general optimization problem that considers different kinds of model extraction attacks, and ModelGuard provides an information-theoretic defense to efficiently solve the optimization problem and achieve resistance against adaptive attacks. Experiments show that ModelGuard attains significantly better defensive performance against adaptive attacks with less loss of utility compared to previous defenses.",
    "author": "Authors:Minxue Tang and Anna Dai,Duke University;Louis DiValentin, Aolin Ding, and Amin Hass,Accenture;Neil Zhenqiang Gong, Yiran Chen, and Hai \"Helen\" Li,Duke University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/tang",
    "comment": ""
  },
  {
    "title": "The Unpatchables: Why Municipalities Persist in Running Vulnerable Hosts",
    "abstract": "Abstract:Many organizations continue to expose vulnerable systems for which patches exist, opening themselves up for cyberattacks. Local governments are found to be especially affected by this problem. Why are these systems not patched? Prior work relied on vulnerability scanning to observe unpatched systems, notification studies on remediating them, and on user studies of sysadmins to describe self-reported patching behavior, but they are rarely used together as we do in this study. We analyze scan data following standard industry practices and detect unpatched hosts across the set of 322 Dutch municipalities. Our first question is: Are these detections false positives? We engage with 29 security professionals working for 54 municipalities to collect ground truth.All detections were accurate. Our approach also uncovers a major misalignment between systems that the responsible CERT attributes to the municipalities and the systems the practitioners at municipalities believe they are responsible for. We then interviewed the professionals as to why these vulnerable systems were still exposed. We identify four explanations for non-patching: unaware, unable, retired and shut down. The institutional framework to mitigate cyber threats assumes that vulnerable systems are first correctly identified, then correctly attributed and notified, and finally correctly mitigated. Our findings illustrate that the first assumption is correct, the second one is not and the third one is more complicated in practice. We end with reflections on how to better remediate vulnerable hosts.",
    "author": "Authors:Aksel Ethembabaoglu, Rolf van Wegberg, Yury Zhauniarovich, and Michel van Eeten,Delft University of Technology",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/ethembabaoglu",
    "comment": ""
  },
  {
    "title": "Exploring Covert Third-party Identifiers through External Storage in the Android New Era",
    "abstract": "Abstract:Third-party tracking plays a vital role in the mobile app ecosystem, which relies on identifiers to gather user data across multiple apps. In the early days of Android, tracking SDKs could effortlessly access non-resettable hardware identifiers for third-party tracking. However, as privacy concerns mounted, Google has progressively restricted device identifier usage through Android system updates. In the new era, tracking SDKs are only allowed to employ user-resettable identifiers which users can also opt out of, prompting SDKs to seek alternative methods for reliable user identification across apps. In this paper, we systematically explore the practice of third-party tracking SDKs covertly storing their own generated identifiers on external storage, thereby circumventing Android's identifier usage restriction and posing a considerable threat to user privacy. We devise an analysis pipeline for an extensive large-scale investigation of this phenomenon, leveraging kernel-level instrumentation and UI testing techniques to automate the recording of app file operations at runtime. Applying our pipeline to 8,000 Android apps, we identified 17 third-party tracking SDKs that store identifiers on external storage.  Our analysis reveals that these SDKs employ a range of storage techniques, including hidden files and attaching to existing media files, to make their identifiers more discreet and persistent. We also found that most SDKs lack adequate security measures, compromising the confidentiality and integrity of identifiers and enabling deliberate attacks. Furthermore, we examined the impact of Scoped Storage - Android's latest defense mechanism for external storage on these covert third-party identifiers, and proposed a viable exploit that breaches such a defense mechanism. Our work underscores the need for greater scrutiny of third-party tracking practices and better solutions to safeguard user privacy in the Android ecosystem.",
    "author": "Authors:Zikan Dong,Beijing University of Posts and Telecommunications;Tianming Liu,Monash University/Huazhong University of Science and Technology;Jiapeng Deng and Haoyu Wang,Huazhong University of Science and Technology;Li Li,Beihang University;Minghui Yang and Meng Wang,OPPO;Guosheng Xu,Beijing University of Posts and Telecommunications;Guoai Xu,Harbin Institute of Technology, Shenzhen",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/dong-zikan",
    "comment": ""
  },
  {
    "title": "Fingerprinting Obfuscated Proxy Traffic with Encapsulated TLS Handshakes",
    "abstract": "Abstract:The global escalation of Internet censorship by nation-state actors has led to an ongoing arms race between censors and obfuscated circumvention proxies. Research over the past decade has extensively examined various fingerprinting attacks against individual proxy protocols and their respective countermeasures. In this paper, however, we demonstrate the feasibility of a protocol-agnostic approach to proxy detection, enabled by the shared characteristic of nested protocol stacks inherent to all forms of proxying and tunneling activities. We showcase the practicality of such approach by identifying one specific fingerprint--encapsulated TLS handshakes--that results from nested protocol stacks, and building similarity-based classifiers to isolate this unique fingerprint within encrypted traffic streams.Assuming the role of a censor, we build a detection framework and deploy it within a mid-size ISP serving upwards of one million users. Our evaluation demonstrates that the traffic of obfuscated proxies, even with random padding and multiple layers of encapsulations, can be reliably detected with minimal collateral damage by fingerprinting encapsulated TLS handshakes. While stream multiplexing shows promise as a viable countermeasure, we caution that existing obfuscations based on multiplexing and random padding alone are inherently limited, due to their inability to reduce the size of traffic bursts or the number of round trips within a connection. Proxy developers should be aware of these limitations, anticipate the potential exploitation of encapsulated TLS handshakes by the censors, and equip their tools with proactive countermeasures.",
    "author": "Authors:Diwen Xue,University of Michigan;Michalis Kallitsis,Merit Network, Inc.;Amir Houmansadr,UMass Amherst;Roya Ensafi,University of Michigan",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/xue-fingerprinting",
    "comment": ""
  },
  {
    "title": "VeriSimplePIR: Verifiability in SimplePIR at No Online Cost for Honest Servers",
    "abstract": "Abstract:We present VeriSimplePIR, a verifiable version of the state-of-the-art semi-honest SimplePIR protocol. VeriSimplePIR is a stateful verifiable PIR scheme guaranteeing that all queries are consistent with a fixed, well-formed database. It is the first efficient verifiable PIR scheme to not rely on an honest digest to ensure security; any digest, even one produced by a malicious server, is sufficient to commit to some database. This is due to our extractable verification procedure, which can extract the entire database from the consistency proof checked against each response.Furthermore, VeriSimplePIR ensures this strong security guarantee without compromising the performance of SimplePIR. The online communication overhead is roughly 1.1-1.5x SimplePIR, and the online computation time on the server is essentially the same. We achieve this low overhead via a novel one-time preprocessing protocol that generates a reusable proof that can verify any number of subsequent query-response pairs as long as no malicious behavior is detected. As soon as the verification procedure rejects a response from the server, the offline phase must be rerun to compute a new proof. VeriSimplePIR represents an approach to maliciously secure cryptography that is highly optimized for honest parties while maintaining security even in the presence of malicious adversaries.",
    "author": "Authors:Leo de Castro,MIT;Keewoo Lee,Seoul National University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/de-castro",
    "comment": ""
  },
  {
    "title": "SledgeHammer: Amplifying Rowhammer via Bank-level Parallelism",
    "abstract": "Abstract:Rowhammer is a hardware vulnerability in DDR memory by which attackers can perform specific access patterns in their own memory to flip bits in adjacent, uncontrolled rows with- out accessing them. Since its discovery by Kim et. al. (ISCA 2014), Rowhammer attacks have emerged as an alarming threat to numerous security mechanisms.In this paper, we show that Rowhammer attacks can in fact be more effective when combined with bank-level parallelism, a technique in which the attacker hammers multiple memory banks simultaneously. This allows us to increase the amount of Rowhammer-induced flips 7-fold and significantly speed up prior Rowhammer attacks relying on native code execution.Furthermore, we tackle the task of mounting browser-based Rowhammer attacks. Here, we develop a self-evicting ver- sion of multi-bank hammering, allowing us to replace clflush instructions with cache evictions. We then develop a novel method for detecting contiguous physical addresses using memory access timings, thereby obviating the need for trans- parent huge pages. Finally, by combining both techniques, we are the first, to our knowledge, to obtain Rowhammer bit flips on DDR4 memory from the Chrome and Firefox browsers running on default Linux configurations, without enabling transparent huge pages.",
    "author": "Authors:Ingab Kang,University of Michigan;Walter Wang and Jason Kim,Georgia Tech;Stephan van Schaik and Youssef Tobah,University of Michigan;Daniel Genkin,Georgia Tech;Andrew Kwong,UNC Chapel Hill;Yuval Yarom,Ruhr University Bochum",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/kang",
    "comment": ""
  },
  {
    "title": "The Challenges of Bringing Cryptography from Research Papers to Products: Results from an Interview Study with Experts",
    "abstract": "Abstract:Cryptography serves as the cornerstone of information security and privacy in modern society. While notable progress has been made in the implementation of cryptographic techniques, a substantial portion of research outputs in cryptography, which strive to offer robust security solutions, are either implemented inadequately or not at all. Our study aims to investigate the challenges involved in bringing cryptography innovations from papers to products.To address this open question, we conducted 21 semistructured interviews with cryptography experts who possess extensive experience (10+ years) in academia, industry, and nonprofit and governmental organizations. We aimed to gain insights into their experiences with deploying cryptographic research outputs, their perspectives on the process of bringing cryptography to products, and the necessary changes within the cryptography ecosystem to facilitate faster, wider, and more secure adoption.We identified several challenges including misunderstandings and miscommunication among stakeholders, unclear delineation of responsibilities, misaligned or conflicting incentives, and usability challenges when bringing cryptography from theoretical papers to end user products. Drawing upon our findings, we provide a set of recommendations for cryptography researchers and practitioners. We encourage better supporting cross-disciplinary engagement between cryptographers, standardization organizations, and software developers for increased cryptography adoption.",
    "author": "Authors:Konstantin Fischer,Ruhr University Bochum;Ivana Trummová,Czech Technical University in Prague;Phillip Gajland,Ruhr University Bochum and Max Planck Institute for Security and Privacy;Yasemin Acar,Paderborn University and The George Washington University;Sascha Fahl,CISPA - Helmholtz-Center for Information Security;Angela Sasse,Ruhr University Bochum",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/fischer",
    "comment": ""
  },
  {
    "title": "SpecLFB: Eliminating Cache Side Channels in Speculative Executions",
    "abstract": "Abstract:Cache side-channel attacks based on speculative executions are powerful and difficult to mitigate. Existing hardware defense schemes often require additional hardware data structures, data movement operations and/or complex logical computations, resulting in excessive overhead of both processor performance and hardware resources. To this end, this paper proposes SpecLFB, which utilizes the microarchitecture component, Line-Fill-Buffer, integrated with a proposed mechanism for load security check to prevent the establishment of cache side channels in speculative executions. To ensure the correctness and immediacy of load security check, a structure called ROB unsafe mask is designed for SpecLFB to track instruction state. To further reduce processor performance overhead, SpecLFB narrows down the protection scope of unsafe speculative loads and determines the time at which they can be deprotected as early as possible. SpecLFB has been implemented in the open-source RISC-V core, SonicBOOM, as well as in Gem5. For the enhanced SonicBOOM, its register-transfer-level (RTL) code is generated, and an FPGA hardware prototype burned with the core and running a Linux-kernel-based operating system is developed. Based on the evaluations in terms of security guarantee, performance overhead, and hardware resource overhead through RTL simulation, FPGA prototype experiment, and Gem5 simulation, it shows that SpecLFB effectively defends against attacks. It leads to a hardware resource overhead of only 0.6% and the performance overhead of only 1.85% and 3.20% in the FPGA prototype experiment and Gem5 simulation, respectively.",
    "author": "Authors:Xiaoyu Cheng,School of Cyber Science and Engineering, Southeast University, Nanjing, Jiangsu, China; Jiangsu Province Engineering Research Center of Security for Ubiquitous Network, China;Fei Tong,School of Cyber Science and Engineering, Southeast University, Nanjing, Jiangsu, China; Jiangsu Province Engineering Research Center of Security for Ubiquitous Network, China; Purple Mountain Laboratories, Nanjing, Jiangsu, China;Hongyu Wang,State Key Laboratory of Power Equipment Technology, School of Electrical Engineering, Chongqing University, China; Wiscom System Co., LTD, Nanjing, China;Zhe Zhou and Fang Jiang,School of Cyber Science and Engineering, Southeast University, Nanjing, Jiangsu, China; Jiangsu Province Engineering Research Center of Security for Ubiquitous Network, China;Yuxing Mao,State Key Laboratory of Power Equipment Technology, School of Electrical Engineering, Chongqing University, China",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/cheng-xiaoyu",
    "comment": ""
  },
  {
    "title": "Vulnerability-oriented Testing for RESTful APIs",
    "abstract": "Abstract:With the increasing popularity of APIs, ensuring their security has become a crucial concern. However, existing security testing methods for RESTful APIs usually lack targeted approaches to identify and detect security vulnerabilities. In this paper, we propose VOAPI2, a vulnerability-oriented API inspection framework designed to directly expose vulnerabilities in RESTful APIs, based on our observation that the type of vulnerability hidden in an API interface is strongly associated with its functionality. By leveraging this insight, we first track commonly used strings as keywords to identify APIs' functionality. Then, we generate a stateful and suitable request sequence to inspect the candidate API function within a targeted payload. Finally, we verify whether vulnerabilities exist or not through feedback-based testing. Our experiments on real-world APIs demonstrate the effectiveness of our approach, with significant improvements in vulnerability detection compared to state-of-the-art methods. VOAPI2 discovered 7 zero-day and 19 disclosed bugs on seven real-world RESTful APIs, and 23 of them have been assigned CVE IDs. Our findings highlight the importance of considering APIs' functionality when discovering their bugs, and our method provides a practical and efficient solution for securing RESTful APIs.",
    "author": "Authors:Wenlong Du and Jian Li,School of Electronic Information and Electrical Engineering, Shanghai Jiao Tong University;Yanhao Wang,Independent Researcher;Libo Chen, Ruijie Zhao, and Junmin Zhu,School of Electronic Information and Electrical Engineering, Shanghai Jiao Tong University;Zhengguang Han,QI-ANXIN Technology Group;Yijun Wang and Zhi Xue,School of Electronic Information and Electrical Engineering, Shanghai Jiao Tong University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/du",
    "comment": ""
  },
  {
    "title": "Hijacking Attacks against Neural Network by Analyzing Training Data",
    "abstract": "Abstract:Backdoors and adversarial examples are the two primary threats currently faced by deep neural networks (DNNs). Both attacks attempt to hijack the model behaviors with unintended outputs by introducing (small) perturbations to the inputs. However, neither attack is without limitations in practice. Backdoor attacks, despite the high success rates, often require the strong assumption that the adversary could tamper with the training data or code of the target model, which is not always easy to achieve in reality. Adversarial example attacks, which put relatively weaker assumptions on attackers, often demand high computational resources, yet do not always yield satisfactory success rates when attacking mainstream blackbox models in the real world. These limitations motivate the following research question: can model hijacking be achieved in a simpler way with more satisfactory attack performance and also more reasonable attack assumptions?In this paper, we provide a positive answer with CleanSheet, a new model hijacking attack that obtains the high performance of backdoor attacks without requiring the adversary to temper with the model training process. CleanSheet exploits vulnerabilities in DNNs stemming from the training data. Specifically, our key idea is to treat part of the clean training data of the target model as \"poisoned data\", and capture the characteristics of these data that are more sensitive to the model (typically called robust features) to construct \"triggers\". These triggers can be added to any input example to mislead the target model, similar to backdoor attacks. We validate the effectiveness of CleanSheet through extensive experiments on five datasets, 79 normally trained models, 68 pruned models, and 39 defensive models. Results show that CleanSheet exhibits performance comparable to state-of-theart backdoor attacks, achieving an average attack success rate (ASR) of 97.5% on CIFAR-100 and 92.4% on GTSRB, respectively. Furthermore, CleanSheet consistently maintains a high ASR, with most ASR surpassing 80%, when confronted with various mainstream backdoor defense mechanisms.",
    "author": "Authors:Yunjie Ge, Qian Wang, and Huayang Huang,Wuhan University;Qi Li,Tsinghua University; BNRist;Cong Wang,City University of Hong Kong;Chao Shen,Xi'an Jiaotong University;Lingchen Zhao,Wuhan University;Peipei Jiang,Wuhan University; City University of Hong Kong;Zheng Fang and Shenyi Zhang,Wuhan University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/ge-hijacking",
    "comment": ""
  },
  {
    "title": "SecurityNet: Assessing Machine Learning Vulnerabilities on Public Models",
    "abstract": "Abstract:While advanced machine learning (ML) models are deployed in numerous real-world applications, previous works demonstrate these models have security and privacy vulnerabilities. Various empirical research has been done in this field.  However, most of the experiments are performed on target ML models trained by the security researchers themselves. Due to the high computational resource requirement for training advanced models with complex architectures, researchers generally choose to train a few target models using relatively simple architectures on typical experiment datasets.  We argue that to understand ML models' vulnerabilities comprehensively, experiments should be performed on a large set of models trained with various purposes (not just the purpose of evaluating ML attacks and defenses). To this end, we propose using publicly available models with weights from the Internet (public models) for evaluating attacks and defenses on ML models. We establish a database, namely SecurityNet, containing 910 annotated image classification models. We then analyze the effectiveness of several representative attacks/defenses, including model stealing attacks, membership inference attacks, and backdoor detection on these public models. Our evaluation empirically shows the performance of these attacks/defenses can vary significantly on public models compared to self-trained models. We share SecurityNet with the research community and advocate researchers to perform experiments on public models to better demonstrate their proposed methods' effectiveness in the future.",
    "author": "Authors:Boyang Zhang, Zheng Li, Ziqing Yang, Xinlei He, Michael Backes, Mario Fritz, and Yang Zhang,CISPA Helmholtz Center for Information Security",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/zhang-boyang",
    "comment": ""
  },
  {
    "title": "Why Aren't We Using Passkeys? Obstacles Companies Face Deploying FIDO2 Passwordless Authentication",
    "abstract": "Abstract:When adopted by the W3C in 2019, the FIDO2 standard for passwordless authentication was touted as a replacement for passwords on the web. With FIDO2, users leverage passkeys (cryptographic credentials) to authenticate to websites. Even though major operating systems now support passkeys, compatible hardware is now widely available, and some major companies now offer passwordless options, both the deployment and adoption have been slow. As FIDO2 has many security and usability advantages over passwords, we investigate what obstacles hinder companies from large-scale deployment of passwordless authentication. We conducted 28 semi-structured interviews with chief information security officers (CISOs) and authentication managers from both companies that have and have not deployed passwordless authentication, as well as FIDO2 experts. Our results shed light on the current state of deployment and perception. We highlight key barriers to adoption, including account recovery, friction, technical issues, regulatory requirements, and security culture. From the obstacles identified, we make recommendations for increasing the adoption of passwordless authentication.",
    "author": "Authors:Leona Lassak,Ruhr University Bochum;Elleen Pan and Blase Ur,University of Chicago;Maximilian Golla,CISPA Helmholtz Center for Information Security",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/lassak",
    "comment": ""
  },
  {
    "title": "K-Waay: Fast and Deniable Post-Quantum X3DH without Ring Signatures",
    "abstract": "Abstract:The Signal protocol and its X3DH key exchange core are regularly used by billions of people in applications like WhatsApp but are unfortunately not quantum-secure. Thus, designing an efficient and post-quantum secure X3DH alternative is paramount. Notably, X3DH supports asynchronicity, as parties can immediately derive keys after uploading them to a central server, and deniability, allowing parties to plausibly deny having completed key exchange. To satisfy these constraints, existing post-quantum X3DH proposals use ring signatures (or equivalently a form of designated-verifier signatures) to provide authentication without compromising deniability as regular signatures would. Existing ring signature schemes, however, have some drawbacks. Notably, they are not generally proven secure in the quantum random oracle model (QROM) and so the quantum security of parameters that are proposed is unclear and likely weaker than claimed. In addition, they are generally slower than standard primitives like KEMs.In this work, we propose an efficient, deniable and post-quantum X3DH-like protocol that we call K-Waay, that does not rely on ring signatures. At its core, K-Waay uses a split-KEM, a primitive introduced by Brendel et al. [SAC 2020], to provide Diffie-Hellman-like implicit authentication and secrecy guarantees. Along the way, we revisit the formalism of Brendel et al. and identify that additional security properties are required to prove a split-KEM-based protocol secure. We instantiate split-KEM by building a protocol based on the Frodo key exchange protocol relying on the plain LWE assumption: our proofs might be of independent interest as we show it satisfies our novel unforgeability and deniability security notions. Finally, we complement our theoretical results by thoroughly benchmarking both K-Waay and existing X3DH protocols. Our results show even when using plain LWE and a conservative choice of parameters that K-Waay is significantly faster than previous work.",
    "author": "Authors:Daniel Collins and Loïs Huguenin-Dumittan,EPFL;Ngoc Khanh Nguyen,King’s College London;Nicolas Rolin,Spuerkeess;Serge Vaudenay,EPFL",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/collins",
    "comment": ""
  },
  {
    "title": "What IF Is Not Enough? Fixing Null Pointer Dereference With Contextual Check",
    "abstract": "Abstract:Null pointer dereference (NPD) errors pose the risk of unexpected behavior and system instability, potentially leading to abrupt program termination due to exceptions or segmentation faults. When generating NPD fixes, all existing solutions are confined to the function level fixes and ignore the valuable intraprocedural and interprocedural contextual information, potentially resulting in incorrect patches. In this paper, we introduce CONCH, a novel approach that addresses the challenges of generating correct fixes for NPD issues by incorporating contextual checks. Our method first constructs an NPD context graph to maintain the semantics related to patch generation. Then we summarize distinct fixing position selection policies based on the distribution of the error positions, ensuring the resolution of bugs without introducing duplicate code. Next, the intraprocedural state retrogression builds the if condition, retrogresses the local resources, and constructs return statements as an initial patch. Finally, we conduct interprocedural state propagation to assess the correctness of the initial patch in the entire call chain. We evaluate the effectiveness of CONCH over two real-world datasets. The experimental results demonstrate that CONCH outperforms the SOTA methods and yields over 85% accurate patches.",
    "author": "Authors:Yunlong Xing, Shu Wang, Shiyu Sun, Xu He, and Kun Sun,George Mason University;Qi Li,Tsinghua University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/xing-yunlong",
    "comment": ""
  },
  {
    "title": "Unveiling the Secrets without Data: Can Graph Neural Networks Be Exploited through Data-Free Model Extraction Attacks?",
    "abstract": "Abstract:Graph neural networks (GNNs) play a crucial role in various graph applications, such as social science, biology, and molecular chemistry. Despite their popularity, GNNs are still vulnerable to intellectual property threats. Previous studies have demonstrated the susceptibility of GNN models to model extraction attacks, where attackers steal the functionality of GNNs by sending queries and obtaining model responses. However, existing model extraction attacks often assume that the attacker has access to specific information about the victim model's training data, including node attributes, connections, and the shadow dataset. This assumption is impractical in real-world scenarios. To address this issue, we propose StealGNN, the first data-free model extraction attack framework against GNNs. StealGNN advances prior GNN extraction attacks in three key aspects: 1) It is completely data-free, as it does not require actual node features or graph structures to extract GNN models. 2) It constitutes a full-rank attack that can be applied to node classification and link prediction tasks, posing significant intellectual property threats across a wide range of graph applications. 3) It can handle the most challenging hard-label attack setting, where the attacker possesses no knowledge about the target GNN model and can only obtain predicted labels through querying the victim model. Our experimental results on four benchmark graph datasets demonstrate the effectiveness of StealGNN in attacking representative GNN models.",
    "author": "Authors:Yuanxin Zhuang, Chuan Shi, and Mengmei Zhang,Beijing University of Posts and Telecommunications;Jinghui Chen,The Pennsylvania State University;Lingjuan Lyu,SONY AI;Pan Zhou,Huazhong University of Science and Technology;Lichao Sun,Lehigh University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/zhuang",
    "comment": ""
  },
  {
    "title": "CacheWarp: Software-based Fault Injection using Selective State Reset",
    "abstract": "Abstract:AMD SEV is a trusted-execution environment (TEE), providing confidentiality and integrity for virtual machines (VMs). With AMD SEV, it is possible to securely run VMs on an untrusted hypervisor. While previous attacks demonstrated architectural shortcomings of earlier SEV versions, AMD claims that SEV-SNP prevents all attacks on the integrity.In this paper, we introduce CacheWarp, a new software-based fault attack on AMD SEV-ES and SEV-SNP, exploiting the possibility to architecturally revert modified cache lines of guest VMs to their previous (stale) state. Unlike previous attacks on the integrity, CacheWarp is not mitigated on the newest SEV-SNP implementation, and it does not rely on specifics of the guest VM. CacheWarp only has to interrupt the VM at an attacker-chosen point to invalidate modified cache lines without them being written back to memory. Consequently, the VM continues with architecturally stale data. In 3 case studies, we demonstrate an attack on RSA in the Intel IPP crypto library, recovering the entire private key, logging into an OpenSSH server without authentication, and escalating privileges to root via the sudo binary. While we implement a software-based mitigation proof-of-concept, we argue that mitigations are difficult, as the root cause is in the hardware.",
    "author": "Authors:Ruiyi Zhang, Lukas Gerlach, Daniel Weber, and Lorenz Hetterich,CISPA Helmholtz Center for Information Security;Youheng Lü,Independent;Andreas Kogler,Graz University of Technology;Michael Schwarz,CISPA Helmholtz Center for Information Security",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/zhang-ruiyi",
    "comment": ""
  },
  {
    "title": "Yes, One-Bit-Flip Matters! Universal DNN Model Inference Depletion with Runtime Code Fault Injection",
    "abstract": "Abstract:We propose, FrameFlip, a novel attack for depleting DNN model inference with runtime code fault injections. Notably, Frameflip operates independently of the DNN models deployed and succeeds with only a single bit-flip injection. This fundamentally distinguishes it from the existing DNN inference depletion paradigm that requires injecting tens of deterministic faults concurrently. Since our attack performs at the universal code or library level, the mandatory code snippet can be perversely called by all mainstream machine learning frameworks, such as PyTorch and TensorFlow, dependent on the library code. Using DRAM Rowhammer to facilitate end-to-end fault injection, we implement Frameflip across diverse model architectures (LeNet, VGG-16, ResNet-34 and ResNet-50) with different datasets (FMNIST, CIFAR-10, GTSRB, and ImageNet). With a single bit fault injection, Frameflip achieves high depletion efficacy that consistently renders the model inference utility as no better than guessing. We also experimentally verify that identified vulnerable bits are almost equally effective at depleting different deployed models. In contrast, transferability is unattainable for all existing state-of-the-art model inference depletion attacks. Frameflip is shown to be evasive against all known defenses, generally due to the nature of current defenses operating at the model level (which is model-dependent) in lieu of the underlying code level.",
    "author": "Authors:Shaofeng Li,Peng Cheng Laboratory;Xinyu Wang,Shanghai Jiao Tong University;Minhui Xue,CSIRO's Data61;Haojin Zhu,Shanghai Jiao Tong University;Zhi Zhang,University of Western Australia;Yansong Gao,CSIRO's Data61;Wen Wu,Peng Cheng Laboratory;Xuemin (Sherman) Shen,University of Waterloo",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/li-shaofeng",
    "comment": ""
  },
  {
    "title": "Key Recovery Attacks on Approximate Homomorphic Encryption with Non-Worst-Case Noise Flooding Countermeasures",
    "abstract": "Abstract:In this paper, we present novel key-recovery attacks on Approximate Homomorphic Encryption schemes, such as CKKS, when employing noise-flooding countermeasures based on non-worst-case noise estimation. Our attacks build upon and enhance the seminal work by Li and Micciancio at EUROCRYPT 2021. We demonstrate that relying on average-case noise estimation undermines noise-flooding countermeasures, even if the secure noise bounds derived from differential privacy as published by Li et al. at CRYPTO 2022 are implemented. This study emphasizes the necessity of adopting worst-case noise estimation in Approximate Homomorphic Encryption when sharing decryption results.We perform the proposed attacks on OpenFHE, an emerging open-source FHE library garnering increased attention. We experimentally demonstrate the ability to recover the secret key using just one shared decryption output. Furthermore, we investigate the implications of our findings for other libraries, such as IBM's HElib library, which allows experimental estimation of the noise bounds. Finally, we reveal that deterministic noise generation utilizing a pseudorandom generator fails to provide supplementary protection.",
    "author": "Authors:Qian Guo and Denis Nabokov,Lund University;Elias Suvanto,ENS Lyon;Thomas Johansson,Lund University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/guo-qian",
    "comment": ""
  },
  {
    "title": "Mudjacking: Patching Backdoor Vulnerabilities in Foundation Models",
    "abstract": "Abstract:Foundation model has become the backbone of the AI ecosystem. In particular, a foundation model can be used as a general-purpose feature extractor to build various downstream classifiers. However, foundation models are vulnerable to backdoor attacks and a backdoored foundation model is a single-point-of-failure of the AI ecosystem, e.g., multiple downstream classifiers inherit the backdoor vulnerabilities simultaneously. In this work, we propose Mudjacking, the first method to patch foundation models to remove backdoors. Specifically, given a misclassified trigger-embedded input detected after a backdoored foundation model is deployed, Mudjacking adjusts the parameters of the foundation model to remove the backdoor. We formulate patching a foundation model as an optimization problem and propose a gradient descent based method to solve it. We evaluate Mudjacking on both vision and language foundation models, eleven benchmark datasets, five existing backdoor attacks, and thirteen adaptive backdoor attacks. Our results show that Mudjacking can remove backdoor from a foundation model while maintaining its utility.",
    "author": "Authors:Hongbin Liu, Michael K. Reiter, and Neil Zhenqiang Gong,Duke University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/liu-hongbin",
    "comment": ""
  },
  {
    "title": "Does Online Anonymous Market Vendor Reputation Matter?",
    "abstract": "Abstract:Reputation is crucial for trust in underground markets such as online anonymous marketplaces (OAMs), where there is little recourse against unscrupulous vendors. These markets rely on eBay-like feedback scores and forum reviews as reputation signals to ensure market safety, driving away dishonest vendors and flagging low-quality or dangerous products. Despite their importance, there has been scant work exploring the correlation (or lack thereof) between reputation signals and vendor success. To fill this gap, we study vendor success from two angles: (i) longevity and (ii) future financial success, by studying eight OAMs from 2011 to 2023. We complement market data with social network features extracted from a OAM forum, and by qualitatively coding reputation signals from over 15,000 posts and comments across two subreddits. Using survival analysis techniques and simple Random Forest models, we show that feedback scores (including those imported from other markets) can explain vendors' longevity, but fail to predict vendor disappearance in the short term. Further, feedback scores are not the main predictors of future financial success. Rather, vendors who quickly generate revenue when they start on a market typically end up acquiring the most wealth overall. We show that our models generalize across different markets and time periods spanning over a decade. Our findings provide empirical insights into early identification of potential high-scale vendors, effectiveness of \"reputation poisoning\" strategies, and how reputation systems could contribute to harm reduction in OAMs. We find in particular that, despite their coarseness, existing reputation signals are useful to identify potentially dishonest sellers, and highlight some possible improvements.",
    "author": "Authors:Alejandro Cuevas and Nicolas Christin,Carnegie Mellon University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/cuevas",
    "comment": ""
  },
  {
    "title": "SWOOSH: Efficient Lattice-Based Non-Interactive Key Exchange",
    "abstract": "Abstract:The advent of quantum computers has sparked significant interest in post-quantum cryptographic schemes, as a replacement for currently used cryptographic primitives. In this context, lattice-based cryptography has emerged as the leading paradigm to build post-quantum cryptography. However, all existing viable replacements of the classical Diffie-Hellman key exchange require additional rounds of interactions, thus failing to achieve all the benefits of this protocol. Although earlier work has shown that lattice-based Non-Interactive Key Exchange (NIKE) is theoretically possible, it has been considered too inefficient for real-life applications. In this work, we challenge this folklore belief and provide the first evidence against it. We construct an efficient lattice-based NIKE whose security is based on the standard module learning with errors (M-LWE) problem in the quantum random oracle model. Our scheme is obtained in two steps: (i) A passively-secure construction that achieves a strong notion of correctness, coupled with (ii) a generic compiler that turns any such scheme into an actively-secure one. To substantiate our efficiency claim, we provide an optimised implementation of our passively-secure construction in Rust and Jasmin. Our implementation demonstrates the scheme's applicability to real-world scenarios, yielding public keys of approximately 220 KBs. Moreover, the computation of shared keys takes fewer than 12 million cycles on an Intel Skylake CPU, offering a post-quantum security level exceeding 120 bits.",
    "author": "Authors:Phillip Gajland,Max Planck Institute for Security and Privacy, Ruhr University Bochum;Bor de Kock,NTNU - Norwegian University of Science and Technology, Trondheim, Norway;Miguel Quaresma,Max Planck Institute for Security and Privacy;Giulio Malavolta,Bocconi University, Max Planck Institute for Security and Privacy;Peter Schwabe,Max Planck Institute for Security and Privacy, Radboud University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/gajland",
    "comment": ""
  },
  {
    "title": "Machine Learning needs Better Randomness Standards: Randomised Smoothing and PRNG-based attacks",
    "abstract": "Abstract:Randomness supports many critical functions in the field of machine learning (ML) including optimisation, data selection, privacy, and security. ML systems outsource the task of generating or harvesting randomness to the compiler, the cloud service provider or elsewhere in the toolchain. Yet there is a long history of attackers exploiting poor randomness, or even creating it—as when the NSA put backdoors in random number generators to break cryptography. In this paper we consider whether attackers can compromise an ML system using only the randomness on which they commonly rely. We focus our effort on Randomised Smoothing, a popular approach to train certifiably robust models, and to certify specific input datapoints of an arbitrary model. We choose Randomised Smoothing since it is used for both security and safety—to counteract adversarial examples and quantify uncertainty respectively. Under the hood, it relies on sampling Gaussian noise to explore the volume around a data point to certify that a model is not vulnerable to adversarial examples. We demonstrate an entirely novel attack, where an attacker backdoors the supplied randomness to falsely certify either an overestimate or an underestimate of robustness for up to 81 times. We demonstrate that such attacks are possible, that they require very small changes to randomness to succeed, and that they are hard to detect. As an example, we hide an attack in the random number generator and show that the randomness tests suggested by NIST fail to detect it. We advocate updating the NIST guidelines on random number testing to make them more appropriate for safety-critical and security-critical machine-learning applications.",
    "author": "Authors:Pranav Dahiya,University of Cambridge;Ilia Shumailov,University of Oxford;Ross Anderson,University of Cambridge & University of Edinburgh",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/dahiya",
    "comment": ""
  },
  {
    "title": "Tossing in the Dark: Practical Bit-Flipping on Gray-box Deep Neural Networks for Runtime Trojan Injection",
    "abstract": "Abstract:Although Trojan attacks on deep neural networks (DNNs) have been extensively studied, the threat of run-time Trojan injection has only recently been brought to attention. Unlike data poisoning attacks that target the training stage of a DNN model, a run-time attack executes an exploit such as Rowhammer on memory to flip the bits of the target model and thereby implant a Trojan. This threat is stealthier but more challenging, as it requires flipping a set of bits in the target model to introduce an effective Trojan without noticeably downgrading the model's accuracy. This has been achieved only under the less realistic assumption that the target model is fully shared with the adversary through memory, thus enabling them to flip bits across all model layers, including the last few layers.For the first time, we have investigated run-time Trojan Injection under a more realistic gray-box scenario. In this scenario, a model is perceived in an encoder-decoder manner: the encoder is public and shared through memory, while the decoder is private and so considered to be black-box and inaccessible to unauthorized parties. To address the unique challenge posed by the black-box decoder to Trojan injection in this scenario, we developed a suite of innovative techniques. Using these techniques, we constructed our gray-box attack, Groan, which stands out as both effective and stealthy. Our experiments show that Groan is capable of injecting a highly effective Trojan into the target model, while also largely preserving its performance, even in the presence of state-of-theart memory protection.",
    "author": "Authors:Zihao Wang, Di Tang, and XiaoFeng Wang,Indiana University Bloomington;Wei He, Zhaoyang Geng, and Wenhao Wang,SKLOIS, Institute of Information Engineering, Chinese Academy of Sciences",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/wang-zihao-tossing",
    "comment": ""
  },
  {
    "title": "Batch PIR and Labeled PSI with Oblivious Ciphertext Compression",
    "abstract": "Abstract:In this paper, we study two problems: oblivious compression and decompression of ciphertexts. In oblivious compression, a server holds a set of ciphertexts with a subset of encryptions  of zeroes whose positions are only known to the client. The goal is for the server to effectively compress the ciphertexts  obliviously, while preserving the non-zero plaintexts and without learning the plaintext values. For oblivious decompression,  the client, instead, succinctly encodes a sequence of plaintexts such that the server may decode encryptions of all plaintexts value, but the zeroes may be replaced with arbitrary values. We present solutions to both problems that construct lossless compressions as small as only 5% more than the optimal  minimum using only additive homomorphism. The crux of both algorithms involve embedding ciphertexts as random linear systems that are efficiently solvable.Using our compression schemes, we obtain state-of-the-art schemes for batch private information retrieval (PIR) where a client wishes to privately retrieve multiple entries from a server-held database in one query. We show that our compression  schemes may be used to reduce communication by up to 30% for batch PIR in both the single and two-server settings.Additionally, we study labeled private set intersection (PSI) in the unbalanced setting where one party's set is significantly smaller than the other party's set and each entry has associated  data. By utilizing our novel compression algorithm, we present a protocol with 65-88% reduction in communication with comparable computation compared to prior works.",
    "author": "Authors:Alexander Bienstock,New York University;Sarvar Patel and Joon Young Seo,Google;Kevin Yeo,Google and Columbia University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/bienstock",
    "comment": ""
  },
  {
    "title": "Pixel Thief: Exploiting SVG Filter Leakage in Firefox and Chrome",
    "abstract": "Abstract:Web privacy is challenged by pixel-stealing attacks, which allow attackers to extract content from embedded iframes and to detect visited links. To protect against multiple pixelstealing attacks that exploited timing variations in SVG filters, browser vendors repeatedly adapted their implementations to eliminate timing variations. In this work we demonstrate that past efforts are still not sufficient.We show how web-based attackers can mount cache-based side-channel attacks to monitor data-dependent memory accesses in filter rendering functions. We identify conditions under which browsers elect the non-default CPU implementation of SVG filters, and develop techniques for achieving access to the high-resolution timers required for cache attacks. We then develop efficient techniques to use the pixel-stealing attack for text recovery from embedded pages and to achieve high-speed history sniffing. To the best of our knowledge, our attack is the first to leak multiple bits per screen refresh, achieving an overall rate of 267 bits per second.",
    "author": "Authors:Sioli O'Connell,The University of Adelaide;Lishay Aben Sour and Ron Magen,Ben Gurion University of the Negev;Daniel Genkin,Georgia Institute of Technology;Yossi Oren,Ben-Gurion University of the Negev and Intel Corporation;Hovav Shacham,UT Austin;Yuval Yarom,Ruhr University Bochum",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/oconnell",
    "comment": ""
  },
  {
    "title": "ATTention Please! An Investigation of the App Tracking Transparency Permission",
    "abstract": "Abstract:Apple introduced the App Tracking Transparency (ATT) framework in iOS 14.5. The goal of this framework is to mitigate user concerns about how their privacy-sensitive data is used for targeted advertising. Through this framework, the OS generates an ATT alert to request user permission for tracking. While this alert includes developer-controlled alert text, Apple mandates this text adheres to specific guidelines to prevent users from being coerced into unwillingly granting the ATT permission for tracking. However, to improve apps' monetization, developers may incorporate dark patterns in the ATT alerts to deceive users into granting the permission.To understand the prevalence and characteristics of such dark patterns, we first study Apple's alert guidelines and identify four patterns that violate standards. We then develop ATTCLS, an ATT alert classification framework that combines contrastive learning for language modeling with a fully connected neural network for multi-label alert pattern classification. Finally, by applying ATTCLS to 4,000 iOS apps, we reveal that 59% of the alerts use four dark patterns that either mislead users, incentivize tracking, include confusing terms, or omit the purpose of the ATT permission.We then conduct a user study with 114 participants to examine users' understanding of ATT and how different alert patterns can influence their perception. This study reveals that ATT alerts used by current apps often deceive or confuse users. For instance, users can be misled into believing that granting the ATT permission guarantees better app features or that denying it protects all of their sensitive data. We envision that our developed tools and empirical results will aid mobile platforms to refine guidelines, introduce a strict vetting process, and better design privacy-related prompts for users.",
    "author": "Authors:Reham Mohamed and Arjun Arunasalam,Purdue University;Habiba Farrukh,University of California, Irvine;Jason Tong, Antonio Bianchi, and Z. Berkay Celik,Purdue University",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/mohamed",
    "comment": ""
  },
  {
    "title": "Unpacking Privacy Labels: A Measurement and Developer Perspective on Google's Data Safety Section",
    "abstract": "Abstract:Google has mandated developers to use Data Safety Sections (DSS) to increase transparency in data collection and sharing practices. In this paper, we present a comprehensive analysis of Google's Data Safety Section (DSS) using both quantitative and qualitative methods. We conduct the first large-scale measurement study of DSS using apps from Android Play store (n=1.1M). We find that there are internal inconsistencies within the reported practices. We also find trends of both over and under-reporting practices in the DSSs. Finally, we conduct a longitudinal study of DSS to explore how the reported practices evolve over time, and find that the developers are still adjusting their practices. To contextualize these findings, we conduct a developer study, uncovering the process that app developers undergo when working with DSS. We highlight the challenges faced and strategies employed by developers for DSS submission, and the factors contributing to changes in the DSS. Our research contributes valuable insights into the complexities of implementing and maintaining privacy labels, underlining the need for better resources, tools, and guidelines to aid developers. This understanding is crucial as the accuracy and reliability of privacy labels directly impact their effectiveness.",
    "author": "Authors:Rishabh Khandelwal, Asmit Nayak, Paul Chung, and Kassem Fawaz,University of Wisconsin-Madison",
    "year": "2024",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity24/presentation/khandelwal",
    "comment": ""
  }
]