[
  {
    "title": "MVP: Detecting Vulnerabilities using Patch-Enhanced Vulnerability Signatures",
    "abstract": "Abstract:Recurring vulnerabilities widely exist and remain undetected in real-world systems, which are often resulted from reused code base or shared code logic. However, the potentially small differences between vulnerable functions and their patched functions as well as the possibly large differences between vulnerable functions and target functions to be detected bring challenges to clone-based and function matching-based approaches to identify these recurring vulnerabilities, i.e., causing high false positives and false negatives.In this paper, we propose a novel approach to detect recurring vulnerabilities with low false positives and low false negatives. We first use our novel program slicing to extract vulnerability and patch signatures from vulnerable function and its patched function at syntactic and semantic levels. Then a target function is identified as potentially vulnerable if it matches the vulnerability signature but does not match the patch signature. We implement our approach in a tool named MVP. Our evaluation on ten open-source systems has shown that, i) MVP significantly outperformed state-of-the-art clone-based and function matching-based recurring vulnerability detection approaches; ii) MVP detected recurring vulnerabilities that cannot be detected by general-purpose vulnerability detection approaches, i.e., two learning-based approaches and two commercial tools; and iii) MVP has detected 97 new vulnerabilities with 23 CVE identifiers assigned.",
    "author": "Authors:Yang Xiao,Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China and School of Cyber Security, University of Chinese Academy of Sciences, Beijing, China;Bihuan Chen,School of Computer Science and Shanghai Key Laboratory of Data Science, Fudan University, China;Chendong Yu,Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China and School of Cyber Security, University of Chinese Academy of Sciences, Beijing, China;Zhengzi Xu,School of Computer Science and Engineering, Nanyang Technological University, Singapore;Zimu Yuan, Feng Li, and Binghong Liu,Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China and School of Cyber Security, University of Chinese Academy of Sciences, Beijing, China;Yang Liu,School of Computer Science and Engineering, Nanyang Technological University, Singapore;Wei Huo and Wei Zou,Institute of Information Engineering, Chinese Academy of Sciences, Beijing, China and School of Cyber Security, University of Chinese Academy of Sciences, Beijing, China;Wenchang Shi,Renmin University of China, Beijing, China",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/xiao",
    "comment": ""
  },
  {
    "title": "The Impact of Ad-Blockers on Product Search and Purchase Behavior: A Lab Experiment",
    "abstract": "Abstract:Ad-blocking applications have become increasingly popular among Internet users. Ad-blockers offer various privacy- and security-enhancing features: they can reduce personal data collection and exposure to malicious advertising, help safeguard users' decision-making autonomy, reduce users' costs (by increasing the speed of page loading), and improve the browsing experience (by reducing visual clutter).  On the other hand, the online advertising industry has claimed that ads increase consumers' economic welfare by helping  them find better, cheaper deals faster. If so, using ad-blockers would deprive consumers of these benefits. However, little is known about the actual economic impact of ad-blockers.We designed a lab experiment (N=212) with real economic incentives to understand the impact of ad-blockers on consumers' product searching and purchasing behavior, and the resulting consumer outcomes. We focus on the effects of blocking contextual ads (ads targeted to individual, potentially sensitive, contexts, such as search queries in a search engine or the content of web pages) on how participants searched for and purchased various products online, and the resulting consumer welfare.We find that blocking contextual ads did not have a statistically significant effect on the prices of products participants chose to purchase, the time they spent searching for them, or how satisfied they were with the chosen products, prices, and perceived quality. Hence we do not reject the null hypothesis that consumer behavior and outcomes stay constant when such ads are blocked or shown. We conclude that the use of ad-blockers does not seem to compromise consumer economic welfare (along the metrics captured in the experiment) in exchange for privacy and security benefits. We discuss the implications of this work in terms of end-users' privacy, the study's limitations, and future work to extend these results.",
    "author": "Authors:Alisa Frik,International Computer Science Institute / UC Berkeley;Amelia Haviland and Alessandro Acquisti,Heinz College, Carnegie Mellon University",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/frik",
    "comment": ""
  },
  {
    "title": "Sunrise to Sunset: Analyzing the End-to-end Life Cycle and Effectiveness of Phishing Attacks at Scale",
    "abstract": "Abstract:Despite an extensive anti-phishing ecosystem, phishing attacks continue to capitalize on gaps in detection to reach a significant volume of daily victims. In this paper, we isolate and identify these detection gaps by measuring the end-to-end life cycle of large-scale phishing attacks. We develop a unique framework—Golden Hour—that allows us to passively measure victim traffic to phishing pages while proactively protecting tens of thousands of accounts in the process. Over a one year period, our network monitor recorded 4.8 million victims who visited phishing pages, excluding crawler traffic. We use these events and related data sources to dissect phishing campaigns: from the time they first come online, to email distribution, to visitor traffic, to ecosystem detection, and finally to account compromise. We find the average campaign from start to the last victim takes just 21 hours. At least 7.42% of visitors supply their credentials and ultimately experience a compromise and subsequent fraudulent transaction. Furthermore, a small collection of highly successful campaigns are responsible for 89.13% of victims. Based on our findings, we outline potential opportunities to respond to these sophisticated attacks.",
    "author": "Authors:Adam Oest and Penghui Zhang,Arizona State University;Brad Wardman, Eric Nunes, and Jakub Burgis,PayPal;Ali Zand and Kurt Thomas,Google;Adam Doupé,Arizona State University;Gail-Joon Ahn,Arizona State University, Samsung ResearchDistinguished Paper Award Winner and Second Prize winner of the 2020 Internet Defense Prize",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/oest-sunrise",
    "comment": ""
  },
  {
    "title": "Cardpliance: PCI DSS Compliance of Android Applications",
    "abstract": "Abstract:Smartphones and their applications have become a predominant way of computing, and it is only natural that they have become an important part of financial transaction technology. However, applications asking users to enter credit card numbers have been largely overlooked by prior studies, which frequently report pervasive security and privacy concerns in the general mobile application ecosystem. Such applications are particularly security-sensitive, and they are subject to the Payment Card Industry Data Security Standard (PCI DSS). In this paper, we design a tool called Cardpliance, which bridges the semantics of the graphical user interface with static program analysis to capture relevant requirements from PCI DSS. We use Cardpliance to study 358 popular applications from Google Play that ask the user to enter a credit card number. Overall, we found that 1.67% of the 358 applications are not compliant with PCI DSS, with vulnerabilities including improperly storing credit card numbers and card verification codes. These findings paint a largely positive picture of the state of PCI DSS compliance of popular Android applications.",
    "author": "Authors:Samin Yaseer Mahmud and Akhil Acharya,North Carolina State University;Benjamin Andow,IBM T.J. Watson Research Center;William Enck and Bradley Reaves,North Carolina State University",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/mahmud",
    "comment": ""
  },
  {
    "title": "Composition Kills: A Case Study of Email Sender Authentication",
    "abstract": "Abstract:Component-based software designis a primary engineering approach for building modern software systems. This programming paradigm, however, creates security concerns due to the potential for inconsistent interpretations of messages between different components. In this paper, we leverage such inconsistencies to identify vulnerabilities in email systems. We identify a range of techniques to induce inconsistencies among different components across email servers and clients. We show that these inconsistencies can enable attackers to bypass email authentication to impersonate arbitrary senders, and forge DKIM-signed emails with a legitimate site's signature. Using a combination of manual analysis and black-box fuzzing, we discovered 18 types of evasion exploits and tested them against 10 popular email providers and 19 email clients—all of which proved vulnerable to various attacks. Absent knowledge of our attacks, for many of them even a conscientious security professional using a state-of-the-art email provider service like Gmail cannot with confidence readily determine, when receiving an email, whether it is forged.",
    "author": "Authors:Jianjun Chen,International Computer Science Institute;Vern Paxson,University of California Berkeley and International Computer Science Institute;Jian Jiang,Shape SecurityDistinguished Paper Award Winner",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/chen-jianjun",
    "comment": ""
  },
  {
    "title": "High Accuracy and High Fidelity Extraction of Neural Networks",
    "abstract": "Abstract:In a model extraction attack, an adversary steals a copy of a remotely deployed machine learning model, given oracle prediction access. We taxonomize model extraction attacks around two objectives:accuracy, i.e., performing well on the underlying learning task, andfidelity, i.e., matching the predictions of the remote victim classifier on any input.To extract a high-accuracy model, we develop a learning-based attack exploiting the victim to supervise the training of an extracted model. Through analytical and empirical arguments, we then explain the inherent limitations that prevent any learning-based strategy from extracting a truly high-fidelity model—i.e., extracting a functionally-equivalent model whose predictions are identical to those of the victim model on all possible inputs. Addressing these limitations, we expand on prior work to develop the first practical functionally-equivalent extraction attack for direct extraction (i.e., without training) of a model's weights.We perform experiments both on academic datasets and a state-of-the-art image classifier trained with 1 billion proprietary images. In addition to broadening the scope of model extraction research, our work demonstrates the practicality of model extraction attacks against production-grade systems.",
    "author": "Authors:Matthew Jagielski,Northeastern University, Google Brain;Nicholas Carlini, David Berthelot, Alex Kurakin, and Nicolas Papernot,Google Brain",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/jagielski",
    "comment": ""
  },
  {
    "title": "'I have too much respect for my elders': Understanding South African Mobile Users' Perceptions of Privacy and Current Behaviors on Facebook and WhatsApp",
    "abstract": "Abstract:Facebook usage is growing in developing countries, but we know little about how to tailor social media privacy settings to users in resourced-constrained settings. To that end, we present findings from interviews of 52 current mobile social media users in South Africa. We found users' primary privacy-related concern was who else could see their posts and messages, not what data the platforms or advertisers collect about them. Second, users displayed general knowledge gaps on existing social media privacy settings and relied heavily on blocking and passwords for privacy protection. Third, users' privacy and security-related behaviors were heavily influenced by living in high-crime areas. Based on these findings, we make recommendations for future work to better serve user privacy and security needs in resourced-constrained settings.",
    "author": "Authors:Jake Reichel, Fleming Peck, Mikako Inaba, Bisrat Moges, and Brahmnoor Singh Chawla,Princeton University;Marshini Chetty,University of Chicago",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/reichel",
    "comment": ""
  },
  {
    "title": "SpecFuzz: Bringing Spectre-type vulnerabilities to the surface",
    "abstract": "Abstract:SpecFuzz is the first tool that enables dynamic testing for speculative execution vulnerabilities (e.g., Spectre). The key is a novel concept ofspeculation exposure: The program is instrumented to simulate speculative execution in software by forcefully executing the code paths that could be triggered due to mispredictions, thereby making the speculative memory accesses visible to integrity checkers (e.g., AddressSanitizer). Combined with the conventional fuzzing techniques, speculation exposure enables more precise identification of potential vulnerabilities compared to state-of-the-art static analyzers.Our prototype for detecting Spectre V1 vulnerabilities successfully identifies all known variations of Spectre V1 and decreases the mitigation overheads across the evaluated applications, reducing the amount of instrumented branches by up to 77% given a sufficient test coverage.",
    "author": "Authors:Oleksii Oleksenko and Bohdan Trach,TU Dresden;Mark Silberstein,Technion;Christof Fetzer,TU Dresden",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/oleksenko",
    "comment": ""
  },
  {
    "title": "APEX: A Verified Architecture for Proofs of Execution on Remote Devices under Full Software Compromise",
    "abstract": "Abstract:Modern society is increasingly surrounded by, and is growing accustomed to, a wide range of Cyber-Physical Systems (CPS), Internet-of-Things (IoT), and smart devices. They often perform safety-critical functions, e.g., personal medical devices, automotive CPS as well as industrial and residential automation, e.g., sensor-alarm combinations. On the lower end of the scale, these devices are small, cheap and specialized sensors and/or actuators. They tend to host small anemic CPUs, have small amounts of memory and run simple software. If such devices are left unprotected, consequences of forged sensor readings or ignored actuation commands can be catastrophic, particularly, in safety-critical settings. This prompts the following three questions: (1) How to trust data produced, or verify that commands were performed, by a simple remote embedded device?, (2) How to bind these actions/results to the execution of expected software? and, (3) Can (1) and (2) be attained even if all software on a device can be modified and/or compromised?In this paper we answer these questions by designing, demonstrating security of, and formally verifying, APEX: an Architecture for Provable Execution. To the best of our knowledge, this is the first of its kind result for low-end embedded systems. Our work has a range of applications, especially, authenticated sensing and trustworthy actuation, which are increasingly relevant in the context of safety-critical systems. APEX is publicly available and our evaluation shows that it incurs low overhead, affordable even for very low-end embedded devices, e.g., those based on TI MSP430 or AVR ATmega processors.",
    "author": "Authors:Ivan De Oliveira Nunes,UC Irvine;Karim Eldefrawy,SRI International;Norrathep Rattanavipanon,UC Irvine and Prince of Songkla University;Gene Tsudik,UC Irvine",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/nunes",
    "comment": ""
  },
  {
    "title": "The Unpatchable Silicon: A Full Break of the Bitstream Encryption of Xilinx 7-Series FPGAs",
    "abstract": "Abstract:The security of FPGAs is a crucial topic, as any vulnerability within the hardware can have severe consequences, if they are used in a secure design. Since FPGA designs are encoded in a bitstream, securing the bitstream is of the utmost importance. Adversaries have many motivations to recover and manipulate the bitstream, including design cloning, IP theft, manipulation of the design, or design subversions e.g., through hardware Trojans. Given that FPGAs are often part of cyber-physical systems e.g., in aviation, medical, or industrial devices, this can even lead to physical harm. Consequently, vendors have introduced bitstream encryption, offering authenticity and confidentiality. Even though attacks against bitstream encryption have been proposed in the past, e.g., side-channel analysis and probing, these attacks require sophisticated equipment and considerable technical expertise.In this paper, we introduce novel low-cost attacks against the Xilinx 7-Series (and Virtex-6) bitstream encryption, resulting in the total loss of authenticity and confidentiality. We exploit a design flaw which piecewise leaks the decrypted bitstream. In the attack, the FPGA is used as a decryption oracle, while only access to a configuration interface is needed. The attack does not require any sophisticated tools and, depending on the target system, can potentially be launched remotely. In addition to the attacks, we discuss several countermeasures.",
    "author": "Authors:Maik Ender and Amir Moradi,Horst Goertz Institute for IT Security, Ruhr University Bochum, Germany;Christof Paar,Max Planck Institute for Cyber Security and Privacy and Horst Goertz Institute for IT Security, Ruhr University Bochum, GermanyDistinguished Paper Award Winner",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/ender",
    "comment": ""
  },
  {
    "title": "From Needs to Actions to Secure Apps? The Effect of Requirements and Developer Practices on App Security",
    "abstract": "Abstract:Increasingly mobile device users are being hurt by security or privacy issues with the apps they use. App developers can help prevent this; inexpensive security assurance techniques to do so are now well established, but do developers use them? And if they do so, is that reflected in more secure apps? From a survey of 335 successful app developers, we conclude that less than a quarter of such professionals have access to security experts; that less than a third use assurance techniques regularly; and that few have made more than cosmetic changes as a result of the European GDPR legislation. Reassuringly, we found that app developers tend to use more assurance techniques and make more frequent security updates when (1) they see more need for security, and (2) there is security expert or champion involvement.In a second phase we downloaded the apps corresponding to each completed survey and analyzed them for SSL issues, cryptographic API misuse and privacy leaks, finding only one fifth defect-free as far as our tools could detect. We found that having security experts or champions involved led to more cryptographic API issues, probably because of greater cryptography usage; but that measured defect counts did not relate to the need for security, nor to the use of assurance techniques.This offers two major opportunities for research: to further improve the detection of security issues in app binaries; and to support increasing the use of assurance techniques in the app developer community.",
    "author": "Authors:Charles Weir,Lancaster University;Ben Hermann,Paderborn University;Sascha Fahl,Leibniz University Hannover",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/weir",
    "comment": ""
  },
  {
    "title": "Datalog Disassembly",
    "abstract": "Abstract:Disassembly is fundamental to binary analysis and rewriting.  We present a novel disassembly technique that takes a stripped binary and produces reassembleable assembly code. The resulting assembly code has accurate symbolic information,  providing cross-references for analysis and to enable adjustment of code and data pointers to accommodate rewriting. Our technique features multiple static analyses and heuristics in a combined Datalog implementation. We argue that Datalog’s inference process is particularly well suited for disassembly and the required analyses. Our implementation and experiments support this claim. We have implemented our approach into an open-source tool calledDdisasm. In extensive experiments in which we rewrite thousands of x64 binaries we findDdisasmis both faster and more accurate than the current state-of-the-art binary reassembling tool,Ramblr.",
    "author": "Authors:Antonio Flores-Montoya and Eric Schulte,GrammaTech Inc.Distinguished Paper Award Winner",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/flores-montoya",
    "comment": ""
  },
  {
    "title": "NetWarden: Mitigating Network Covert Channels while Preserving Performance",
    "abstract": "Abstract:Network covert channels are an advanced threat to the security of distributed systems. Existing defenses all come at the cost of performance, so they present significant barriers to a practical deployment in high-speed networks. We propose NetWarden, a novel defense whose key design goal is topreserve TCP performancewhile mitigating covert channels. The use of programmable data planes makes it possible for NetWarden to adapt defenses that were only demonstrated before as proof of concept, and apply them at linespeed. Moreover, NetWarden uses a set of performance boosting techniques to temporarily increase the performance of connections that have been affected by covert channel mitigation, with the ultimate goal of neutralizing the overall performance impact. NetWarden also uses a fastpath/slowpath architecture to combine the generality of software and the efficiency of hardware for effective defense. Our evaluation shows that NetWarden works smoothly with complex applications and workloads, and that it can mitigate covert timing and storage channels with little performance disturbance.",
    "author": "Authors:Jiarong Xing, Qiao Kang, and Ang Chen,Rice University",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/xing",
    "comment": ""
  },
  {
    "title": "RELOAD+REFRESH: Abusing Cache Replacement Policies to Perform Stealthy Cache Attacks",
    "abstract": "Abstract:Caches have become the prime method for unintended information extraction across logical isolation boundaries. They are widely available on all major CPU platforms and, as a side channel, caches provide great resolution, making them the most convenient channel for Spectre and Meltdown. As a consequence, several methods to stop cache attacks by detecting them have been proposed.  Detection is strongly aided by the fact that observing cache activity of co-resident processes is not possible without altering the cache state and thereby forcing evictions on the observed processes. In this work we show that this widely held assumption is incorrect. Through clever usage of the cache replacement policy, it is possible to track cache accesses of a victim's processwithout forcing evictionson the victim's data. Hence, online detection mechanisms that rely on these evictions can be circumvented as they would not detect the introduced RELOAD+REFRESH attack. The attack requires a profound understanding of the cache replacement policy. We present a methodology to recover the replacement policy and apply it to the last five generations of Intel processors. We further show empirically that the performance of RELOAD+REFRESH on cryptographic implementations is comparable to that of other widely used cache attacks, while detection methods that rely on L3 cache events are successfully thwarted.",
    "author": "Authors:Samira Briongos, Pedro Malagón, and José M. Moya,Integrated Systems Laboratory, Universidad Politécnica de Madrid;Thomas Eisenbarth,University of Lübeck and Worcester Polytechnic Institute",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/briongos",
    "comment": ""
  },
  {
    "title": "ParmeSan: Sanitizer-guided Greybox Fuzzing",
    "abstract": "Abstract:One of the key questions when fuzzing is where to look for vulnerabilities. Coverage-guided fuzzers indiscriminately optimize for covering as much code as possible given that bug coverage often correlates with code coverage. Since code coverageoverapproximatesbug coverage, this approach is less than ideal and may lead to non-trivial time-to-exposure (TTE) of bugs. Directed fuzzers try to address this problem by directing the fuzzer to a basic block with a potential vulnerability. This approach can greatly reduce the TTE for a specific bug, but such special-purpose fuzzers can then greatlyunderapproximateoverall bug coverage.In this paper, we presentsanitizer-guidedfuzzing, a new design point in this space that specifically optimizes for bug coverage. For this purpose, we make the key observation that while the instrumentation performed by existing software sanitizers are regularly used for detecting fuzzer-induced error conditions, they can further serve as a generic and effective mechanism to identify interesting basic blocks for guiding fuzzers. We present the design and implementation of ParmeSan, a new sanitizer-guided fuzzer that builds on this observation. We show that ParmeSan greatly reduces the TTE of real-world bugs, and finds bugs 37% faster than existing state-of-the-art coverage-based fuzzers (Angora) and 288% faster than directed fuzzers (AFLGo), while still covering the same set of bugs.",
    "author": "Authors:Sebastian Österlund, Kaveh Razavi, Herbert Bos, and Cristiano Giuffrida,Vrije Universiteit Amsterdam",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/osterlund",
    "comment": ""
  },
  {
    "title": "ETHBMC: A Bounded Model Checker for Smart Contracts",
    "abstract": "Abstract:The introduction ofsmart contractshas significantly advanced the state-of-the-art in cryptocurrencies. Smart contracts are programs who live on the blockchain, governing the flow of money. However, the promise of monetary gain has attracted miscreants, resulting in spectacular hacks which resulted in the loss of millions worth of currency. In response, several powerful static analysis tools were developed to address these problems. We surveyed eight recently proposed static analyzers for Ethereum smart contracts and found that none of them captures all relevant features of the Ethereum ecosystem. For example, we discovered that a precise memory model is missing and inter-contract analysis is only partially supported.Based on these insights, we present the design and implementation of, a bounded model checker based on symbolic execution which provides a precise model of the Ethereum network. We demonstrate its capabilities in a series of experiments. First, we compare against the eight aforementioned tools, showing that even relatively simple toy examples can obstruct other analyzers. Further proving that precise modeling is indispensable, we leverage ETHBmc capabilities for automatic vulnerability scanning. We perform a large-scale analysis of roughly 2.2 million accounts currently active on the blockchain and automatically generate 5,905 valid inputs which trigger a vulnerability.  From these, 1,989 can destroy a contract at will (so calledsuicidal contracts) and the rest can be used by an adversary to arbitrarily extract money.  Finally, we compare our large-scale analysis against two previous analysis runs, finding significantly more inputs (22.8%) than previous approaches.",
    "author": "Authors:Joel Frank, Cornelius Aschermann, and Thorsten Holz,Ruhr-University Bochum",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/frank",
    "comment": ""
  },
  {
    "title": "FuzzGen: Automatic Fuzzer Generation",
    "abstract": "Abstract:Fuzzing is a testing technique to discover unknown vulnerabilities in software. When applying fuzzing to libraries, the core idea of supplying random input remains unchanged, yet it is non-trivial to achieve good code coverage. Libraries cannot run as standalone programs, but instead are invoked through another application. Triggering code deep in a library remains challenging as specific sequences of API calls are required to build up the necessary state. Libraries are diverse and have unique interfaces that require unique fuzzers, so far written by a human analyst.To address this issue, we present FuzzGen, a tool for automatically synthesizing fuzzers for complex libraries in a given environment. FuzzGen leverages awhole system analysisto infer the library’s interface and synthesizes fuzzers specifically for that library. FuzzGen requires no human interaction and can be applied to a wide range of libraries. Furthermore, the generated fuzzers leverage LibFuzzer to achieve better code coverage and expose bugs that reside deep in the library.FuzzGen was evaluated on Debian and the Android Open Source Project (AOSP) selecting 7 libraries to generate fuzzers. So far, we have found 17 previously unpatched vulnerabilities with 6 assigned CVEs. The generated fuzzers achieve an average of 54.94% code coverage; an improvement of 6.94% when compared to manually written fuzzers, demonstrating the effectiveness and generality of FuzzGen.",
    "author": "Authors:Kyriakos Ispoglou, Daniel Austin, and Vishwath Mohan,Google Inc.;Mathias Payer,EPFL",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/ispoglou",
    "comment": ""
  },
  {
    "title": "SANNS: Scaling Up Secure Approximate k-Nearest Neighbors Search",
    "abstract": "Abstract:Thek-Nearest Neighbor Search (k-NNS) is the backbone of several cloud-based services such as recommender systems, face recognition, and database search on text and images. In these services, the client sends the query to the cloud server and receives the response in which case the query and response are revealed to the service provider. Such data disclosures are unacceptable in several scenarios due to the sensitivity of data and/or privacy laws.In this paper, we introduce SANNS, a system for securek-NNS that keeps client's query and the search result confidential. SANNS comprises two protocols: an optimized linear scan and a protocol based on a novelsublinear timeclustering-based algorithm. We prove the security of both protocols in the standard semi-honest model. The protocols are built upon several state-of-the-art cryptographic primitives such as lattice-based additively homomorphic encryption, distributed oblivious RAM, and garbled circuits. We provide several contributions to each of these primitives which are applicable to other secure computing tasks. Both of our protocols rely on a new circuit for the approximate top-kselection fromnnumbers that is built fromO(n + k2)comparators.We have implemented our proposed system and performed extensive experimental results on four datasets in two different computation environments, demonstrating more than 18 — 31 ×faster response timecompared to optimally implemented protocols from the prior work. Moreover, SANNS is the first work that scales to the database of 10 million entries, pushing the limit by more thantwo orders of magnitude.",
    "author": "Authors:Hao Chen,Microsoft Research;Ilaria Chillotti,imec-COSIC KU Leuven & Zama;Yihe Dong,Microsoft;Oxana Poburinnaya,Simons Institute;Ilya Razenshteyn,Microsoft Research;M. Sadegh Riazi,UC San Diego",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/chen-hao",
    "comment": ""
  },
  {
    "title": "Fuzzing Error Handling Code using Context-Sensitive Software Fault Injection",
    "abstract": "Abstract:Error handling code is often critical but difficult to test in reality. As a result, many hard-to-find bugs exist in error handling code and may cause serious security problems once triggered. Fuzzing has become a widely used technique for finding software bugs nowadays. Fuzzing approaches mutate and/or generate various inputs to cover infrequently-executed code. However, existing fuzzing approaches are very limited in testing error handling code, because some of this code can be only triggered by occasional errors (such as insufficient memory and network-connection failures), but not specific inputs. Therefore, existing fuzzing approaches in general cannot effectively test such error handling code.In this paper, we propose a new fuzzing framework named FIFUZZ, to effectively test error handling code and detect bugs. The core of FIFUZZ is a context-sensitive software fault injection (SFI) approach, which can effectively cover error handling code in different calling contexts to find deep bugs hidden in error handling code with complicated contexts. We have implemented FIFUZZ and evaluated it on 9 widely-used C programs. It reports 317 alerts which are caused by 50 unique bugs in terms of the root causes. 32 of these bugs have been confirmed by related developers. We also compare FIFUZZ to existing fuzzing tools (including AFL, AFLFast, AFLSmart and FairFuzz), and find that FIFUZZ finds many bugs missed by these tools. We believe that FIFUZZ can effectively augment existing fuzzing approaches to find many real bugs that have been otherwise missed.",
    "author": "Authors:Zu-Ming Jiang and Jia-Ju Bai,Tsinghua University;Kangjie Lu,University of Minnesota;Shi-Min Hu,Tsinghua University",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/jiang",
    "comment": ""
  },
  {
    "title": "FIRMSCOPE: Automatic Uncovering of Privilege-Escalation Vulnerabilities in Pre-Installed Apps in Android Firmware",
    "abstract": "Abstract:Android devices ship with pre-installed privileged apps in their firmware — some of which are essential system components, others deliver a unique user experience — that users cannot disable. These pre-installed apps are assumed to be secure as they are handpicked or developed by the device vendors themselves rather than third parties. Unfortunately, we have identified an alarming number of Android firmware that contain privilege-escalation vulnerabilities in pre-installed apps, allowing attackers to perform unauthorized actions such as executing arbitrary commands, recording the device audio and screen, and accessing personal data to name a few. To uncover these vulnerabilities, we built FIRMSCOPE, a novel static analysis system that analyzes Android firmware to expose unwanted functionality in pre-installed apps using an efficient and practical context-sensitive, flow-sensitive, field-sensitive, and partially object-sensitive taint analysis. Our experimental results demonstrate that FIRMSCOPE significantly outperforms the state-of-the-art Android taint analysis solutions both in terms of detection power and runtime performance. We used FIRMSCOPE to scan 331,342 pre-installed apps in 2,017 Android firmware images from v4.0 to v9.0 from more than 100 Android vendors. Among them, FIRMSCOPE uncovered 850 unique privilege-escalation vulnerabilities, many of which are exploitable and 0-day.",
    "author": "Authors:Mohamed Elsabagh, Ryan Johnson, and Angelos Stavrou,Kryptowire;Chaoshun Zuo, Qingchuan Zhao, and Zhiqiang Lin,The Ohio State University",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/elsabagh",
    "comment": ""
  },
  {
    "title": "EcoFuzz: Adaptive Energy-Saving Greybox Fuzzing as a Variant of the Adversarial Multi-Armed Bandit",
    "abstract": "Abstract:Fuzzing is one of the most effective approaches for identifying security vulnerabilities. As a state-of-the-art coverage-based greybox fuzzer, AFL is a highly effective and widely used technique. However, AFL allocates excessive energy (i.e., the number of test cases generated by the seed) to seeds that exercise the high-frequency paths and can not adaptively adjust the energy allocation, thus wasting a significant amount of energy. Moreover, the current Markov model for modeling coverage-based greybox fuzzing is not profound enough. This paper presents a variant of the Adversarial Multi-Armed Bandit model for modeling AFL’s power schedule process. We first explain the challenges in AFL's scheduling algorithm by using the reward probability that generates a test case for discovering a new path. Moreover, we illustrated the three states of the seeds set and developed a unique adaptive scheduling algorithm as well as a probability-based search strategy. These approaches are implemented on top of AFL in an adaptive energy-saving greybox fuzzer called EcoFuzz. EcoFuzz is examined against other six AFL-type tools on 14 real-world subjects over 490 CPU days. According to the results, EcoFuzz could attain 214% of the path coverage of AFL with reducing 32% test cases generation of that of AFL. Besides, EcoFuzz identified 12 vulnerabilities in GNU Binutils and other software. We also extended EcoFuzz to test some IoT devices and found a new vulnerability in the SNMP component.",
    "author": "Authors:Tai Yue, Pengfei Wang, Yong Tang, Enze Wang, Bo Yu, Kai Lu, and Xu Zhou,National University of Defense Technology",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/yue",
    "comment": ""
  },
  {
    "title": "PKU Pitfalls: Attacks on PKU-based Memory Isolation Systems",
    "abstract": "Abstract:Intra-process memory isolation can improve security by enforcing least-privilege at a finer granularity than traditional operating system controls without the context-switch overhead associated withinter-process communication. A single process can be divided into separate components such that memory belonging to one component can only be accessed by the code of that component. Because the process has traditionally been a fundamental security boundary, assigning different levels of trust to components within a process is a fundamental change in secure systems design. However, so far there has been little research on the challenges of securely implementing intra-process isolationon top ofexisting operating system abstractions. We identify that despite providing strong intra-process memory isolation, existing, general purpose approaches neglect the ways in which the OS makes memory and other intra-process resources accessible through system objects. Using two recently-proposed memory isolation systems, we show that such designs are vulnerable to generic attacks that bypass memory isolation These attacks use the kernel as a confused deputy, taking advantage of existing intended kernel functionality that is agnostic of intra-process isolation. We argue that the root cause stems from a fundamentally different security model between kernel abstractions and user-level, intra-process memory isolation. Finally, we discuss potential mitigations and show that the performance cost of extending aptrace-based sandbox to prevent the new attacks is high, highlighting the need for more efficient system call interception.",
    "author": "Authors:R. Joseph Connor, Tyler McDaniel, Jared M. Smith, and Max Schuchard,University of Tennessee, Knoxville",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/connor",
    "comment": ""
  },
  {
    "title": "Automatic Techniques to Systematically Discover New Heap Exploitation Primitives",
    "abstract": "Abstract:Exploitation techniques to abuse metadata of heap allocators have been widely studied because of their generality (i.e., application independence) and powerfulness (i.e., bypassing modern mitigation). However, such techniques are commonly consideredarts, and thus the ways to discover them remain ad-hoc, manual, and allocator-specific.In this paper, we present an automatic tool, ArcHeap, to systematically discover the unexplored heap exploitation primitives, regardless of their underlying implementations.  The key idea of ArcHeap is to let the computer autonomously explore the spaces, similar in concept to fuzzing, by specifying a set of common designs of modern heap allocators and root causes of vulnerabilities as models, and by providing heap operations and attack capabilities as actions.  During the exploration, ArcHeap checks whether the combinations of these actions can be potentially used to construct exploitation primitives, such as arbitrary write or overlapped chunks.  As a proof, ArcHeap generates working PoC that demonstrates the discovered exploitation technique.We evaluated ArcHeap with ptmalloc2 and 10 other allocators, and discoveredfive previously unknownexploitation techniques in ptmalloc2 as well as several techniques against seven out of 10 allocators including the security-focused allocator, DieHarder.  To show the effectiveness of ArcHeap's approach in other domains, we also studied how security features and exploit primitives evolve across different versions of ptmalloc2.",
    "author": "Authors:Insu Yun,Georgia Institute of Technology;Dhaval Kapil,Facebook;Taesoo Kim,Georgia Institute of Technology",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/yun",
    "comment": ""
  },
  {
    "title": "Liveness is Not Enough: Enhancing Fingerprint Authentication with Behavioral Biometrics to Defeat Puppet Attacks",
    "abstract": "Abstract:Fingerprint authentication has gained increasing popularity on mobile devices in recent years. However, it is vulnerable to presentation attacks, which include that an attacker spoofs with an artificial replica. Many liveness detection solutions have been proposed to defeat such presentation attacks; however, they all fail to defend against a particular type of presentation attack, namelypuppet attack, in which an attacker places an unwilling victim’s finger on the fingerprint sensor. In this paper, we propose FINAUTH, an effective and efficient software-only solution, to complement fingerprint authentication by defeating both synthetic spoofs and puppet attacks usingfingertip-touchcharacteristics. FINAUTH characterizes intrinsic fingertip-touch behaviors including the acceleration and the rotation angle of mobile devices when a legitimate user authenticates. FINAUTH only utilizes common sensors equipped on mobile devices and does not introduce extra usability burdens on users. To evaluate the effectiveness of FINAUTH, we carried out experiments on datasets collected from 90 subjects after the IRB approval. The results show that FINAUTH can achieve the average balanced accuracy of 96.04% with 5 training data points and 99.28% with 100 training data points. Security experiments also demonstrate that FINAUTH is resilient against possible attacks. In addition, we report the usability analysis results of FINAUTH, including user authentication delay and overhead.",
    "author": "Authors:Cong Wu, Kun He, and Jing Chen,Wuhan University;Ziming Zhao,Rochester Institute of Technology;Ruiying Du,Wuhan University",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/wu",
    "comment": ""
  },
  {
    "title": "A Tale of Two Headers: A Formal Analysis of Inconsistent Click-Jacking Protection on the Web",
    "abstract": "Abstract:Click-jacking protection on the modern Web is commonly enforced via client-side security mechanisms for framing control, like the X-Frame-Options header (XFO) and Content Security Policy (CSP). Though these client-side security mechanisms are certainly useful and successful, delegating protection to web browsers opens room for inconsistencies in the security guarantees offered to users of different browsers. In particular, inconsistencies might arise due to the lack of support for CSP and the different implementations of the underspecified XFO header. In this paper, we formally study the problem of inconsistencies in framing control policies across different browsers and we implement an automated policy analyzer based on our theory, which we use to assess the state of click-jacking protection on the Web. Our analysis shows that 10% of the (distinct) framing control policies in the wild are inconsistent and most often do not provide any level of protection to at least one browser. We thus propose recommendations for web developers and browser vendors to mitigate this issue. Finally, we design and implement a server-side proxy to retrofit security in web applications.",
    "author": "Authors:Stefano Calzavara,Università Ca' Foscari Venezia;Sebastian Roth,CISPA Helmholtz Center for Information Security and Saarbrücken Graduate School of Computer Science;Alvise Rabitti,Università Ca' Foscari Venezia;Michael Backes and Ben Stock,CISPA Helmholtz Center for Information Security",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/calzavara",
    "comment": ""
  },
  {
    "title": "Automating the Development of Chosen Ciphertext Attacks",
    "abstract": "Abstract:In this work we investigate the problem of automating the development of adaptive chosen ciphertext attacks on systems that contain vulnerableformat oracles. Unlike previous attempts,which simply automate the execution of known attacks, we consider a more challenging problem: to programmatically derive a novel attack strategy, given only a machine-readable description of the plaintext verification function and the malleability characteristics of the encryption scheme.We present a new set of algorithms that use SAT and SMT solvers to reason deeply over the design of the system, producing an automated attack strategy that can entirely decrypt protected messages. Developing our algorithms required us to adapt techniques from a diverse range of research fields, as well as to explore and develop new ones. We implement our algorithms using existing theory solvers. The result is a practical tool calledDelphiniumthat succeeds against real-world and contrived format oracles. To our knowledge, this is the first work to automatically derive such complex chosen ciphertext attacks.",
    "author": "Authors:Gabrielle Beck, Maximilian Zinkus, and Matthew Green,Johns Hopkins University",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/beck",
    "comment": ""
  },
  {
    "title": "Analysis of DTLS Implementations Using Protocol State Fuzzing",
    "abstract": "Abstract:Recent years have witnessed an increasing number of protocols relying on UDP. Compared to TCP, UDP offers performance advantages such as simplicity and lower latency. This has motivated its adoption in Voice over IP, tunneling technologies, IoT, and novel Web protocols. To protect sensitive data exchange in these scenarios, the DTLS protocol has been developed as a cryptographic variation of TLS. DTLS’s main challenge is to support the stateless and unreliable transport of UDP. This has forced protocol designers to make choices that affect the complexity of DTLS, and to incorporate features that need not be addressed in the numerous TLS analyses.We present the first comprehensive analysis of DTLS implementations using protocol state fuzzing. To that end, we extend TLS-Attacker, an open source framework for analyzing TLS implementations, with support for DTLS tailored to the stateless and unreliable nature of the underlying UDP layer. We build a framework for applying protocol state fuzzing on DTLS servers, and use it to learn state machine models for thirteen DTLS implementations. Analysis of the learned state models reveals four serious security vulnerabilities, including a full client authentication bypass in the latest JSSE version, as well as several functional bugs and non-conformance issues. It also uncovers considerable differences between the models, confirming the complexity of DTLS state machines.",
    "author": "Authors:Paul Fiterau-Brostean and Bengt Jonsson,Uppsala University;Robert Merget,Ruhr-University Bochum;Joeri de Ruiter,SIDN Labs;Konstantinos Sagonas,Uppsala University;Juraj Somorovsky,Paderborn University",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/fiterau-brostean",
    "comment": ""
  },
  {
    "title": "Adversarial Preprocessing: Understanding and Preventing Image-Scaling Attacks in Machine Learning",
    "abstract": "Abstract:Machine learning has made remarkable progress in the last years, yet\n  its success has been overshadowed by different attacks that can\n  thwart its correct operation. While a large body of research has\n  studied attacks against learning algorithms, vulnerabilities in the\n  preprocessing for machine learning have received little attention so\n  far. An exception is the recent work of Xiao et al. that proposes\n  attacks against image scaling.  In contrast to prior work, these\n  attacks are agnostic to the learning algorithm and thus impact the\n  majority of learning-based approaches in computer vision. The \n  mechanisms underlying the attacks, however, are not understood yet, \n  and hence their root cause remains unknown.In this paper, we provide the first in-depth analysis of\n  image-scaling attacks.  We theoretically analyze the attacks from\n  the perspective of signal processing and identify their root cause\n  as the interplay of downsampling and convolution.  Based on this\n  finding, we investigate three popular imaging libraries for machine\n  learning (OpenCV, TensorFlow, and Pillow) and confirm the presence of\n  this interplay in different scaling algorithms. As a remedy, we\n  develop a novel defense against image-scaling attacks that prevents\n  all possible attack variants. We empirically demonstrate the efficacy\n  of this defense against non-adaptive and adaptive adversaries.",
    "author": "Authors:Erwin Quiring, David Klein, Daniel Arp, Martin Johns, and Konrad Rieck,TU Braunschweig",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/quiring",
    "comment": ""
  },
  {
    "title": "Retrofitting Fine Grain Isolation in the Firefox Renderer",
    "abstract": "Abstract:Firefox and other major browsers rely on dozens of third-party libraries to render audio, video, images, and other content. These libraries are a frequent source of vulnerabilities. To mitigate this threat, we are migrating Firefox to an architecture that isolates these libraries in lightweight sandboxes, dramatically reducing the impact of a compromise.Retrofitting isolation can be labor-intensive, very prone to security bugs, and requires critical attention to performance. To help, we developed RLBox, a framework that minimizes the burden of converting Firefox to securely and efficiently use untrusted code. To enable this, RLBox employs static information flow enforcement, and lightweight dynamic checks, expressed directly in the C++ type system.RLBox supports efficient sandboxing through either software-based-fault isolation or multi-core process isolation. Performance overheads are modest and transient, and have only minor impact on page latency. We demonstrate this by sandboxing performance-sensitive image decoding libraries (libjpeg and libpng), video decoding libraries (libtheora and libvpx), the libvorbis audio decoding library, and the zlib decompression library.RLBox, using a WebAssembly sandbox, has been integrated into production Firefox to sandbox the libGraphite font shaping library.",
    "author": "Authors:Shravan Narayan and Craig Disselkoen,UC San Diego;Tal Garfinkel,Stanford University;Nathan Froyd and Eric Rahm,Mozilla;Sorin Lerner,UC San Diego;Hovav Shacham,UT Austin;Deian Stefan,UC San DiegoDistinguished Paper Award Winner",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/narayan",
    "comment": ""
  },
  {
    "title": "TextShield: Robust Text Classification Based on Multimodal Embedding and Neural Machine Translation",
    "abstract": "Abstract:Text-based toxic content detection is an important tool for reducing harmful interactions in online social media environments. Yet, its underlying mechanism, deep learning-based text classification (DLTC), is inherently vulnerable to maliciously crafted adversarial texts. To mitigate such vulnerabilities, intensive research has been conducted on strengthening English-based DLTC models. However, the existing defenses are not effective for Chinese-based DLTC models, due to the unique sparseness, diversity, and variation of the Chinese language.In this paper, we bridge this striking gap by presenting TextShield, a new adversarial defense framework specifically designed for Chinese-based DLTC models. TextShield differs from previous work in several key aspects: (i)generic– it applies toanyChinese-based DLTC models without requiring re-training; (ii)robust– it significantly reduces the attack success rate even under the setting of adaptive attacks; and (iii)accurate– it has little impact on the performance of DLTC models over legitimate inputs. Extensive evaluations show that it outperforms both existing methods and the industry-leading platforms. Future work will explore its applicability in broader practical tasks.",
    "author": "Authors:Jinfeng Li,Zhejiang University, Alibaba Group;Tianyu Du,Zhejiang University;Shouling Ji,Zhejiang University, Alibaba-Zhejiang University Joint Research Institute of Frontier Technologies;Rong Zhang and Quan Lu,Alibaba Group;Min Yang,Fudan University;Ting Wang,Pennsylvania State University",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/li-jinfeng",
    "comment": ""
  },
  {
    "title": "A Longitudinal and Comprehensive Study of the DANE Ecosystem in Email",
    "abstract": "Abstract:The DNS-based Authentication of Named Entities (DANE) standard allows clients and servers to establish a TLS connection without relying on trusted third parties like CAs by publishing TLSA records. DANE uses the Domain Name System Security Extensions (DNSSEC) PKI to achieve integrity and authenticity. However, DANE can only work correctly if each principal in its PKI properly performs its duty: through their DNSSEC-aware DNS servers, DANE servers (e.g., SMTP servers) must publish their TLSA records, which are consistent with their certificates. Similarly, DANE clients (e.g., SMTP clients) must verify the DANE servers’ TLSA records, which are also used to validate the fetched certificates.DANE is rapidly gaining popularity in the email ecosystem, to help improve transport security between mail servers. Yet its security benefits hinge on deploying DANE correctly. In this paper we perform a large-scale, longitudinal, and comprehensive measurement study on how well the DANE standard and its relevant protocols are deployed and managed. We collect data for all second-level domains under the .com, .net, .org, .nl, and .se TLDs over a period of 24 months to analyze server-side deployment and management. To analyse the client-side deployment and management, we investigate 29 popular email service providers, and four popular MTA and ten DNS software programs.Our study reveals pervasive mismanagement in the DANE ecosystem. For instance, we found that 36% of TLSA records cannot be validated due to missing or incorrect DNSSEC records, and 14.17% of them are inconsistent with their certificates. We also found that only four email service providers support DANE for both outgoing and incoming emails, but two of them have drawbacks of not checking the Certificate Usage in TLSA records. On the bright side, the administrators of email servers can leverage open source MTA and DNS programs to support DANE correctly.",
    "author": "Authors:Hyeonmin Lee,Seoul National University;Aniketh Gireesh,Amrita Vishwa Vidyapeetham;Roland van Rijswijk-Deij,University of Twente & NLnet Labs;Taekyoung \"Ted\" Kwon,Seoul National University;Taejoong Chung,Rochester Institute of Technology",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/lee-hyeonmin",
    "comment": ""
  },
  {
    "title": "Call Me Maybe: Eavesdropping Encrypted LTE Calls With ReVoLTE",
    "abstract": "Abstract:Voice over LTE (VoLTE) is a packet-based telephony service seamlessly integrated into the Long Term Evolution (LTE) standard and deployed by most telecommunication providers in practice. Due to this widespread use, successful attacks against VoLTE can affect a large number of users worldwide.  In this work, we introduce ReVoLTE, an attack that exploits an LTE implementation flaw to recover the contents of an encrypted VoLTE call, hence enabling an adversary to eavesdrop on phone calls. ReVoLTE makes use of a predictable keystream reuse on the radio layer that allows an adversary to decrypt a recorded call with minimal resources. Through a series of preliminary as well as real-world experiments, we successfully demonstrate the feasibility of ReVoLTE and analyze various factors that critically influence our attack in commercial networks. For mitigating the ReVoLTE attack, we propose and discuss short- and long-term countermeasures deployable by providers and equipment vendors.",
    "author": "Authors:David Rupprecht, Katharina Kohls, and Thorsten Holz,Ruhr University Bochum;Christina Pöpper,NYU Abu Dhabi",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/rupprecht",
    "comment": ""
  },
  {
    "title": "MIRAGE: Succinct Arguments for Randomized Algorithms with Applications to Universal zk-SNARKs",
    "abstract": "Abstract:The last few years have witnessed increasing interest in the deployment of zero-knowledge proof systems, in particular ones with succinct proofs and efficient verification (zk-SNARKs). One of the main challenges facing the wide deployment of zk-SNARKs  is the requirement of a trusted key generation phase per different computation to achieve practical proving performance. Existing zero-knowledge proof systems that do not require trusted setup or have a single trusted preprocessing phase suffer from increased proof size and/or additional verification overhead. On the other other hand, although universal circuit generators for zk-SNARKs (that can eliminate the need for per-computation preprocessing) have been introduced in the literature, the performance of the prover remains far from practical for real-world applications.In this paper, we first present a new zk-SNARK system that is well-suited for randomized algorithms—in particular it does not encode randomness generation within the arithmetic circuit allowing for more practical prover times. Then, we design a universal circuit that takes as input any arithmetic circuit of a bounded number of operations as well as a possible value assignment, and performs  randomized checks to verify consistency. Our universal circuit is linear in the number of operations instead of quasi-linear like other universal circuits. By applying our new zk-SNARK system to our universal circuit, we build MIRAGE, a universal zk-SNARK with very succinct proofs—the proof contains just one additional element compared to the per-circuit preprocessing state-of-the-art zk-SNARK by Groth (Eurocrypt 2016). Finally, we implement MIRAGE and experimentally evaluate its performance for different circuits and in the context of privacy-preserving smart contracts.",
    "author": "Authors:Ahmed Kosba,Alexandria University;Dimitrios Papadopoulos,Hong Kong University of Science and Technology;Charalampos Papamanthou,University of Maryland;Dawn Song,UC Berkeley",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/kosba",
    "comment": ""
  },
  {
    "title": "TeeRex: Discovery and Exploitation of Memory Corruption Vulnerabilities in SGX Enclaves",
    "abstract": "Abstract:Intel's Software Guard Extensions (SGX) introduced new instructions to switch\nthe processor toenclave modewhich protects it from introspection. While\nthe enclave mode strongly protects the memory and the state of the processor,\nit cannot withstand memory corruption errors inside the enclave code. In this\npaper, we show that the attack surface of SGX enclaves provides new challenges\nfor enclave developers as exploitable memory corruption vulnerabilities are\neasily introduced into enclave code. We develop TeeRex to automatically analyze\nenclave binary code for vulnerabilities introduced at the host-to-enclave\nboundary by means of symbolic execution. Our evaluation on public enclave\nbinaries reveal that many of them suffer from memory corruption errors allowing\nan attacker to corrupt function pointers or perform arbitrary memory writes. As\nwe will show, TeeRex features a specifically tailored framework for SGX\nenclaves that allows simple proof-of-concept exploit construction to assess the\ndiscovered vulnerabilities. Our findings reveal vulnerabilities in multiple\nenclaves, including enclaves developed by Intel, Baidu, and WolfSSL, as well as\nbiometric fingerprint software deployed on popular laptop brands.",
    "author": "Authors:Tobias Cloosters, Michael Rodler, and Lucas Davi,University of Duisburg-Essen",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/cloosters",
    "comment": ""
  },
  {
    "title": "A Spectral Analysis of Noise: A Comprehensive, Automated, Formal Analysis of Diffie-Hellman Protocols",
    "abstract": "Abstract:The Noise specification describes how to systematically construct a large family of Diffie-Hellman based key exchange protocols, including the secure transports used by WhatsApp, Lightning, and WireGuard. As the specification only makes informal security claims, earlier work has explored which formal security properties may be enjoyed by protocols in the Noise framework, yet many important questions remain open.In this work we provide the most comprehensive, systematic analysis of the Noise framework to date. We start from first principles and, using an automated analysis tool, compute the strongest threat model under which a protocol is secure, thus enabling formal comparison between protocols. Our results allow us to objectively and automatically associate each informal security level presented in the Noise specification with a formal security claim.We also provide a fine-grained separation of Noise protocols that were previously described as offering similar security properties, revealing a subclass for which alternative Noise protocols exist that offer strictly better security guarantees. Our analysis also uncovers missing assumptions in the Noise specification and some surprising consequences,e.g.,in some situations higher security levels yield strictly worse security.",
    "author": "Authors:Guillaume Girol,CEA, List, Université Paris-Saclay, France;Lucca Hirschi,Inria & LORIA, France;Ralf Sasse,Department of Computer Science, ETH Zurich;Dennis Jackson,University of Oxford, United Kingdom;Cas Cremers,CISPA Helmholtz Center for Information Security;David Basin,Department of Computer Science, ETH Zurich",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/girol",
    "comment": ""
  },
  {
    "title": "Measuring and Modeling the Label Dynamics of Online Anti-Malware Engines",
    "abstract": "Abstract:VirusTotal provides malware labels from a large set of anti-malware engines, and is heavily used by researchers for malware annotation and system evaluation. Since different engines often disagree with each other, researchers have used various methods to aggregate their labels. In this paper, we take a data-driven approach to categorize, reason, and validate common labeling methods used by researchers. We first survey 115 academic papers that use VirusTotal, and identify common methodologies. Then we collect the daily snapshots of VirusTotal labels for more than 14,000 files (including a subset of manually verified ground-truth) from 65 VirusTotal engines over a year. Our analysis validates the benefits of threshold-based label aggregation in stabilizing files’ labels, and also points out the impact of poorly-chosen thresholds. We show that hand-picked “trusted” engines do not always perform well, and certain groups of engines are strongly correlated and should not be treated independently. Finally, we empirically show certain engines fail to perform in-depth analysis on submitted files and can easily produce false positives. Based on our findings, we offer suggestions for future usage of VirusTotal for data annotation.",
    "author": "Authors:Shuofei Zhu,The Pennsylvania State University;Jianjun Shi,BIT, The Pennsylvania State University;Limin Yang,University of Illinois at Urbana-Champaign;Boqin Qin,BUPT, The Pennsylvania State University;Ziyi Zhang,USTC, The Pennsylvania State University;Linhai Song,Pennsylvania State University;Gang Wang,University of Illinois at Urbana-Champaign",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/zhu",
    "comment": ""
  },
  {
    "title": "Medusa: Microarchitectural Data Leakage via Automated Attack Synthesis",
    "abstract": "Abstract:In May 2019, a new class of transient execution attack based on Meltdown called microarchitectural data sampling (MDS), was disclosed. MDS enables adversaries to leak secrets across security domains by collecting data from shared CPU resources such as data cache, fill buffers, and store buffers. These resources may temporarily hold data that belongs to other processes and privileged contexts, which could falsely be forwarded to memory accesses of an adversary.We perform an in-depth analysis of these Meltdown-style attacks using our novel fuzzing-based approach. We introduce an analysis tool, named Transynther, which mutates the basic block of existing Meltdown variants to generate and evaluate new Meltdown subvariants. We apply Transynther to analyze modern CPUs and better understand the root cause of these attacks. As a result, we find new variants of MDS that only target specific memory operations, e.g., fast string copies.Based on our findings, we propose a new attack, named Medusa, which can leak data from implicit write-combining memory operations. Since Medusa only applies to specific operations, it can be used to pinpoint vulnerable targets. In a case study, we apply Medusa to recover the key during the RSA signing operation. We show that Medusa can leak various parts of an RSA key during the base64 decoding stage. Then we build leakage templates and recover full RSA keys by employing lattice-based cryptanalysis techniques.",
    "author": "Authors:Daniel Moghimi,Worcester Polytechnic Institute;Moritz Lipp,Graz University of Technology;Berk Sunar,Worcester Polytechnic Institute;Michael Schwarz,Graz University of Technology",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/moghimi-medusa",
    "comment": ""
  },
  {
    "title": "V0LTpwn: Attacking x86 Processor Integrity from Software",
    "abstract": "Abstract:Fault-injection attacks have been proven in the past to be a reliable way of bypassing hardware-based security measures, such as cryptographic hashes, privilege and access permission enforcement, and trusted execution environments. However, traditional fault-injection at-tacks require physical presence, and hence, were often considered out of scope in many real-world adversary settings.In this paper we show this assumption may no longer be justified on x86. We present V0LTpwn, a novel hardware-oriented but software-controlled attack that affects the integrity of computation in virtually any execution mode on modern x86 processors. To the best of our knowledge, this represents the first attack on the integrity of the x86 platform from software. The key idea behind our attack is toundervolta physical core to force non-recoverable hardware faults. Under a V0LTpwn attack, CPU instructions will continue to execute with erroneous results and without crashes, allowing for exploitation. In contrast to recently presented side-channel attacks that leverage vulnerable speculative execution, V0LTpwn is not limited to information disclosure, but allows adversaries to affect execution, and hence, effectively breaks the integrity goals of modern x86 platforms. In our detailed evaluation we successfully launch software-based attacks against Intel SGX enclaves from a privileged process to demonstrate that a V0LTpwn attack can successfully change the results of computations within enclave execution across multiple CPU revisions.",
    "author": "Authors:Zijo Kenjar and Tommaso Frassetto,Technische Universität Darmstadt;David Gens and Michael Franz,University of California, Irvine;Ahmad-Reza Sadeghi,Technische Universität Darmstadt",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/kenjar",
    "comment": ""
  },
  {
    "title": "SEAL: Attack Mitigation for Encrypted Databases via Adjustable Leakage",
    "abstract": "Abstract:Building expressive encrypted databases that can scale to large volumes of data while enjoying formal security guarantees has been one of the holy grails of security and cryptography research. Searchable Encryption (SE) is considered to be an attractive implementation choice for this goal: It naturally supports basic database queries such aspoint, join, group-byandrange, and is very practical at the expense of well-defined leakage such assearchandaccesspattern. Nevertheless, recent attacks have exploited these leakages to recover the plaintext database or the posed queries, casting doubt to the usefulness of SE in encrypted systems. Defenses against such leakage-abuse attacks typically require the use of Oblivious RAM or worst-case padding---such countermeasures are however quite impractical. In order to efficiently defend against leakage-abuse attacks on SE-based systems, we propose SEAL, a family of new SE schemes withadjustable leakage. In SEAL, the amount of privacy loss is expressed in leaked bits of search or access pattern and can be defined at setup. As our experiments  show, when protecting only a few bits of leakage (e.g., three to four bits of access pattern), enough for existing and even new more aggressive attacks to fail, SEAL's query execution time is within the realm of practical for real-world applications (a little over one order of magnitude slowdown compared to traditional SE-based encrypted databases). Thus, SEAL could comprise a promising approach to build efficient and robust encrypted databases.",
    "author": "Authors:Ioannis Demertzis,University of Maryland;Dimitrios Papadopoulos,Hong Kong University of Science and Technology;Charalampos Papamanthou,University of Maryland;Saurabh Shintre,NortonLifeLock Research Group",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/demertzis",
    "comment": ""
  },
  {
    "title": "Shim Shimmeny: Evaluating the Security and Privacy Contributions of Link Shimming in the Modern Web",
    "abstract": "Abstract:Link shimming (also known as URL wrapping) is a technique widely used by websites, where URLs on a site are rewritten to direct link navigations to an intermediary endpoint before redirecting to the original destination. This \"shimming\" of URL clicks can serve navigation security, privacy, and analytics purposes, and has been deployed by prominent websites (e.g., Facebook, Twitter, Microsoft, Google) for over a decade.  Yet, we lack a deep understanding of its purported security and privacy contributions, particularly in today's web ecosystem, where modern browsers provide potential alternative mechanisms for protecting link navigations without link shimming's costs.In this paper, we provide a large-scale empirical evaluation of link shimming's security and privacy contributions, using Facebook's real-world deployment as a case study. Our results indicate that even in the modern web, link shimming can provide meaningful security and privacy benefits to users broadly. These benefits are most notable for the sizable populations that we observed with a high prevalence of legacy browser clients, such as in mobile-centric developing countries.  We discuss the tradeoff of these gains against potential costs. Beyond link shimming, our findings also provide insights for advancing user online protection, such as on the web ecosystem's distribution of responsibility, legacy software scenarios, and user responses to website security warnings.",
    "author": "Authors:Frank Li,Georgia Institute of Technology / Facebook",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/li-frank",
    "comment": ""
  },
  {
    "title": "COUNTERFOIL: Verifying Provenance of Integrated Circuits using Intrinsic Package Fingerprints and Inexpensive Cameras",
    "abstract": "Abstract:Counterfeit integrated circuits are responsible for billions of dollars in losses to the semiconductor industry each year, and jeopardize the reliability of critical systems that unwittingly rely on them. Counterfeit parts, which are primarily recycled, test rejects, or legitimate but regraded, have to date been found in a number of systems, including critical defense systems. In this work, we present COUNTERFOIL – an anti-counterfeiting system based on enrolling and authenticating intrinsic features of the molded packages that enclose a majority of semiconductor chips sold on the market. Our system relies on computer-readable labels, inexpensive cameras, imaging processing using OpenCV, and digital signatures, to enroll and verify chip packages. We demonstrate our approach on a dataset from over 100 chips. We show that our technique is effective and reliable for verifying provenance under a variety of settings, and evaluate the robustness of the package features by using different imaging platforms, and by wearing the chips with silicon carbide polishing grit in a rock tumbler. We show that, even if an adversary steals the exact mold used to produce an enrolled chip package, he will have limited success in being able to counterfeit the chip.",
    "author": "Authors:Siva Nishok Dhanuskodi, Xiang Li, and Daniel Holcomb,University of Massachusetts Amherst",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/dhanuskodi",
    "comment": ""
  },
  {
    "title": "AURORA: Statistical Crash Analysis for Automated Root Cause Explanation",
    "abstract": "Abstract:Given the huge success of automated software testing techniques, a large amount of crashes is found in practice. Identifying the root cause of a crash is a time-intensive endeavor, causing a disproportion between finding a crash and fixing the underlying software fault. To address this problem, various approaches have been proposed that rely on techniques such as reverse execution and backward taint analysis. Still, these techniques are either limited to certain fault types or provide an analyst with assembly instructions, but no context information or explanation of the underlying fault.In this paper, we propose an automated analysis approach that does not only identify the root cause of a given crashing input for a binary executable, but also provides the analyst with context information on the erroneous behavior that characterizes crashing inputs. Starting with a single crashing input, we generate a diverse set of similar inputs that either also crash the program or induce benign behavior. We then trace the program's states while executing each found input and generate predicates, i.e., simple Boolean expressions that capture behavioral differences between crashing and non-crashing inputs. A statistical analysis of all predicates allows us to identify the predicate pinpointing the root cause, thereby not only revealing the location of the root cause, but also providing an analyst with an explanation of the misbehavior a crash exhibits at this location. We implement our approach in a tool called AURORA and evaluate it on 25 diverse software faults. Our evaluation shows that AURORA is able to uncover root causes even for complex bugs. For example, it succeeded in cases where many millions of instructions were executed between developer fix and crashing location. In contrast to existing approaches, AURORA is also able to handle bugs with no data dependency between root cause and crash, such as type confusion bugs.",
    "author": "Authors:Tim Blazytko, Moritz Schlögel, Cornelius Aschermann, Ali Abbasi, Joel Frank, Simon Wörner, and Thorsten Holz,Ruhr-Universität Bochum",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/blazytko",
    "comment": ""
  },
  {
    "title": "FANS: Fuzzing Android Native System Services via Automated Interface Analysis",
    "abstract": "Abstract:Android native system services provide essential supports and fundamental functionalities for user apps. Finding vulnerabilities in them is crucial for Android security. Fuzzing is one of the most popular vulnerability discovery solutions, yet faces several challenges when applied to Android native system services. First, such services are invoked via a special interprocess communication (IPC) mechanism, namely binder, via service-specific interfaces. Thus, the fuzzer has to recognize all interfaces and generate interface-specific test cases automatically. Second, effective test cases should satisfy the interface model of each interface. Third, the test cases should also satisfy the semantic requirements, including variable dependencies and interface dependencies.In this paper, we propose an automated generation-based fuzzing solution FANS to find vulnerabilities in Android native system services. It first collects all interfaces in target services and uncovers deep nested multi-level interfaces to test. Then, it automatically extracts interface models, including feasible transaction code, variable names and types in the transaction data, from the abstract syntax tree (AST) of target interfaces. Further, it infers variable dependencies in transactions via the variable name and type knowledge, and infers interface dependencies via the generation and use relationship. Finally, it employs the interface models and dependency knowledge to generate sequences of transactions, which have valid formats and semantics, to test interfaces of target services. We implemented a prototype of FANS from scratch and evaluated it on six smartphones equipped with a recent version of Android, i.e., android-9.0.0_r46 , and found 30 unique vulnerabilities deduplicated from thousands of crashes, of which 20 have been confirmed by Google. Surprisingly, we also discovered 138 unique Java exceptions during fuzzing.",
    "author": "Authors:Baozheng Liu and Chao Zhang,Institute of Network Science and Cyberspace, Tsinghua University; Beijing National Research Center for Information Science and Technology;Guang Gong,Alpha Lab, 360 Internet Security Center;Yishun Zeng,Institute of Network Science and Cyberspace, Tsinghua University; Beijing National Research Center for Information Science and Technology;Haifeng Ruan,Department of Computer Science and Technology, Tsinghua University;Jianwei Zhuge,Institute of Network Science and Cyberspace, Tsinghua University; Beijing National Research Center for Information Science and Technology",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/liu",
    "comment": ""
  },
  {
    "title": "Detecting Stuffing of a User’s Credentials at Her Own Accounts",
    "abstract": "Abstract:We propose a framework by which websites can coordinate to detect credential stuffing on individual user accounts.  Our detection algorithm teases apart normal login behavior (involving password reuse, entering correct passwords into the wrong sites, etc.) from credential stuffing, by leveraging modern anomaly detection and carefully tracking suspicious logins.  Websites coordinate using a novel private membership-test protocol, thereby ensuring that information about passwords is not leaked; this protocol is highly scalable, partly due to its use of cuckoo filters, and is more secure than similarly scalable alternatives in an important measure that we define.  We use probabilistic model checking to estimate our credential-stuffing detection accuracy across a range of operating points.  These methods might be of independent interest for their novel application of formal methods to estimate the usability impacts of our design.  We show that even a minimal-infrastructure deployment of our framework should already support the combined login load experienced by the airline, hotel, retail, and consumer banking industries in the U.S.",
    "author": "Authors:Ke Coby Wang and Michael K. Reiter,University of North Carolina at Chapel Hill",
    "year": "2020",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity20/presentation/wang",
    "comment": ""
  }
]