[
  {
    "title": "Improving Logging to Reduce Permission Over-Granting Mistakes",
    "abstract": "Abstract:Access control configurations are gatekeepers to block unwelcome access to sensitive data. Unfortunately, system administrators (sysadmins) sometimes over-grant permissions when resolving unintended access-deny issues reported by legitimate users, which may open up security vulnerabilities for attackers. One of the primary reasons is that modern software does not provide informative logging to guide sysadmins to understand the reported problems.This paper makes one of the first attempts (to the best of our knowledge) to help developers improve log messages in order to help sysadmins correctly understand and fix access-deny issues without over-granting permissions. First, we conducted an observation study to understand the current practices of access-deny logging in the server software. Our study shows that many access-control program locations do not have any log messages; and a large percentage of existing log messages lack useful information to guide sysadmins to correctly understand and fix the issues. On top of our observations, we built SECLOG, which uses static analysis to automatically help developers find missing access-deny log locations and identify relevant information at the log location.We evaluated SECLOG with ten widely deployed server applications. Overall, SECLOG identified 380 new log statements for access-deny cases, and also enhanced 550 existing access-deny log messages with diagnostic information. We have reported 114 log statements to the developers of these applications, and so far 70 have been accepted into their main branches. We also conducted a user study with sysadmins (n=32) on six real-world access-deny issues. SECLOG can reduce the number of insecure fixes from 27 to 1, and also improve the diagnosis time by 64.2% on average.",
    "author": "Authors:Bingyu Shen, Tianyi Shan, and Yuanyuan Zhou,University of California, San Diego",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/shen-bingyu-logging",
    "comment": ""
  },
  {
    "title": "V-Cloak: Intelligibility-, Naturalness- & Timbre-Preserving Real-Time Voice Anonymization",
    "abstract": "Abstract:Voice data generated on instant messaging or social media applications contains unique user voiceprints that may be abused by malicious adversaries for identity inference or identity theft. Existing voice anonymization techniques, e.g., signal processing and voice conversion/synthesis, suffer from degradation of perceptual quality. In this paper, we develop a voice anonymization system, named V-Cloak, which attains real-time voice anonymization while preserving the intelligibility, naturalness and timbre of the audio. Our designed anonymizer features a one-shot generative model that modulates the features of the original audio at different frequency levels. We train the anonymizer with a carefully-designed loss function. Apart from the anonymity loss, we further incorporate the intelligibility loss and the psychoacoustics-based naturalness loss. The anonymizer can realize untargeted and targeted anonymization to achieve the anonymity goals of unidentifiability and unlinkability.We have conducted extensive experiments on four datasets, i.e., LibriSpeech (English), AISHELL (Chinese), CommonVoice (French) and CommonVoice (Italian), five Automatic Speaker Verification (ASV) systems (including two DNN-based, two statistical and one commercial ASV), and eleven Automatic Speech Recognition (ASR) systems (for different languages). Experiment results confirm that V-Cloak outperforms five baselines in terms of anonymity performance. We also demonstrate that V-Cloak trained only on the VoxCeleb1 dataset against ECAPA-TDNN ASV and DeepSpeech2 ASR has transferable anonymity against other ASVs and cross-language intelligibility for other ASRs. Furthermore, we verify the robustness of V-Cloak against various de-noising techniques and adaptive attacks.\nHopefully, V-Cloak may provide a cloak for us in aprismworld.",
    "author": "Authors:Jiangyi Deng, Fei Teng, and Yanjiao Chen,Zhejiang University;Xiaofu Chen and Zhaohui Wang,Wuhan University;Wenyuan Xu,Zhejiang University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/deng-jiangyi-v-cloak",
    "comment": ""
  },
  {
    "title": "PatchVerif: Discovering Faulty Patches in Robotic Vehicles",
    "abstract": "Abstract:Modern software is continuously patched to fix bugs and security vulnerabilities. Patching is particularly important in robotic vehicles (RVs), in which safety and security bugs can cause severe physical damages. However, existing automated methods struggle to identify faulty patches in RVs, due to their inability to systematically determine patch-introduced behavioral modifications, which affect how the RV interacts with the physical environment.In this paper, we introduce PATCHVERIF, an automated patch analysis framework. PATCHVERIF’s goal is to evaluate whether a given patch introduces bugs in the patched RV control software. To this aim, PATCHVERIF uses a combination of static and dynamic analysis to measure how the analyzed patch affects the physical state of an RV. Specifically, PATCHVERIF uses a dedicated input mutation algorithm to generate RV inputs that maximize the behavioral differences (in the physical space) between the original code and the patched one. Using the collected information about patch-introduced behavioral modifications, PATCHVERIF employs support vector machines (SVMs) to infer whether a patch is faulty or correct.We evaluated PATCHVERIF on two popular RV control software (ArduPilot and PX4), and it successfully identified faulty patches with an average precision and recall of 97.9% and 92.1%, respectively. Moreover, PATCHVERIF discovered 115 previously unknown bugs, 103 of which have been acknowledged, and 51 of them have already been fixed.",
    "author": "Authors:Hyungsub Kim, Muslum Ozgur Ozmen, Z. Berkay Celik, Antonio Bianchi, and Dongyan Xu,Purdue University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/kim-hyungsub",
    "comment": ""
  },
  {
    "title": "DISTDET: A Cost-Effective Distributed Cyber Threat Detection System",
    "abstract": "Abstract:Building provenance graph that considers causal relationships among software behaviors can better provide contextual information of cyber attacks, especially for advanced attacks such as Advanced Persistent Threat (APT) attacks. Despite its promises in assisting attack investigation, existing approaches that use provenance graphs to perform attack detection suffer from two fundamental limitations. First, existing approaches adopt a centralized detection architecture that sends all system auditing logs to the server for processing, incurring intolerable costs of data transmission, data storage, and computation. Second, they adopt either rule-based techniques that cannot detect unknown threats, or anomaly-detection techniques that produce numerous false alarms, failing to achieve a balance of precision and recall in APT detection. To address these fundamental challenges, we propose DISTDET, a distributed detection system that detects APT attacks by (1) performing light weight detection based on the host model built in the client side, (2) filtering false alarms based on the semantics of the alarm proprieties, and (3) deriving global models to complement the local bias of the host models. Our experiments on a large-scale industrial environment (1,130 hosts, 14 days, ∼1.6 billion events) and the DARPA TC dataset show that DISTDET is as effective as sate-of-the-art techniques in detecting attacks, while dramatically reducing network bandwidth from 11.28Mb/s to 17.08Kb/S (676.5× reduction), memory usages from 364MB to 5.523MB (66× reduction), and storage from 1.47GB to 130.34MB (11.6× reduction). By the time of this writing, DISTDET has been deployed to 50+ industry customers with 22,000+ hosts for more than 6 months, and identified over 900 real-world attacks.",
    "author": "Authors:Feng Dong,School of Cyber Science and Engineering, Huazhong University of Science and Technology / Sangfor Technologies Inc.;Liu Wang and Xu Nie,Beijing University of Posts and Telecommunications;Fei Shao,Case Western Reserve University;Haoyu Wang,School of Cyber Science and Engineering, Huazhong University of Science and Technology;Ding Li,Key Laboratory of High-Confidence Software Technologies (MOE), School of Computer Science, Peking University;Xiapu Luo,The Hong Kong Polytechnic University;Xusheng Xiao,Arizona State University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/dong-feng",
    "comment": ""
  },
  {
    "title": "The Impostor Among US(B): Off-Path Injection Attacks on USB Communications",
    "abstract": "Abstract:USB is the most prevalent peripheral interface in modern computer systems and its inherent insecurities make it an appealing attack vector. A well-known limitation of USB is that traffic is not encrypted. This allows on-path adversaries to trivially perform man-in-the-middle attacks. Off-path attacks that  compromise the confidentiality of communications have also been shown to be possible. However, so far no off-path attacks that breach USB communications integrity have been demonstrated.In this work we show that the integrity of USB communications is not guaranteed even against off-path attackers. Specifically, we design and build malicious devices that, even when placed outside of the path between a victim device and the host, can inject data to that path. Using our developed injectors we can falsify the provenance of data input as interpreted by a host computer system. By injecting on behalf of trusted victim devices we can circumvent any software-based authorisation policy defences that computer systems employ against common USB attacks. We demonstrate two concrete attacks. The first injects keystrokes allowing an attacker to execute commands. The second demonstrates file-contents replacement including during system install from a USB disk. We test the attacks on 29 USB 2.0 and USB 3.x hubs and find 14 of them to be vulnerable.",
    "author": "Authors:Robert Dumitru,The University of Adelaide and Defence Science and Technology Group;Daniel Genkin,Georgia Tech;Andrew Wabnitz,Defence Science and Technology Group;Yuval Yarom,The University of Adelaide",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/dumitru",
    "comment": ""
  },
  {
    "title": "Fuzztruction: Using Fault Injection-based Fuzzing to Leverage Implicit Domain Knowledge",
    "abstract": "Abstract:Today's digital communication relies on complex protocols and specifications for exchanging structured messages and data. Communication naturally involves two endpoints: One generating data and one consuming it. Traditional fuzz testing approaches replace one endpoint, thegenerator, with a fuzzer and rapidly test many mutated inputs on the target program under test. While this fully automated approach works well for loosely structured formats, this does not hold for highly structured formats, especially those that go through complex transformations such as compression or encryption.In this work, we propose a novel perspective on generating inputs in highly complex formats without relying on heavyweight program analysis techniques, coarse-grained grammar approximation, or a human domain expert. Instead of mutating the inputs for a target program, we inject faults into the data generation program so that this data isalmostof the expected format. Such data bypasses the initial parsing stages in the consumer program and exercises deeper program states, where it triggers more interesting program behavior. To realize this concept, we propose a set of compile-time and run-time analyses to mutate thegeneratorin a targeted manner, so that it remains intact and produces semi-valid outputs that satisfy the constraints of the complex format. We have implemented this approach in a prototype called Fuzztruction and show that it outperforms the state-of-the-art fuzzers AFL++, SYMCC, and WEIZZ. Fuzztruction finds significantly more coverage than existing methods, especially on targets that use cryptographic primitives. During our evaluation, Fuzztruction uncovered 151 unique crashes (after automated deduplication). So far, we manually triaged and reported 27 bugs and 4 CVEs were assigned.",
    "author": "Authors:Nils Bars, Moritz Schloegel, Tobias Scharnowski, and Nico Schiller,Ruhr-Universität Bochum;Thorsten Holz,CISPA Helmholtz Center for Information SecurityDistinguished Paper Award Winner and Runner-Up Winner of the 2023 Internet Defense Prize",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/bars",
    "comment": ""
  },
  {
    "title": "NVLeak: Off-Chip Side-Channel Attacks via Non-Volatile Memory Systems",
    "abstract": "Abstract:We study microarchitectural side-channel attacks and defenses on non-volatile RAM (NVRAM) DIMMs. In this study, we first perform reverse-engineering of NVRAMs as implemented by the Intel Optane DIMM and reveal several of its previously undocumented microarchitectural details: on-DIMM cache structures (NVCache) and wear-leveling policies. Based on these findings, we first develop cross-core and cross-VM covert channels to establish the channel capacity of these shared hardware resources. Then, we devise NVCache-based side channels under the umbrella of NVLeak. We apply NVLeak to a series of attack case studies, including compromising the privacy of databases and key-value storage backed by NVRAM and spying on the execution path of code pages when NVRAM is used as a volatile runtime memory. Our results show that side-channel attacks exploiting NVRAM are practical and defeat previously-proposed defense that only focuses on on-chip hardware resources. To fill this gap in defense, we develop system-level mitigations based on cache partitioning to prevent side-channel leakage from NVCache.",
    "author": "Authors:Zixuan Wang,UC San Diego;Mohammadkazem Taram,Purdue University and UC San Diego;Daniel Moghimi,UT Austin and UC San Diego;Steven Swanson, Dean Tullsen, and Jishen Zhao,UC San Diego",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/wang-zixuan",
    "comment": ""
  },
  {
    "title": "A Research Framework and Initial Study of Browser Security for the Visually Impaired",
    "abstract": "Abstract:The growth of web-based malware and phishing attacks has catalyzed significant advances in the research and use of interstitial warning pages and modals by a browser prior to loading the content of a suspect site. These warnings commonly use visual cues to attract users' attention, including specialized iconography, color, and the placement and size of buttons to communicate the importance of the scenario. While the efficacy of visual techniques has improved safety for sighted users, these techniques are unsuitable for blind and visually impaired users. We attribute this not to a lack of interest or technical capability by browser manufactures, where universal design is a core tenet of their engineering practices, but instead a reflection of the very real dearth of research literature to inform their choices, exacerbated by a deficit of clear methodologies for conducting studies with this population. Indeed, the challenges are manifold. In this paper, we analyze and address the methodological challenges of conducting security and privacy research with a visually impaired population, and contribute a new set of methodological best practices when conducting a study of this kind. Using our methodology, we conduct a preliminary study analyzing the experiences of the visually impaired with browser security warnings, perform a thematic analysis identifying common challenges visually impaired users experience, and present some initial solutions that could improve security for this population.",
    "author": "Authors:Elaine Lau and Zachary Peterson,Cal Poly, San Luis Obispo",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/lau",
    "comment": ""
  },
  {
    "title": "PUMM: Preventing Use-After-Free Using Execution Unit Partitioning",
    "abstract": "Abstract:Critical software is written in memory unsafe languages that are vulnerable to use-after-free and double free bugs. This has led to proposals to secure memory allocators by strategically deferring memory reallocations long enough to make such bugs unexploitable. Unfortunately, existing solutions suffer from high runtime and memory overheads. Seeking a better solution, we propose to profile programs to identify units of code that correspond to the handling of individual tasks. With the intuition that little to no data should flow between separate tasks at runtime, reallocation of memory freed by the currently executing unit is deferred until after its completion; just long enough to prevent use-after-free exploitation.To demonstrate the efficacy of our design, we implement a prototype for Linux, PUMM, which consists of an offline profiler and an online enforcer that transparently wraps standard libraries to protect C/C++ binaries. In our evaluation of 40 real-world and 3,000 synthetic vulnerabilities across 26 programs, including complex multi-threaded cases like the Chakra JavaScript engine, PUMM successfully thwarts all real-world exploits, and only allows 4 synthetic exploits, while reducing memory overhead by 52.0% over prior work and incurring an average runtime overhead of 2.04%.",
    "author": "Authors:Carter Yagemann,The Ohio State University;Simon P. Chung, Brendan Saltaformaggio, and Wenke Lee,Georgia Institute of Technology",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/yagemann",
    "comment": ""
  },
  {
    "title": "POLICYCOMP: Counterpart Comparison of Privacy Policies Uncovers Overbroad Personal Data Collection Practices",
    "abstract": "Abstract:Since mobile apps' privacy policies are usually complex, various tools have been developed to examine whether privacy policies have contradictions and verify whether privacy policies are consistent with the apps' behaviors. However, to the best of our knowledge, no prior work answers whether the personal data collection practices (PDCPs) in an app's privacy policy are necessary for given purposes (i.e., whether to comply with the principle of data minimization).  Though defined by most existing privacy regulations/laws such as GDPR, the principle of data minimization has been translated into different privacy practices depending on the different contexts (e.g., various developers and targeted users). In the end, the developers can collect personal data claimed in the privacy policies as long as they receive authorizations from the users.Currently, it mainly relies on legal experts to manually audit the necessity of personal data collection according to the specific contexts, which is not very scalable for millions of apps. In this study, we aim to take the first step to automatically investigate whether PDCPs in an app's privacy policy are overbroad from the perspective of counterpart comparison. Our basic insight is that, if an app claims to collect much more personal data in its privacy policy than most of its counterparts, it is more likely to be conducting overbroad collection.  To achieve this, POLICYCOMP, an automatic framework for detecting overbroad PDCPs is proposed. We use POLICYCOMP to perform a large-scale analysis on 10,042 privacy policies and flag 48.29% of PDCPs to be overbroad. We shared our findings with 2,000 app developers and received 52 responses from them, 39 of which acknowledged our findings and took actions (e.g., removing overbroad PDCPs).",
    "author": "Authors:Lu Zhou,Xidian University and Shanghai Jiao Tong University;Chengyongxiao Wei, Tong Zhu, and Guoxing Chen,Shanghai Jiao Tong University;Xiaokuan Zhang,George Mason University;Suguo Du, Hui Cao, and Haojin Zhu,Shanghai Jiao Tong University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/zhou-lu",
    "comment": ""
  },
  {
    "title": "The Maginot Line: Attacking the Boundary of DNS Caching Protection",
    "abstract": "Abstract:In this paper, we reportMaginotDNS, a powerful cache poisoning attack against DNS servers that simultaneously act as forwarder and recursive resolver (termed asCDNS). The attack is made possible through exploiting vulnerabilities in the bailiwick checking algorithms, one of the cornerstones of DNS security since the 1990s, and affects multiple versions of popular DNS software, including BIND and Microsoft DNS. Through field tests, we find that the attack is potent, allowing attackers to take overentireDNS zones, even including Top-Level Domains (e.g.,.comand.net).\n\nThrough a large-scale measurement study, we also confirm the extensive usage of CDNSes in real-world networks (up to 41.8% of our probed open DNS servers) and find that at least 35.5% of all CDNSes are vulnerable toMaginotDNS. After interviews with ISPs, we show a wide range of CDNS use cases and real-world attacks. We have reported all the discovered vulnerabilities to DNS software vendors and received acknowledgments from all of them. 3 CVE-ids have been assigned, and 2 vendors have fixed their software. Our study brings attention to the implementation inconsistency of security checking logic in different DNS software and server modes (i.e., recursive resolvers and forwarders), and we call for standardization and agreements among software vendors.",
    "author": "Authors:Xiang Li, Chaoyi Lu, and Baojun Liu,Tsinghua University;Qifan Zhang and Zhou Li,University of California, Irvine;Haixin Duan,Tsinghua University, QI-ANXIN Technology Research Institute, and Zhongguancun Laboratory;Qi Li,Tsinghua University and Zhongguancun Laboratory",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/li-xiang",
    "comment": ""
  },
  {
    "title": "One Server for the Price of Two: Simple and Fast Single-Server Private Information Retrieval",
    "abstract": "Abstract:We present SimplePIR, the fastest single-server private information retrieval scheme known to date. SimplePIR’s security holds under the learning-with-errors assumption. To answer a client’s query, the SimplePIR server performs fewer than one 32-bit multiplication and one 32-bit addition per database byte. SimplePIR achieves 10 GB/s/core server throughput, which approaches the memory bandwidth of the machine and the performance of the fastest two-server private-information-retrieval schemes (which require non-colluding servers). SimplePIR has relatively large communication costs: to make queries to a 1 GB database, the client must download a 121 MB \"hint\" about the database contents; thereafter, the client may make an unbounded number of queries, each requiring 242 KB of communication. We present a second single-server scheme, DoublePIR, that shrinks the hint to 16 MB at the cost of slightly higher per-query communication (345 KB) and slightly lower throughput (7.4 GB/s/core). Finally, we apply our new private-information-retrieval schemes, together with a novel data structure for approximate set membership, to the task of private auditing in Certificate Transparency. We achieve a strictly stronger notion of privacy than Google Chrome’s current approach with 13x more communication: 16 MB of download per week, along with 1.5 KB per TLS connection.",
    "author": "Authors:Alexandra Henzinger, Matthew M. Hong, and Henry Corrigan-Gibbs,MIT;Sarah Meiklejohn,Google;Vinod Vaikuntanathan,MIT",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/henzinger",
    "comment": ""
  },
  {
    "title": "Exploring User Reactions and Mental Models Towards Perceptual Manipulation Attacks in Mixed Reality",
    "abstract": "Abstract:Perceptual Manipulation Attacks(PMA) involve manipulating users’ multi-sensory (e.g., visual, auditory, haptic) perceptions of the world through Mixed Reality (MR) content, in order to influence users' judgments and following actions. For example, a MR driving application that is expected to show safety-critical output might also (maliciously or unintentionally) overlay the wrong signal on a traffic sign, misleading the user into slamming on the brake. While current MR technology is sufficient to create such attacks, little research has been done to understand how users perceive, react to, and defend against such potential manipulations. To provide a foundation for understanding and addressing PMA in MR, we conducted an in-person study with 21 participants. We developed three PMA in which we focused on attacking three different perceptions: visual, auditory, and situational awareness. Our study first investigates how user reactions are affected by evaluating their performance on “microbenchmark'' tasks under benchmark and different attack conditions. We observe both primary and secondary impacts from attacks, later impacting participants' performance even under non-attack conditions. We follow up with interviews, surfacing a range of user reactions and interpretations of PMA. Through qualitative data analysis of our observations and interviews, we identify various defensive strategies participants developed, and we observe how these strategies sometimes backfire. We derive recommendations for future investigation and defensive directions based on our findings.",
    "author": "Authors:Kaiming Cheng, Jeffery F. Tian, Tadayoshi Kohno, and Franziska Roesner,University of Washington",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/cheng-kaiming",
    "comment": ""
  },
  {
    "title": "Eavesdropping Mobile App Activity via Radio-Frequency Energy Harvesting",
    "abstract": "Abstract:Radio-frequency (RF) energy harvesting is a promising technology for Internet-of-Things (IoT) devices to power sensors and prolong battery life. In this paper, we present a novel side-channel attack that leverages RF energy harvesting signals to eavesdrop mobile app activities. To demonstrate this novel attack, we propose AppListener, an automated attack framework that recognizes fine-grained mobile app activities from harvested RF energy. The RF energy is harvested from a custom-built RF energy harvester which generates voltage signals from ambient Wi-Fi transmissions, and app activities are recognized from a three-tier classification algorithm. We evaluate AppListener with four mobile devices running 40 common mobile apps (e.g., YouTube, Facebook, and WhatsApp) belonging to five categories (i.e., video, music, social media, communication, and game); each category contains five application-specific activities. Experiment results show that AppListener achieves over 99% accuracy in differentiating four different mobile devices, over 98% accuracy in classifying 40 different apps, and 86.7% accuracy in recognizing five sets of application-specific activities.  Moreover, a comprehensive study is conducted to show AppListener is robust to a number of impact factors, such as distance, environment, and non-target connected devices. Practices of integrating AppListener into commercial IoT devices also demonstrate that it is easy to deploy. Finally, countermeasures are presented as the first step to defend against this novel attack.",
    "author": "Authors:Tao Ni,Shenzhen Research Institute, City University of Hong Kong, and Department of Computer Science, City University of Hong Kong;Guohao Lan,Department of Software Technology, Delft University of Technology;Jia Wang,College of Computer Science and Software Engineering, Shenzhen University;Qingchuan Zhao,Department of Computer Science, City University of Hong Kong;Weitao Xu,Shenzhen Research Institute, City University of Hong Kong, and Department of Computer Science, City University of Hong Kong",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/ni",
    "comment": ""
  },
  {
    "title": "Side-Channel Attacks on Optane Persistent Memory",
    "abstract": "Abstract:There is a constant evolution of technology for cloud environments, including the development of new memory storage technology, such as persistent memory. The newly-released Intel Optane persistent memory provides high-performance, persistent, and byte-addressable access for storage-class applications in data centers. While Optane’s direct data management is fast and efficient, it is unclear whether it comes with undesirable security implications. This is problematic, as cloud tenants are physically co-located on the same hardware.In this paper, we present the first side-channel security analysis of Intel Optane persistent memory. We reverse-engineer the internal cache hierarchy, cache sizes, associativity, replacement policies, and wear-leveling mechanism of the Optane memory. Based on this reverse-engineering, we construct four new attack primitives on Optane’s internal components. We then present four case studies using these attack primitives. First, we present local covert channels based on Optane’s internal caching. Second, we demonstrate a keystroke side-channel attack on a remote user via Intel’s Optane-optimized key-value store, pmemkv. Third, we study a fully remote covert channel through pmemkv. Fourth, we present our Note Board attack, also through pmemkv, enabling two parties to store and exchange messages covertly across long time gaps and even power cycles of the server. Finally, we discuss mitigations against our attacks.",
    "author": "Authors:Sihang Liu,University of Virginia;Suraaj Kanniwadi,Cornell University;Martin Schwarzl, Andreas Kogler, and Daniel Gruss,Graz University of Technology;Samira Khan,University of Virginia",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/liu-sihang",
    "comment": ""
  },
  {
    "title": "A Study of Multi-Factor and Risk-Based Authentication Availability",
    "abstract": "Abstract:Password-based authentication (PBA) remains the most popular form of user authentication on the web despite its long-understood insecurity. Given the deficiencies of PBA, many online services support multi-factor authentication (MFA) and/or risk-based authentication (RBA) to better secure user accounts. The security, usability, and implementations of MFA and RBA have been studied extensively, but attempts to measure their availability among popular web services have lacked breadth. Additionally, no study has analyzed MFA and RBA prevalence together or how the presence of Single-Sign-On (SSO) providers affects the availability of MFA and RBA on the web.In this paper, we present a study of 208 popular sites in the Tranco top 5K that support account creation to understand the availability of MFA and RBA on the web, the additional authentication factors that can be used for MFA and RBA, and how logging into sites through more secure SSO providers changes the landscape of user authentication security. We find that only 42.31% of sites support any form of MFA, and only 22.12% of sites block an obvious account hijacking attempt. Though most sites do not offer MFA or RBA, SSO completely changes the picture. If one were to create an account for each site through an SSO provider that offers MFA and/or RBA, whenever available, 80.29% of sites would have access to MFA and 72.60% of sites would stop an obvious account hijacking attempt. However, this proliferation through SSO comes with a privacy trade-off, as nearly all SSO providers that support MFA and RBA are major third-party trackers.",
    "author": "Authors:Anthony Gavazzi, Ryan Williams, Engin Kirda, and Long Lu,Northeastern University;Andre King, Andy Davis, and Tim Leek,MIT Lincoln Laboratory",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/gavazzi",
    "comment": ""
  },
  {
    "title": "Person Re-identification in 3D Space: A WiFi Vision-based Approach",
    "abstract": "Abstract:Person re-identification (Re-ID) has become increasingly important as it supports a wide range of security applications. Traditional person Re-ID mainly relies on optical camera-based systems, which incur several limitations due to the changes in the appearance of people, occlusions, and human poses. In this work, we propose a WiFi vision-based system, 3D-ID, for person Re-ID in 3D space. Our system leverages the advances of WiFi and deep learning to help WiFi devices \"see'', identify, and recognize people. In particular, we leverage multiple antennas on next-generation WiFi devices and 2D AoA estimation of the signal reflections to enable WiFi to visualize a person in the physical environment. We then leverage deep learning to digitize the visualization of the person into 3D body representation and extract both the static body shape and dynamic walking patterns for person Re-ID. Our evaluation results under various indoor environments show that the 3D-ID system achieves an overall rank-1 accuracy of 85.3%. Results also show that our system is resistant to various attacks. The proposed 3D-ID is thus very promising as it could augment or complement camera-based systems.",
    "author": "Authors:Yili Ren and Yichao Wang,Florida State University;Sheng Tan,Trinity University;Yingying Chen,Rutgers University;Jie Yang,Florida State University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/ren",
    "comment": ""
  },
  {
    "title": "Fourteen Years in the Life: A Root Server’s Perspective on DNS Resolver Security",
    "abstract": "Abstract:We consider how the DNS security and privacy landscape has evolved over time, using data collected annually at A-root between 2008 and 2021. We consider issues such as deployment of security and privacy mechanisms, including source port randomization, TXID randomization, DNSSEC, and QNAME minimization. We find that achieving general adoption of new security practices is a slow, ongoing process. Of particular note, we find a significant number of resolvers lacking nearlyallof the security mechanisms we considered, even as late as 2021. Specifically, in 2021, over 4% of the resolvers analyzed were unprotected by either source port randomization, DNSSEC validation, DNS cookies, or 0x20 encoding. Encouragingly, we find that the volume of traffic from resolvers with secure practices is significantly higher than that of other resolvers.",
    "author": "Authors:Alden Hilton,Sandia National Laboratories;Casey Deccio,Brigham Young University;Jacob Davis,Sandia National Laboratories",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/hilton",
    "comment": ""
  },
  {
    "title": "ClepsydraCache -- Preventing Cache Attacks with Time-Based Evictions",
    "abstract": "Abstract:In the recent past, we have witnessed the shift towards attacks on the microarchitectural CPU level. In particular, cache side-channels play a predominant role as they allow an attacker to exfiltrate secret information by exploiting the CPU microarchitecture. These subtle attacks exploit the architectural visibility of conflicting cache addresses. In this paper, we present ClepsydraCache, which mitigates state-of-the-art cache attacks using a novel combination of cache decay and index randomization. Each cache entry is linked with a Time-To-Live (TTL) value. We propose a new dynamic scheduling mechanism of the TTL which plays a fundamental role in preventing those attacks while maintaining performance. ClepsydraCache efficiently protects against the latest cache attacks such as Prime+(Prune+)Probe. We present a full prototype in gem5 and lay out a proof-of-concept hardware design of the TTL mechanism, which demonstrates the feasibility of deploying ClepsydraCache in real-world systems.",
    "author": "Authors:Jan Philipp Thoma,Ruhr University Bochum;Christian Niesler,University of Duisburg-Essen;Dominic Funke, Gregor Leander, Pierre Mayr, and Nils Pohl,Ruhr University Bochum;Lucas Davi,University of Duisburg-Essen;Tim Güneysu,Ruhr University Bochum & DFKI",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/thoma",
    "comment": ""
  },
  {
    "title": "Guarding Serverless Applications with Kalium",
    "abstract": "Abstract:As an emerging application paradigm, serverless computing attracts attention from more and more adversaries. Unfortunately, security tools for conventional web applications cannot be easily ported to serverless computing due to its distributed nature, and existing serverless security solutions focus on enforcing user specified information flow policies which are unable to detect the manipulation of the order of functions in application control flow paths. In this paper, we presentKalium, an extensible security framework that leverages local function state and global application state to enforce control-flow integrity (CFI) in serverless applications. We evaluate the performance overhead and security of Kalium using realistic open-source applications; our results show that Kalium mitigates several classes of attacks with relatively low performance overhead and outperforms the state-of-the-art serverless information flow protection systems.",
    "author": "Authors:Deepak Sirone Jegan,University of Wisconsin-Madison;Liang Wang,Princeton University;Siddhant Bhagat,Microsoft;Michael Swift,University of Wisconsin-Madison",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/jegan",
    "comment": ""
  },
  {
    "title": "DynSQL: Stateful Fuzzing for Database Management Systems with Complex and Valid SQL Query Generation",
    "abstract": "Abstract:Database management systems (DBMSs) are essential parts of modern software. To ensure the security of DBMSs, recent approaches apply fuzzing to testing DBMSs by automatically generating SQL queries. However, existing DBMS fuzzers are limited in generating complex and valid queries, as they heavily rely on their predefined grammar models and fixed knowledge about DBMSs, but do not capture DBMS-specific state information. As a result, these approaches miss many deep bugs in DBMSs.In this paper, we propose a novel stateful fuzzing approach to effectively test DBMSs and find deep bugs. Our basic idea is that after DBMSs process each SQL statement, there is useful state information that can be dynamically collected to facilitate later query generation. Based on this idea, our approach performs dynamic query interaction to incrementally generate complex and valid SQL queries, using the captured state information. To further improve the validity of generated queries, our approach uses the error status of query processing to filter out invalid test cases. We implement our approach as a fully automatic fuzzing framework, DynSQL. DynSQL is evaluated on 6 widely-used DBMSs (including SQLite, MySQL, MariaDB, PostgreSQL, MonetDB, and ClickHouse) and finds 40 unique bugs. Among these bugs, 38 have been confirmed, 21 have been fixed, and 19 have been assigned with CVE IDs. In our evaluation, DynSQL outperforms other state-of-the-art DBMS fuzzers, achieving 41% higher code coverage and finding many bugs missed by other fuzzers.",
    "author": "Authors:Zu-Ming Jiang,ETH Zurich;Jia-Ju Bai,Tsinghua University;Zhendong Su,ETH Zurich",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/jiang-zu-ming",
    "comment": ""
  },
  {
    "title": "Automated Security Analysis of Exposure Notification Systems",
    "abstract": "Abstract:We present the first formal analysis and comparison of the security of the two most widely deployed exposure notification systems, ROBERT and the Google and Apple Exposure Notification (GAEN) framework.ROBERT is the most popular instalment of the centralised approach to exposure notification, in which the risk score is computed by a central server. GAEN, in contrast, follows the decentralised approach, where the user's phone calculates the risk. The relative merits of centralised and decentralised systems have proven to be a controversial question. The majority of the previous analyses have focused on the privacy implications of these systems, ours is the first formal analysis to evaluate the security of the deployed systems—the absence of false risk alerts.We model the French deployment of ROBERT and the most widely deployed GAEN variant, Germany's Corona-Warn-App. We isolate the precise conditions under which these systems prevent false alerts. We determine exactly how an adversary can subvert the system via network and Bluetooth sniffing, database leakage or the compromise of phones, back-end systems and health authorities. We also investigate the security of the original specification of the DP3T protocol, in order to identify gaps between the proposed scheme and its ultimate deployment.We find a total of 27 attack patterns, including many that distinguish the centralised from the decentralised approach, as well as attacks on the authorisation procedure that differentiate all three protocols.  Our results suggest that ROBERT's centralised design is more vulnerable against both opportunistic and highly resourced attackers trying to perform mass-notification attacks.",
    "author": "Authors:Kevin Morio and Ilkan Esiyok,CISPA Helmholtz Center for Information Security;Dennis Jackson,Mozilla;Robert Künnemann,CISPA Helmholtz Center for Information Security",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/morio",
    "comment": ""
  },
  {
    "title": "xNIDS: Explaining Deep Learning-based Network Intrusion Detection Systems for Active Intrusion Responses",
    "abstract": "Abstract:While Deep Learning-based Network Intrusion Detection Systems (DL-NIDS) have recently been significantly explored and shown superior performance, they are insufficient to actively respond to the detected intrusions due to the semantic gap between their detection results and actionable interpretations. Furthermore, their high error costs make network operators unwilling to respond solely based on their detection results. The root cause of these drawbacks can be traced to the lack of explainability of DL-NIDS. Although some methods have been developed to explain deep learning-based systems, they are incapable of handling the history inputs and complex feature dependencies of structured data and do not perform well in explaining DL-NIDS.In this paper, we present XNIDS, a novel framework that facilitates active intrusion responses by explaining DL-NIDS. Our explanation method is highlighted by: (1) approximating and sampling around history inputs; and (2) capturing feature dependencies of structured data to achieve a high-fidelity explanation. Based on the explanation results, XNIDS can further generate actionable defense rules. We evaluate XNIDS with four state-of-the-art DL-NIDS. Our evaluation results show that XNIDS outperforms previous explanation methods in terms of fidelity, sparsity, completeness, and stability, all of which are important to active intrusion responses. Moreover, we demonstrate that XNIDS can efficiently generate practical defense rules, help understand DL-NIDS behaviors and troubleshoot detection errors",
    "author": "Authors:Feng Wei,University at Buffalo;Hongda Li,Palo Alto Networks;Ziming Zhao and Hongxin Hu,University at Buffalo",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/wei-feng",
    "comment": ""
  },
  {
    "title": "Pspray: Timing Side-Channel based Linux Kernel Heap Exploitation Technique",
    "abstract": "Abstract:The stealthiness of an attack is the most vital consideration for an attacker to reach their goals without being detected. Therefore, attackers put in a great deal of effort to increase the success rate of attacks in order not to expose information on the attacker and attack attempts resulting from failures. Exploitation of the kernel, which is a prime target for the attacker, usually takes advantage of heap-based vulnerabilities, and these exploits' success rates fortunately remain low (e.g., 56.1% on average) due to the operating principle of the default Linux kernel heap allocator, SLUB.This paper presents Pspray, a timing side-channel attack-based exploitation technique that significantly increases the success probability of exploitation. According to our evaluation, with 10 real-world vulnerabilities, Pspray significantly improves the success rate of all those vulnerabilities (e.g., from 56.1% to 97.92% on average). To prevent this exploitation technique from being abused by the attacker, we further introduce a new defense mechanism to mitigate the threat of Pspray. After applying mitigation, the overall success rate of Pspray becomes similar to that from before using Pspray with negligible performance overhead (0.25%) and memory overhead (0.52%).",
    "author": "Authors:Yoochan Lee and Jinhan Kwak,Seoul National University;Junesoo Kang and Yuseok Jeon,UNIST;Byoungyoung Lee,Seoul National University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/lee-yoochan",
    "comment": ""
  },
  {
    "title": "Strategies and Vulnerabilities of Participants in Venezuelan Influence Operations",
    "abstract": "Abstract:Studies of online influence operations, coordinated efforts to disseminate and amplify disinformation, focus on forensic analysis of social networks or of publicly available datasets of trolls and bot accounts. However, little is known about the experiences and challenges of human participants in influence operations. We conducted semi-structured interviews with 19 influence operations participants that contribute to the online image of Venezuela, to understand their incentives, capabilities, and strategies to promote content while evading detection. To validate a subset of their answers, we performed a quantitative investigation using data collected over almost four months, from Twitter accounts they control.We found diverse participants that include pro-government and opposition supporters, operatives and grassroots campaigners, and sockpuppet account owners and real users. While pro-government and opposition participants have similar goals and promotion strategies, they differ in their motivation, organization, adversaries and detection avoidance strategies. We report the Patria framework, a government platform for operatives to log activities and receive benefits. We systematize participant strategies to promote political content, and to evade and recover from Twitter penalties. We identify vulnerability points associated with these strategies, and suggest more nuanced defenses against influence operations.",
    "author": "Authors:Ruben Recabarren, Bogdan Carbunar, Nestor Hernandez, and Ashfaq Ali Shafin,Florida International University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/recabarren",
    "comment": ""
  },
  {
    "title": "Investigating Verification Behavior and Perceptions of Visual Digital Certificates",
    "abstract": "Abstract:This paper presents a qualitative study to explore how individuals perceive and verify visual digital certificates with QR codes. During the COVID-19 pandemic, such certificates have been used in the EU to provide standardized proof of vaccination.We conducted semi-structured interviews withN=17 participants responsible for verifying COVID-19 certificates as part of their job. Using a two-fold thematic analysis approach, we, among other things, identified and classified multiple behavioral patterns, including inadequate reliance on visual cues as a proxy for proper digital verification.We present design and structural recommendations based on our findings, including conceptual changes and improvements to storage and verification apps to limit shortcut opportunities. Our empirical findings are hence essential to improve the usability, robustness, and effectiveness of visual digital certificates and their verification.",
    "author": "Authors:Dañiel Gerhardt and Alexander Ponticello,CISPA Helmholtz Center for Information Security and Saarland University;Adrian Dabrowski and Katharina Krombholz,CISPA Helmholtz Center for Information Security",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/gerhardt",
    "comment": ""
  },
  {
    "title": "Remote Attacks on Speech Recognition Systems Using Sound from Power Supply",
    "abstract": "Abstract:Speech recognition (SR) systems are used on smart phones and speakers to make inquiries, compose emails, and initiate phone calls. However, they also impose a serious security risk. Researchers have demonstrated that the introduction of certain sounds can threaten the security of SR systems. Nonetheless, most of those methods require that the attacker approach to within a short distance of the victim, thereby limiting the applicability of such schemes. Other researchers have attacked SR systems remotely using peripheral devices (e.g., lasers); however, those methods require line of sight access and an always-on speaker in the vicinity of the victim. To the best of our knowledge, this paper presents the first-ever scheme, named SingAttack, in which SR systems are manipulated by human-like sounds generated in the switching mode power supply of the victim’s device. The fact that attack signals are transmitted via the power grid enables long-range attacks on existing SR systems. The proposed SingAttack system does not rely on extraneous hardware or unrealistic assumptions pertaining to device access. In experiments on ten SR systems, SingAttack achieved Mel-Cepstral Distortion of 7.8 from an attack initiated at a distance of 23m.",
    "author": "Authors:Lanqing Yang, Xinqi Chen, Xiangyong Jian, Leping Yang, Yijie Li, Qianfei Ren, Yi-Chao Chen, and Guangtao Xue,Shanghai Jiao Tong University;Xiaoyu Ji,Zhejiang University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/yang-lanqing",
    "comment": ""
  },
  {
    "title": "HOMESPY: The Invisible Sniffer of Infrared Remote Control of Smart TVs",
    "abstract": "Abstract:Infrared (IR) remote control is a widely used technology at home due to its simplicity and low cost. Most considered it to be \"secure'' because of the line-of-sight usage within the home. In this paper, we revisit the security of IR remote control schemes and examine their security assumptions under the settings of internet-connected smart homes. We focus on two specific questions: (1) whether IR signals could be sniffed by an IoT device; and (2) what information could be leaked out through the sniffed IR control signals.To answer these questions, we design a sniff module using a commercial-off-the-shelf IR receiver on a Raspberry Pi and show that the Infrared (IR) signal emanating from the remote control of a Smart TV can be captured by one of the nearby IoT devices, for example, a smart air-conditioner, even the signal is not aimed at the air-conditioner. The IR signal range and receiving angle are larger than most have thought.  We also developed algorithms to extract semantic information from the sniffed IR control signals, and evaluated with real-world applications. The results showed that lots of sensitive information could be leaked out through the sniffed IR control signals, including account name and password, PIN code, and even payment information.",
    "author": "Authors:Kong Huang, YuTong Zhou, and Ke Zhang,The Chinese University of Hong Kong;Jiacen Xu,University of California, Irvine;Jiongyi Chen,National University of Defense Technology;Di Tang,Indiana University Bloomington;Kehuan Zhang,The Chinese University of Hong Kong",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/huang",
    "comment": ""
  },
  {
    "title": "FuzzJIT: Oracle-Enhanced Fuzzing for JavaScript Engine JIT Compiler",
    "abstract": "Abstract:We present a novel fuzzing technique, FuzzJIT, for exposing JIT compiler bugs in JavaScript engines, based on our insight that JIT compilers shall only speed up the execution but never change the execution result of JavaScript code. FuzzJIT can activate the JIT compiler for every test case and acutely capture any execution discrepancy caused by JIT compilers. The key to success is the design of an input wrapping template, which proactively activates the JIT compiler and makes the generated samples oracle-aware themselves and the oracle is tested during execution spontaneously. We also design a set of mutation strategies to emphasize program elements promising in revealing JIT compiler bugs. FuzzJIT drills to JIT compilers and at the same time retains the high efficiency of fuzzing. We have implemented the design and applied the prototype to find new JIT compiler bugs in four mainstream JavaScript engines. In one month, ten, five, two, and 16 new bugs are exposed in JavaScriptCore, V8, SpiderMonkey, and ChakraCore, respectively, with three demonstrated exploitable.",
    "author": "Authors:Junjie Wang,College of Intelligence and Computing, Tianjin University;Zhiyi Zhang,CodeSafe Team, Qi An Xin Group Corp.;Shuang Liu,College of Intelligence and Computing, Tianjin University;Xiaoning Du,Monash University;Junjie Chen,College of Intelligence and Computing, Tianjin University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/wang-junjie",
    "comment": ""
  },
  {
    "title": "TPatch: A Triggered Physical Adversarial Patch",
    "abstract": "Abstract:Autonomous vehicles increasingly utilize the vision-based perception module to acquire information about driving environments and detect obstacles. Correct detection and classification are important to ensure safe driving decisions. Existing works have demonstrated the feasibility of fooling the perception models such as object detectors and image classifiers with printed adversarial patches. However, most of them are indiscriminately offensive to every passing autonomous vehicle. In this paper, we propose TPatch, a physical adversarial patch triggered by acoustic signals. Unlike other adversarial patches, TPatch remains benign under normal circumstances but can be triggered to launch a hiding, creating or altering attack by a designed distortion introduced by signal injection attacks towards cameras. To avoid the suspicion of human drivers and make the attack practical and robust in the real world, we propose a content-based camouflage method and an attack robustness enhancement method to strengthen it. Evaluations with three object detectors, YOLO V3/V5 and Faster R-CNN, and eight image classifiers demonstrate the effectiveness of TPatch in both the simulation and the real world. We also discuss possible defenses at the sensor, algorithm, and system levels.",
    "author": "Authors:Wenjun Zhu and Xiaoyu Ji,USSLAB, Zhejiang University;Yushi Cheng,BNRist, Tsinghua University;Shibo Zhang and Wenyuan Xu,USSLAB, Zhejiang University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/zhu",
    "comment": ""
  },
  {
    "title": "TAP: Transparent and Privacy-Preserving Data Services",
    "abstract": "Abstract:Users today expect more security from services that handle their data. In addition to traditional data privacy and integrity requirements, they expect transparency, i.e., that the service’s processing of the data is verifiable by users and trusted auditors. Our goal is to build a multi-user system that provides data privacy, integrity, and transparency for a large number of operations, while achieving practical performance.To this end, we first identify the limitations of existing approaches that use authenticated data structures. We find that they fall into two categories: 1) those that hide each user’s data from other users, but have a limited range of verifiable operations (e.g., CONIKS, Merkle2, and Proofs of Liabilities), and 2) those that support a wide range of verifiable operations, but make all data publicly visible (e.g., IntegriDB and FalconDB). We then present TAP to address the above limitations. The key component of TAP is a novel tree data structure that supports efficient result verification, and relies on independent audits that use zero-knowledge range proofs to show that the tree is constructed correctly without revealing user data. TAP supports a broad range of verifiable operations, including quantiles and sample standard deviations. We conduct a comprehensive evaluation of TAP, and compare it against two state-of-the-art baselines, namely IntegriDB and Merkle2, showing that the system is practical at scale.",
    "author": "Authors:Daniel Reijsbergen and Aung Maw,Singapore University of Technology and Design;Zheng Yang,Southwest University;Tien Tuan Anh Dinh and Jianying Zhou,Singapore University of Technology and Design",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/reijsbergen",
    "comment": ""
  },
  {
    "title": "UnGANable: Defending Against GAN-based Face Manipulation",
    "abstract": "Abstract:Deepfakes pose severe threats of visual misinformation to our society. One representative deepfake application is face manipulation that modifies a victim's facial attributes in an image, e.g., changing her age or hair color. The state-of-the-art face manipulation techniques rely on Generative Adversarial Networks (GANs). In this paper, we propose the first defense system, namely UnGANable, against GAN-inversion-based face manipulation.  In specific, UnGANable focuses on defending GAN inversion, an essential step for face manipulation. Its core technique is to search for alternative images (called cloaked images) around the original images (called target images) in image space.  When posted online, these cloaked images can jeopardize the GAN inversion process. We consider two state-of-the-art inversion techniques including optimization-based inversion and hybrid inversion, and design five different defenses under five scenarios depending on the defender's background knowledge. Extensive experiments on four popular GAN models trained on two benchmark face datasets show that UnGANable achieves remarkable effectiveness and utility performance, and outperforms multiple baseline methods. We further investigate four adaptive adversaries to bypass UnGANable and show that some of them are slightly effective.",
    "author": "Authors:Zheng Li,CISPA Helmholtz Center for Information Security;Ning Yu,Salesforce Research;Ahmed Salem,Microsoft Research;Michael Backes, Mario Fritz, and Yang Zhang,CISPA Helmholtz Center for Information Security",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/li-zheng",
    "comment": ""
  },
  {
    "title": "Back to School: On the (In)Security of Academic VPNs",
    "abstract": "Abstract:In this paper, we investigate the security of academic VPNs around the globe, covering various protocols that are used to realize VPN services. Our study considers 3 aspects that can go wrong in a VPN setup, which include (i) the design and implementation of VPN front-ends, (ii) the client-side configurations, and (iii) the back-end configurations. For (i), we tested more than 140 front-ends, and discovered numerous design and implementation issues that enable stealthy but severe attacks, including credential theft and remote code execution. For (ii), we collected and evaluated 2097 VPN setup guides from universities, and discovered many instances of secret key leakage and lack of consideration to potential attacks, leaving many client-side setups vulnerable. Finally, for (iii), we probed more than 2000 VPN back-ends to evaluate their overall health, and uncovered some concerning configuration and maintenance issues on many of them. Our findings suggest that severe cracks exist in the VPN setups of many organizations, making them profitable targets for criminals.",
    "author": "Authors:Ka Lok Wu,The Chinese University of Hong Kong;Man Hong Hue,The Chinese University of Hong Kong and Georgia Institute of Technology;Ngai Man Poon,The Chinese University of Hong Kong;Kin Man Leung,The University of British Columbia;Wai Yin Po, Kin Ting Wong, Sze Ho Hui, and Sze Yiu Chau,The Chinese University of Hong Kong",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/wu-ka-lok",
    "comment": ""
  },
  {
    "title": "Squint Hard Enough: Attacking Perceptual Hashing with Adversarial Machine Learning",
    "abstract": "Abstract:Many online communications systems use perceptual hash matching systems to detect illicit files in user content. These systems employ specialized perceptual hash functions such as Microsoft's PhotoDNA or Facebook's PDQ to produce a compact digest of an image file that can be approximately compared to a database of known illicit-content digests. Recently, several proposals have suggested that hash-based matching systems be incorporated intoclient-sideand end-to-end encrypted (E2EE) systems: in these designs, files that register as illicit content will be reported to the provider, while the remaining content will be sent confidentially. By using perceptual hashing to determine confidentiality guarantees, this new setting significantly changes the function of existing perceptual hashing — thus motivating the need to evaluate these functions from an adversarial perspective, using their perceptual capabilities against them. For example, an attacker may attempt to trigger a match on innocuous, but politically-charged, content in an attempt to stifle speech.In this work we develop threat models for perceptual hashing algorithms in an adversarial setting, and present attacks against the two most widely deployed algorithms: PhotoDNA and PDQ. Our results show that it is possible to efficiently generatetargeted second-preimage attacksin which an attacker creates a variant of some source image that matches some target digest. As a complement to this main result, we also further investigate the production of images that facilitatedetection avoidance attacks, continuing a recent investigation of Jain et al. Our work shows that existing perceptual hash functions are likely insufficiently robust to survive attacks on this new setting.",
    "author": "Authors:Jonathan Prokos,Johns Hopkins University;Neil Fendley,Johns Hopkins University Applied Physics Laboratory;Matthew Green,Johns Hopkins University;Roei Schuster,Vector Institute;Eran Tromer,Tel Aviv University and Columbia University;Tushar Jois and Yinzhi Cao,Johns Hopkins University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/prokos",
    "comment": ""
  },
  {
    "title": "\"All of them claim to be the best\": Multi-perspective study of VPN users and VPN providers",
    "abstract": "Abstract:As more users adopt VPNs for a variety of reasons, it is important to develop empirical knowledge of their needs and mental models of what a VPN offers. Moreover, studying VPN users alone is not enough because, by using a VPN, a user essentially transfers trust, say from their network provider, onto the VPN provider. To that end, we are the first to study the VPN ecosystem from both the users' and the providers' perspectives. In this paper, we conduct a quantitative survey of 1,252 VPN users in the U.S. and qualitative interviews of nine providers to answer several research questions regarding the motivations, needs, threat model, and mental model of users, and the key challenges and insights from VPN providers. We create novel insights by augmenting our multi-perspective results, and highlight cases where the user and provider perspectives are misaligned. Alarmingly, we find that users rely on and trust VPN review sites, but VPN providers shed light on how these sites are mostly motivated by money. Worryingly, we find that users have flawed mental models about the protection VPNs provide, and about data collected by VPNs. We present actionable recommendations for technologists and security and privacy advocates by identifying potential areas on which to focus efforts and improve the VPN ecosystem.",
    "author": "Authors:Reethika Ramesh,University of Michigan;Anjali Vyas,Cornell Tech;Roya Ensafi,University of Michigan",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/ramesh-vpn",
    "comment": ""
  },
  {
    "title": "GlitchHiker: Uncovering Vulnerabilities of Image Signal Transmission with IEMI",
    "abstract": "Abstract:Cameras have evolved into one of the most important gadgets in a variety of applications. In this paper, we identify a new class of vulnerabilities involving the hitherto disregarded image signal transmission phase and explain the underlying principles of camera glitches for the first time. Based on the vulnerabilities, we design the GlitchHiker attack that can actively induce controlled glitch images of a camera at various positions, widths, and numbers using intentional electromagnetic interference (IEMI). We successfully launch the GlitchHiker attack on 8 off-the-shelf camera systems in 5 categories in their original packages at a distance of up to 30 cm. Experiments with 2 case studies involving 4 object detectors and 2 face detectors show that injecting one ribboning suffices to hide, create or alter objects and persons with a maximum success rate of 98.5% and 80.4%, respectively. Then, we discuss real-world attack scenarios and perform preliminary investigations on the feasibility of targeted attacks. Finally, we propose hardware- and software-based countermeasures.",
    "author": "Authors:Qinhong Jiang, Xiaoyu Ji, Chen Yan, Zhixin Xie, Haina Lou, and Wenyuan Xu,Zhejiang University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/jiang-qinhong",
    "comment": ""
  },
  {
    "title": "Device Tracking via Linux’s New TCP Source Port Selection Algorithm",
    "abstract": "Abstract:We describe a tracking technique for Linux devices, exploiting a new TCP source port generation mechanism recently introduced to the Linux kernel. This mechanism is based on an algorithm, standardized in RFC 6056, for boosting security by better randomizing port selection. Our technique detects collisions in a hash function used in the said algorithm, based on sampling TCP source ports generated in an attacker-prescribed manner. These hash collisions depend solely on a per-device key, and thus the set of collisions forms a device ID that allows tracking devices across browsers, browser privacy modes, containers, and IPv4/IPv6 networks (including some VPNs). It can distinguish among devices with identical hardware and software, and lasts until the device restarts.We implemented this technique and then tested it using tracking servers in two different locations and with Linux devices on various networks. We also tested it on an Android device that we patched to introduce the new port selection algorithm. The tracking technique works in real-life conditions, and we report detailed findings about it, including its dwell time, scalability, and success rate in different network types. We worked with the Linux kernel team to mitigate the exploit, resulting in a security patch introduced in May 2022 to the Linux kernel, and we provide recommendations for better securing the port selection algorithm in the paper.",
    "author": "Authors:Moshe Kol, Amit Klein, and Yossi Gilad,Hebrew University of Jerusalem",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/kol",
    "comment": ""
  },
  {
    "title": "The Writing on the Wall and 3D Digital Twins: Personal Information in (not so) Private Real Estate",
    "abstract": "Abstract:Online real estate companies are starting to offer 3D virtual tours of homes (3D digital twins). We qualitatively analyzed 44 3D home tours with personal artifacts visible on Zillow and assessed each home for the extent and type of personal information shared. Using a codebook we created, we analyzed three categories of personal information in each home: government-provided guidance of what not to share on the internet, identity information, and behavioral information. Our analysis unearthed a wide variety of sensitive information across all homes, including names, hobbies, employment and education history, product preferences (e.g., pantry items, types of cigarettes), medications, credit card numbers, passwords, and more. Based on our analysis, residents both employed privacy protections and had privacy oversights. We identify potential adversaries that might use 3D tour information, highlight additional sensitive sources of indoor space information, and discuss future tools and policy changes that could address these issues.",
    "author": "Authors:Rachel McAmis and Tadayoshi Kohno,University of Washington",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/mcamis",
    "comment": ""
  },
  {
    "title": "PrivTrace: Differentially Private Trajectory Synthesis by Adaptive Markov Models",
    "abstract": "Abstract:Publishing trajectory data (individual's movement information) is very useful, but it also raises privacy concerns. To handle the privacy concern, in this paper, we apply differential privacy, the standard technique for data privacy, together with Markov chain model, to generate synthetic trajectories. We notice that existing studies all use Markov chain model and thus propose a framework to analyze the usage of the Markov chain model in this problem. Based on the analysis, we come up with an effective algorithm PrivTrace that uses the first-order and second-order Markov model adaptively. We evaluate PrivTrace and existing methods on synthetic and real-world datasets to demonstrate the superiority of our method.",
    "author": "Authors:Haiming Wang,Zhejiang University;Zhikun Zhang,CISPA Helmholtz Center for Information Security;Tianhao Wang,University of Virginia;Shibo He,Zhejiang University;Michael Backes,CISPA Helmholtz Center for Information Security;Jiming Chen,Zhejiang University;Yang Zhang,CISPA Helmholtz Center for Information Security",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/wang-haiming",
    "comment": ""
  },
  {
    "title": "Egg Hunt in Tesla Infotainment: A First Look at Reverse Engineering of Qt Binaries",
    "abstract": "Abstract:As one of the most popular C++ extensions for developing graphical user interface (GUI) based applications, Qt has been widely used in desktops, mobiles, IoTs, automobiles, etc. Although existing binary analysis platforms (e.g., angr and Ghidra) could help reverse engineer Qt binaries, they still need to address many fundamental challenges such as the recovery of control flow graphs and symbols. In this paper, we take a first look at understanding the unique challenges and opportunities in Qt binary analysis, developing enabling techniques, and demonstrating novel applications. In particular, although callbacks make control flow recovery challenging, we notice that Qt’s signal and slot mechanism can be used to recover function callbacks. More interestingly, Qt’s unique dynamic introspection can also be repurposed to recover semantic symbols. Based on these insights, we develop QtRE for function callback and semantic symbol recovery for Qt binaries. We have tested QtRE with two suites of Qt binaries: Linux KDE and the Tesla Model S firmware, where QtRE additionally recovered 10,867 callback instances and 24,973 semantic symbols from 123 binaries, which cannot be identified by existing tools. We demonstrate a novel application of using QtRE to extract hidden commands from a Tesla Model S firmware. QtRE discovered 12 hidden commands including five unknown to the public, which can potentially be exploited to manipulate vehicle settings.",
    "author": "Authors:Haohuang Wen and Zhiqiang Lin,The Ohio State University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/wen",
    "comment": ""
  },
  {
    "title": "Learning Normality is Enough: A Software-based Mitigation against Inaudible Voice Attacks",
    "abstract": "Abstract:Inaudible voice attacks silently inject malicious voice commands into voice assistants to manipulate voice-controlled devices such as smart speakers. To alleviate such threats for both existing and future devices, this paper proposes NormDetect, a software-based mitigation that can be instantly applied to a wide range of devices without requiring any hardware modification. To overcome the challenge that the attack patterns vary between devices, we design a universal detection model that does not rely on audio features or samples derived from specific devices. Unlike existing studies’ supervised learning approach, we adopt unsupervised learning inspired by anomaly detection. Though the patterns of inaudible voice attacks are diverse, we find that benign audios share similar patterns in the time-frequency domain. Therefore, we can detect the attacks (the anomaly) by learning the patterns of benign audios (the normality). NormDetect maps spectrum features to a low-dimensional space, performs similarity queries, and replaces them with the standard feature embeddings for spectrum reconstruction. This results in a more significant reconstruction error for attacks than normality. Evaluation based on the 383,320 test samples we collected from 24 smart devices shows an average AUC of 99.48% and EER of 2.23%, suggesting the effectiveness of NormDetect in detecting inaudible voice attacks.",
    "author": "Authors:Xinfeng Li, Xiaoyu Ji, and Chen Yan,USSLAB, Zhejiang University;Chaohao Li,USSLAB, Zhejiang University and Hangzhou Hikvision Digital Technology Co., Ltd.;Yichen Li,Hong Kong University of Science and Technology;Zhenning Zhang,University of Illinois at Urbana-Champaign;Wenyuan Xu,USSLAB, Zhejiang University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/li-xinfeng",
    "comment": ""
  },
  {
    "title": "FirmSolo: Enabling dynamic analysis of binary Linux-based IoT kernel modules",
    "abstract": "Abstract:The Linux-based firmware running on Internet of Things (IoT) devices is complex and consists of user level programs as well as kernel level code. Both components have been shown to have serious security vulnerabilities, and the risk linked to kernel vulnerabilities is particularly high, as these can lead to full system compromise. However, previous work only focuses on the user space component of embedded firmware. In this paper, we presentFirmwareSolution (FirmSolo), a system designed to incorporate the kernel space into firmware analysis.FirmSolofeatures theKernel Configuration Reverse Engineering(K.C.R.E.) process that leverages information (i.e., exported and required symbols and version magic) from the kernel modules found in firmware images to build a kernel that can load the modules within an emulated environment. This capability allows downstream analysis to broaden their scope into code executing in privileged mode.We evaluatedFirmSoloon 1,470 images containing 56,688 kernel modules where it loaded 64% of the kernel modules. To demonstrate howFirmSoloaids downstream analysis, we integrate it with two representative analysis systems; the TriforceAFL kernel fuzzer and Firmadyne, a dynamic firmware analysis tool originally devoid of kernel mode analysis capabilities. Our TriforceAFL experiments on a subset of 75 kernel modules discovered 19 previously-unknown bugs in 11 distinct proprietary modules. Through Firmadyne we confirmed the presence of these previously-unknown bugs in 84 firmware images. Furthermore, by usingFirmSolo, Firmadyne confirmed a previously-known memory corruption vulnerability in five different versions of the closed-source Kcodes'NetUSBmodule across 15 firmware images.",
    "author": "Authors:Ioannis Angelakopoulos, Gianluca Stringhini, and Manuel Egele,Boston University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/angelakopoulos",
    "comment": ""
  },
  {
    "title": "CacheQL: Quantifying and Localizing Cache Side-Channel Vulnerabilities in Production Software",
    "abstract": "Abstract:Cache side-channel attacks extract secrets by examining how victim software accesses cache. To date, practical attacks on crypto systems and media libraries are demonstrated under different scenarios, inferring secret keys from crypto algorithms and reconstructing private media data such as images.This work first presents eight criteria for designing a fullfledged detector for cache side-channel vulnerabilities. Then, we proposeCacheQL, a novel detector that meets all of these criteria.CacheQLprecisely quantifies information leaks of binary code, by characterizing the distinguishability of logged side channel traces. Moreover,CacheQLmodels leakage as a cooperative game, allowing information leakage to be precisely distributed to program points vulnerable to cache side channels.CacheQLis meticulously optimized to analyze whole side channel traces logged from production software (where each trace can have millions of records), and it alleviates randomness introduced by crypto blinding, ORAM, or real-world noises.Our evaluation quantifies side-channel leaks of production crypto and media software. We further localize vulnerabilities reported by previous detectors and also identify a few hundred new vulnerable program points in recent OpenSSL (ver. 3.0.0), MbedTLS (ver. 3.0.0), Libgcrypt (ver. 1.9.4). Many of our localized program points are within the pre-processing modules of crypto libraries, which are not analyzed by existing works due to scalability. We also localize vulnerabilities in Libjpeg (ver. 2.1.2) that leak privacy about input images.",
    "author": "Authors:Yuanyuan Yuan, Zhibo Liu, and Shuai Wang,The Hong Kong University of Science and Technology",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/yuan-yuanyuan-cacheql",
    "comment": ""
  },
  {
    "title": "“If sighted people know, I should be able to know:” Privacy Perceptions of Bystanders with Visual Impairments around Camera-based Technology",
    "abstract": "Abstract:Camera-based technology can be privacy-invasive, especially for bystanders who can be captured by the cameras but do not have direct control or access to the devices. The privacy threats become even more significant to bystanders with visual impairments (BVI) since they cannot visually discover the use of cameras nearby and effectively avoid being captured. While some prior research has studied visually impaired people's privacy concerns as direct users of camera-based assistive technologies, no research has explored their unique privacy perceptions and needs as bystanders. We conducted an in-depth interview study with 16 visually impaired participants to understand BVI's privacy concerns, expectations, and needs in different camera usage scenarios. A preliminary survey with 90 visually impaired respondents and 96 sighted controls was conducted to compare BVI and sighted bystanders' general attitudes towards cameras and elicit camera usage scenarios for the interview study. Our research revealed BVI's unique privacy challenges and perceptions around cameras, highlighting their needs for privacy awareness and protection. We summarized design considerations for future privacy-enhancing technologies to fulfill BVI's privacy needs.",
    "author": "Authors:Yuhang Zhao,University of Wisconsin—Madison;Yaxing Yao,University of Maryland, Baltimore County;Jiaru Fu and Nihan Zhou,University of Wisconsin—Madison",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/zhao-yuhang",
    "comment": ""
  },
  {
    "title": "Access Denied: Assessing Physical Risks to Internet Access Networks",
    "abstract": "Abstract:Regional access networks play an essential role in connecting both wireline and mobile users to the Internet. Today’s access networks support 5G cellular phones, cloud services, hospital and financial services, and remote work essential to the modern economy. Yet long-standing economic and architectural constraints produce points of limited redundancy that leave these networks exposed to targeted physical attacks resulting in widespread outages. This risk was dramatically shown in December 2020, when a bomb destroyed part of AT&T’s regional access network in Nashville, Tennessee disabling 911 emergency dispatch, air traffic control, hospital networks, and credit card processing, among other services.We combine new techniques for analyzing access-network infrastructure deployments with measurements of large-scale outages to demonstrate the feasibility and quantify potential impacts of targeted attacks. Our study yields insights into physical attack surfaces and resiliency limits of regional access networks. We analyze potential approaches to mitigate the risks we identify and discuss drawbacks identified by network operators. We hope that our empirical evaluation will inform risk assessments and operational practices, as well as motivate further analyses of this critical infrastructure.",
    "author": "Authors:Alexander Marder,CAIDA / UC San Diego;Zesen Zhang,UC San Diego;Ricky Mok and Ramakrishna Padmanabhan,CAIDA / UC San Diego;Bradley Huffaker,CAIDA/ UC San Diego;Matthew Luckie,University of Waikato;Alberto Dainotti,Georgia Tech;kc claffy,CAIDA/ UC San Diego;Alex C. Snoeren and Aaron Schulman,UC San Diego",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/marder",
    "comment": ""
  },
  {
    "title": "Security and Privacy Failures in Popular 2FA Apps",
    "abstract": "Abstract:The Time-based One-Time Password (TOTP) algorithm is a 2FA method that is widely deployed because of its relatively low implementation costs and purported security benefits over SMS 2FA. However, users of TOTP 2FA apps face a critical usability challenge: maintain access to the secrets stored within the TOTP app, or risk getting locked out of their accounts. To help users avoid this fate, popular TOTP apps implement a wide range of backup mechanisms, each with varying security and privacy implications. In this paper, we define an assessment methodology for conducting systematic security and privacy analyses of the backup and recovery functionality of TOTP apps. We identified all general purpose Android TOTP apps in the Google Play Store with at least 100k installs that implemented a backup mechanism (n= 22). Our findings show that most backup strategies end up placing trust in the same technologies that TOTP 2FA is meant to supersede: passwords, SMS, and email. Many backup implementations shared personal user information with third parties, had serious cryptographic flaws, and/or allowed the app developers to access the TOTP secrets in plaintext. We present our findings and recommend ways to improve the security and privacy of TOTP 2FA app backup mechanisms.",
    "author": "Authors:Conor Gilsenan,UC Berkeley / ICSI;Fuzail Shakir and Noura Alomar,UC Berkeley;Serge Egelman,UC Berkeley / ICSI",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/gilsenan",
    "comment": ""
  },
  {
    "title": "A comprehensive, formal and automated analysis of the EDHOC protocol",
    "abstract": "Abstract:EDHOC is a key exchange proposed by IETF’s Lightweight Authenticated Key Exchange (LAKE) Working Group (WG). Its design focuses on small message sizes to be suitable for constrained IoT communication technologies. In this paper we provide an in-depth formal analysis of EDHOC–draft version 12, taking into account the different proposed authentication methods and various options. For our analysis we use the SAPIC+ protocol platform that allows to compile a single specification to 3 state-of-the-art protocol verification tools (PROVERIF, TAMARIN and DEEPSEC) and take advantage of the strengths of each of the tools. In our analysis we consider a large variety of compromise scenarios, and also exploit recent results that allow to model existing weaknesses in cryptographic primitives, relaxing the perfect cryptography assumption, common in symbolic analysis. While our analysis confirmed security for the most basic threat models, a number of weaknesses were uncovered in the current design when more advanced threat models were taken into account. These weaknesses have been acknowledged by the LAKE WG and the mitigations we propose (and prove secure) have been included in version 14 of the draft.",
    "author": "Authors:Charlie Jacomme,Inria Paris;Elise Klein, Steve Kremer, and Maïwenn Racouchot,Inria Nancy and Université de Lorraine",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/jacomme",
    "comment": ""
  },
  {
    "title": "Hash Gone Bad: Automated discovery of protocol attacks that exploit hash function weaknesses",
    "abstract": "Abstract:Most cryptographic protocols use cryptographic hash functions as a building block. The security analyses of these protocols typically assume that the hash functions are perfect (such as in the random oracle model). However, in practice, most widely deployed hash functions are far from perfect -- and as a result, the analysis may miss attacks that exploit the gap between the model and the actual hash function used.We develop the first methodology to systematically discover attacks on security protocols that exploit weaknesses in widely deployed hash functions. We achieve this by revisiting the gap between theoretical properties of hash functions and the weaknesses of real-world hash functions, from which we develop a lattice of threat models. For all of these threat models, we develop fine-grained symbolic models.Our methodology's fine-grained models cannot be directly encoded in existing state-of-the-art analysis tools by just using their equational reasoning. We therefore develop extensions for the two leading tools, Tamarin and Proverif. In extensive case studies using our methodology, the extended tools rediscover all attacks that were previously reported for these protocols and discover several new variants.",
    "author": "Authors:Vincent Cheval,Inria Paris;Cas Cremers and Alexander Dax,CISPA Helmholtz Center for Information Security;Lucca Hirschi,Inria & LORIA;Charlie Jacomme,Inria Paris;Steve Kremer,Université de Lorraine, LORIA, Inria Nancy Grand-EstDistinguished Paper Award Winner",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/cheval",
    "comment": ""
  },
  {
    "title": "(M)WAIT for It: Bridging the Gap between Microarchitectural and Architectural Side Channels",
    "abstract": "Abstract:In the last years, there has been a rapid increase in microarchitectural attacks, exploiting side effects of various parts of the CPU. Most of them have in common that they rely on timing differences, requiring an architectural high-resolution timer to make microarchitectural states visible to an attacker.In this paper, we present a new primitive that converts microarchitectural states into architectural states without relying on time measurements. We exploit the unprivileged idle-loop optimization instructionsumonitorandumwaitintroduced with the new Intel microarchitectures (Tremont and Alder Lake). Although not documented, these instructions provide architectural feedback about the transient usage of a specified memory region. In three case studies, we show the versatility of our primitive. First, with Spectral, we present a way of enabling transient-execution attacks to leak bits architecturally with up to 200 kbit/s without requiring any architectural timer. Second, we show traditional side-channel attacks without relying on an architectural timer. Finally, we demonstrate that when augmented with a coarse-grained timer, we can also mount interrupt-timing attacks, allowing us to, e.g., detect which website a user opens. Our case studies highlight that the boundary between architecture and microarchitecture becomes more and more blurry, leading to new attack variants and complicating effective countermeasures.",
    "author": "Authors:Ruiyi Zhang,CISPA Helmholtz Center for Information Security;Taehyun Kim,Independent;Daniel Weber and Michael Schwarz,CISPA Helmholtz Center for Information Security",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/zhang-ruiyi",
    "comment": ""
  },
  {
    "title": "Content-Type: multipart/oracle - Tapping into Format Oracles in Email End-to-End Encryption",
    "abstract": "Abstract:S/MIME and OpenPGP use cryptographic constructions repeatedly shown to be vulnerable to format oracle attacks in protocols like TLS, SSH, or IKE. However, format oracle attacks in the End-to-End Encryption (E2EE) email setting are considered impractical as victims would need to open many attacker-modified emails and communicate the decryption result to the attacker. But is this really the case?In this paper, we survey how an attacker may remotely learn the decryption state in email E2EE. We analyze the interplay of MIME and IMAP and describe side-channels emerging from network patterns that leak the decryption status in Mail User Agents (MUAs). Concretely, we introduce specific MIME trees that produce decryption-dependent network patterns when opened in a victim’s email client.We survey 19 OpenPGP- and S/MIME-enabled email clients and four cryptographic libraries and uncover a side-channel leaking the decryption status of S/MIME messages in one client. Further, we discuss why the exploitation in the other clients is impractical and show that it is due to missing feature support and implementation quirks. Theseunintendeddefenses create an unfortunate conflict between usability and security. We present more rigid countermeasures for MUA developers and the standards to prevent exploitation.",
    "author": "Authors:Fabian Ising,Münster University of Applied Sciences and National Research Center for Applied Cybersecurity ATHENE;Damian Poddebniak and Tobias Kappert,Münster University of Applied Sciences;Christoph Saatjohann and Sebastian Schinzel,Münster University of Applied Sciences and National Research Center for Applied Cybersecurity ATHENE",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/ising",
    "comment": ""
  },
  {
    "title": "Glowing in the Dark: Uncovering IPv6 Address Discovery and Scanning Strategies in the Wild",
    "abstract": "Abstract:In this work we identify scanning strategies of IPv6 scanners on the Internet. We offer a unique perspective on the behavior of IPv6 scanners by conducting controlled experiments leveraging a large and unused /56 IPv6 subnet. We selectively make parts of the subnet visible to scanners by hosting applications that make direct or indirect contact with IPv6- capable servers on the Internet. By careful experiment design, we mitigate the effects of hidden variables on scans sent to our /56 subnet and establish causal relationships between IPv6 host activity types and the scanner attention they evoke. We show that IPv6 host activities e.g., Web browsing, membership in the NTP pool and Tor network, cause scanners to send a magnitude higher number of unsolicited IP scans and reverse DNS queries to our subnet than before. DNS scanners focus their scans in narrow regions of the address space where our applications are hosted whereas IP scanners broadly scan the entire subnet. Even after the host activity from our subnet subsides, we observe persistent residual scanning to portions of the address space that previously hosted applications.",
    "author": "Authors:Hammas Bin Tanveer,The University of Iowa;Rachee Singh,Microsoft and Cornell University;Paul Pearce,Georgia Tech;Rishab Nithyanand,University of Iowa",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/bin-tanveer",
    "comment": ""
  },
  {
    "title": "Every Signature is Broken: On the Insecurity of Microsoft Office’s OOXML Signatures",
    "abstract": "Abstract:Microsoft Office is one of the most widely used applications for office documents. For documents of prime importance, such as contracts and invoices, the content can be signed to guarantee authenticity and integrity. Since 2019, security researchers have uncovered attacks against the integrity protection in other office standards like PDF and ODF. Since Microsoft Office documents rely on different specifications and processing rules, the existing attacks are not applicable.We are the first to provide an in-depth analysis of Office Open XML (OOXML) Signatures, the Ecma/ISO standard that all Microsoft Office applications use. Our analysis reveals major discrepancies between the structure of office documents and the way digital signatures are verified. These discrepancies lead to serious security flaws in the specification and in the implementation. As a result, we discovered five new attack classes. Each attack allows attackers to modify the content in signed documents, while the signatures are still displayed as valid.We tested the attacks against different Microsoft Office versions on Windows and macOS, as well as against OnlyOffice Desktop on Windows, macOS and Linux. All tested Office versions are vulnerable. On macOS, we could reveal a surprising result: although Microsoft Office indicates that the document is protected by a signature, the signature is not validated. The attacks’ impact is alarming: attackers can arbitrarily manipulate the displayed content of a signed document, and victims are unable to detect the tampering. Even worse, we present a universal signature forgery attack that allows the attacker to create an arbitrary document and apply a signature extracted from a different source, such as an ODF document or a SAML token. For the victim, the document is displayed as validly signed by a trusted entity.We propose countermeasures to prevent such issues in the future. During a coordinated disclosure, Microsoft acknowledged and awarded our research with a bug bounty.",
    "author": "Authors:Simon Rohlmann, Vladislav Mladenov, Christian Mainka, Daniel Hirschberger, and Jörg Schwenk,Ruhr University Bochum",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/rohlmann",
    "comment": ""
  },
  {
    "title": "Humans vs. Machines in Malware Classification",
    "abstract": "Abstract:Today, the classification of a file as either benign or malicious is performed by a combination of deterministic indicators (such as antivirus rules), Machine Learning classifiers, and, more importantly, the judgment of human experts.However, to compare the difference between human and machine intelligence in malware analysis, it is first necessary to understand how human subjects approach malware classification.\nIn this direction, our work presents the first experimental study designed to capture which `features' of a suspicious program (e.g., static properties or runtime behaviors) are prioritized for malware classification according to humans and machines intelligence.\nFor this purpose, we created a malware classification game where 110 human players worldwide and with different seniority levels (72 novices and 38 experts) have competed to classify the highest number of unknown samples based on detailed sandbox reports.\nSurprisingly, we discovered that both experts and novices base their decisions on approximately the same features, even if there are clear differences between the two expertise classes.Furthermore, we implemented two state-of-the-art Machine Learning models for malware classification and evaluated their performances on the same set of samples.\nThe comparative analysis of the results unveiled a common set of features preferred by both Machine Learning models and helped better understand the difference in the feature extraction.This work reflects the difference in the decision-making process of humans and computer algorithms and the different ways they extract information from the same data.\nIts findings serve multiple purposes, from training better malware analysts to improving feature encoding.",
    "author": "Authors:Simone Aonzo,EURECOM;Yufei Han,INRIA;Alessandro Mantovani and Davide Balzarotti,EURECOM",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/aonzo",
    "comment": ""
  },
  {
    "title": "How fast do you heal? A taxonomy for post-compromise security in secure-channel establishment",
    "abstract": "Abstract:Post-Compromise Security (PCS) is a property of secure-channel establishment schemes, which limits the security breach of an adversary that has compromised one of the endpoint to a certain number of messages, after which the channel heals. An attractive property, especially in view of Snowden’s revelation of mass-surveillance, PCS was pioneered by the Signal messaging protocol, and is present in OTR. In this paper, we introduce a framework for quantifying and comparing PCS security, with respect to a broad taxonomy of adversaries. The generality and flexibility of our approach allows us to model the healing speed of a broad class of protocols, including Signal, but also an identity-based messaging protocol named SAID, and even a composition of 5G handover protocols.",
    "author": "Authors:Olivier Blazy,LIX, CNRS, Inria, École Polytechnique, Institut Polytechnique de Paris, France;Ioana Boureanu,University of Surrey, Surrey Centre for Cyber Security, UK;Pascal Lafourcade,LIMOS, University of Clermont Auvergne, France;Cristina Onete,XLIM, University of Limoges, France;Léo Robert,LIMOS, University of Clermont Auvergne, France",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/blazy",
    "comment": ""
  },
  {
    "title": "Assessing Anonymity Techniques Employed in German Court Decisions: A De-Anonymization Experiment",
    "abstract": "Abstract:Democracy requires transparency. Consequently, courts of law must publish their decisions. At the same time, the interests of the persons involved in these court decisions must be protected. For this reason, court decisions in Europe are anonymized using a variety of techniques. To understand how well these techniques protect the persons involved, we conducted an empirical experiment with 54 law students, whom we asked to de-anonymize 50 German court decisions. We found that all anonymization techniques used in these court decisions were vulnerable, most notably the use of initials. Since even supposedly secure anonymization techniques proved vulnerable, our work empirically reveals the complexity involved in the anonymization of court decisions, and thus calls for further research to increase anonymity while preserving comprehensibility. Toward that end, we provide recommendations for improving anonymization quality. Finally, we provide an empirical notion of “reasonable effort,” to flesh out the definition of anonymity in the legal context. In doing so, we bridge the gap between the technical and the legal understandings of anonymity.",
    "author": "Authors:Dominic Deuber and Michael Keuchen,Friedrich-Alexander-Universität Erlangen-Nürnberg;Nicolas Christin,Carnegie Mellon University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/deuber",
    "comment": ""
  },
  {
    "title": "GLeeFuzz: Fuzzing WebGL Through Error Message Guided Mutation",
    "abstract": "Abstract:WebGL is a set of standardized JavaScript APIs for GPU accelerated graphics. Security of the WebGL interface is paramount because it exposes remote and unsandboxed access to the underlying graphics stack (including the native GL libraries and GPU drivers) in the host OS. Unfortunately, applying state-of-the-art fuzzing techniques to the WebGL interface for vulnerability discovery is challenging because of (1) its huge input state space, and (2) the infeasibility of collecting code coverage across concurrent processes, closed-source libraries, and device drivers in the kernel.Our fuzzing technique, GLeeFuzz, guides input mutation by error messages instead of code coverage. Our key observation is that browsers emit meaningful error messages to aid developers in debugging their WebGL programs. Error messages indicate which part of the input fails (e.g., incomplete arguments, invalid arguments, or unsatisfied dependencies between API calls). Leveraging error messages as feedback, the fuzzer effectively expands coverage by focusing mutation on erroneous parts of the input. We analyze Chrome’s WebGL implementation to identify the dependencies between error-emitting statements and rejected parts of the input, and use this information to guide input mutation. We evaluate our GLeeFuzz prototype on Chrome, Firefox, and Safari on diverse desktop and mobile OSes. We discovered 7 vulnerabilities, 4 in Chrome, 2 in Safari, and 1 in Firefox. The Chrome vulnerabilities allow a remote attacker to freeze the GPU and possibly execute remote code at the browser privilege.",
    "author": "Authors:Hui Peng,Purdue University;Zhihao Yao and Ardalan Amiri Sani,UC Irvine;Dave (Jing) Tian,Purdue University;Mathias Payer,EPFL",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/peng",
    "comment": ""
  },
  {
    "title": "Are You Spying on Me? Large-Scale Analysis on IoT Data Exposure through Companion Apps",
    "abstract": "Abstract:Recent research has highlighted privacy as a primary concern for IoT device users. However, due to the challenges in conducting a large-scale study to analyze thousands of devices, there has been less study on how pervasive unauthorized data exposure has actually become on today's IoT devices and the privacy implications of such exposure.  To fill this gap, we leverage the observation that most IoT devices on the market today use their companion mobile apps as an intermediary to process, label and transmit the data they collect. As a result, the semantic information carried by these apps can be recovered and analyzed automatically to track the collection and sharing of IoT data.In this paper, we report the first of such a study, based upon a new framework IoTProfiler, which statically analyzes a large number of companion apps to infer and track the data collected by their IoT devices.  Our approach utilizes machine learning to detect the code snippet in a companion app that handles IoT data and further recovers the semantics of the data from the snippet to evaluate whether their exposure has been properly communicated to the user. By running IoTProfiler on 6,208 companion apps, our research has led to the discovery of 1,973 apps that expose user data without proper disclosure, covering IoT devices from at least 1,559 unique vendors. Our findings include highly sensitive information, such as health status and home address, and the pervasiveness of unauthorized sharing of the data to third parties, including those in different countries. Our findings highlight the urgent need to regulate today's IoT industry to protect user privacy.",
    "author": "Authors:Yuhong Nan,Sun Yat-sen University;Xueqiang Wang,University of Central Florida;Luyi Xing and Xiaojing Liao,Indiana University Bloomington;Ruoyu Wu and Jianliang Wu,Purdue University;Yifan Zhang and XiaoFeng Wang,Indiana University Bloomington",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/nan",
    "comment": ""
  },
  {
    "title": "The Space of Adversarial Strategies",
    "abstract": "Abstract:Adversarial examples, inputs designed to induce worst-case behavior in machine learning models, have been extensively studied over the past decade. Yet, our understanding of this phenomenon stems from a rather fragmented pool of knowledge; at present, there are a handful of attacks, each with disparate assumptions in threat models and incomparable definitions of optimality. In this paper, we propose a systematic approach to characterize worst-case (i.e., optimal) adversaries. We first introduce an extensible decomposition of attacks in adversarial machine learning by atomizing attack components intosurfacesandtravelers. With our decomposition, we enumerate over components to create 576 attacks (568 of which were previously unexplored). Next, we propose thePareto Ensemble Attack(PEA): a theoretical attack that upper-bounds attack performance. With our new attacks, we measure performance relative to the PEA on: both robust and non-robust models, seven datasets, and three extendedℓp-based threat models incorporating compute costs, formalizing theSpace of Adversarial Strategies. From our evaluation we find that attack performance to be highly contextual: the domain, model robustness, and threat model can have a profound influence on attack efficacy. Our investigation suggests that future studies measuring the security of machine learning should: (1) be contextualized to the domain & threat models, and (2) go beyond the handful of known attacks used today.",
    "author": "Authors:Ryan Sheatsley, Blaine Hoak, Eric Pauley, and Patrick McDaniel,University of Wisconsin-Madison",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/sheatsley",
    "comment": ""
  },
  {
    "title": "Credit Karma: Understanding Security Implications of Exposed Cloud Services through Automated Capability Inference",
    "abstract": "Abstract:The increasing popularity of mobile applications (apps) has led to a rapid increase in demand for backend services, such as notifications, data storage, authentication, etc., hosted in cloud platforms.  This has induced the attackers to consistently target such cloud services, resulting in a rise in data security incidents. In this paper, we focus on one of the main reasons why cloud services become increasingly vulnerable: (over-)privileges in cloud credentials.  We propose a systematic approach to recover cloud credentials from apps, infer their capabilities in cloud, and verify if the capabilities exceed the legitimate needs of the apps.  We further look into the security implications of the leaked capabilities, demonstrating how seemingly benevolent, unprivileged capabilities, when combined, can lead to unexpected, severe security problems.  A large-scale study of ~1.3 million apps over two types of cloud services, notification and storage, on three popular cloud platforms, AWS, Azure, and Alibaba Cloud, shows that ~27.3% of apps that use cloud services expose over-privileged cloud credentials.  Moreover, a majority of over-privileged cloud credentials (~64.8%) potentially lead to data attacks.  During the study, we also uncover new types of attacks enabled by regular cloud credentials, such as spear-phishing through push notification and targeted user data pollution. We have made responsible disclosures to both app vendors and cloud providers and start seeing the impact---over 300 app vendors already fixed the problems.",
    "author": "Authors:Xueqiang Wang,University of Central Florida;Yuqiong Sun,Meta;Susanta Nanda,ServiceNow;XiaoFeng Wang,Indiana University Bloomington",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/wang-xueqiang-karma",
    "comment": ""
  },
  {
    "title": "That Person Moves Like A Car: Misclassification Attack Detection for Autonomous Systems Using Spatiotemporal Consistency",
    "abstract": "Abstract:Autonomous systems commonly rely on object detection and tracking (ODT) to perceive the environment and predict the trajectory of surrounding objects for planning purposes. An ODT’s output contains object classes and tracks that are traditionally predicted independently. Recent studies have shown that ODT’s output can be falsified by various perception attacks with well-crafted noise, but existing defenses are limited to specific noise injection methods and thus fail to generalize. In this work we propose PercepGuard for the detection of misclassification attacks against perception modules regardless of attack methodologies. PercepGuard exploits the spatiotemporal properties of a detected object (inherent in the tracks), and cross-checks the consistency between the track and class predictions. To improve adversarial robustness against defense-aware (adaptive) attacks, we additionally consider context data (such as ego-vehicle velocity) for contextual consistency verification, which dramatically increases the attack difficulty. Evaluations with both real-world and simulated datasets produce a FPR of 5% and a TPR of 99% against adaptive attacks. A baseline comparison confirms the advantage of leveraging temporal features. Real-world experiments with displayed and projected adversarial patches show that PercepGuard detects 96% of the attacks on average.",
    "author": "Authors:Yanmao Man,University of Arizona;Raymond Muller,Purdue University;Ming Li,University of Arizona;Z. Berkay Celik,Purdue University;Ryan Gerdes,Virginia Tech",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/man",
    "comment": ""
  },
  {
    "title": "CipherH: Automated Detection of Ciphertext Side-channel Vulnerabilities in Cryptographic Implementations",
    "abstract": "Abstract:The ciphertext side channel is a new type of side channels that exploits deterministic memory encryption of trusted execution environments (TEE). It enables the adversary with read accesses to the ciphertext of the encrypted memory, either logically or physically, to compromise cryptographic implementations protected by TEEs with high fidelity. Prior studies have concluded that the ciphertext side channel is a severe threat to not only AMD SEV-SNP, where the vulnerability was first discovered, but to all TEEs with deterministic memory encryption.In this paper, we propose CipherH, a practical framework for automating the analysis of cryptographic software and detecting program points vulnerable to ciphertext side channels. CipherH is designed to perform a practical hybrid analysis in production cryptographic software, with a speedy dynamic taint analysis to track the usage of secrets throughout the entire program and a static symbolic execution procedure on each “tainted” function to reason about ciphertext side channel vulnerabilities using symbolic constraint. Empirical evaluation has led to the discovery of over 200 vulnerable program points from the state-of-the-art RSA and ECDSA/ECDH implementations from OpenSSL, MbedTLS, and WolfSSL. Representative cases have been reported to and confirmed or patched by the developers.",
    "author": "Authors:Sen Deng,Southern University of Science and Technology;Mengyuan Li,The Ohio State University;Yining Tang,Southern University of Science and Technology;Shuai Wang,Hong Kong University of Science and Technology;Shoumeng Yan,The Ant Group;Yinqian Zhang,Southern University of Science and Technology",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/deng-sen",
    "comment": ""
  },
  {
    "title": "\"My Privacy for their Security\": Employees' Privacy Perspectives and Expectations when using Enterprise Security Software",
    "abstract": "Abstract:Employees are often required to use Enterprise Security Software (“ESS”) on corporate and personal devices. ESS products collect users’ activity data including users’ location, applications used, and websites visited — operating from employees’ device to the cloud. To the best of our knowledge, the privacy implications of this data collection have yet to be explored. We conduct an online survey (n=258) and a semistructured interview (n=22) with ESS users to understand their privacy perceptions, the challenges they face when using ESS, and the ways they try to overcome those challenges. We found that while many participants reported receiving no information about what data their ESS collected, those who received some information often underestimated what was collected. Employees reported lack of communication about various data collection aspects including: the entities with access to the data and the scope of the data collected. We use the interviews to uncover several sources of misconceptions among the participants. Our findings show that while employees understand the need for data collection for security, the lack of communication and ambiguous data collection practices result in the erosion of employees’ trust on the ESS and employers. We obtain suggestions from participants on how to mitigate these misconceptions and collect feedback on our design mockups of a privacy notice and privacy indicators for ESS. Our work will benefit researchers, employers, and ESS developers to protect users’ privacy in the growing ESS market.",
    "author": "Authors:Jonah Stegman, Patrick J. Trottier, Caroline Hillier, and Hassan Khan,University of Guelph;Mohammad Mannan,Concordia University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/stegman",
    "comment": ""
  },
  {
    "title": "Combating Robocalls with Phone Virtual Assistant Mediated Interaction",
    "abstract": "Abstract:Mass robocalls affect millions of people on a daily basis. Unfortunately, most current defenses against robocalls rely on phone blocklists and are ineffective against caller ID spoofing. To enable detection and blocking of spoofed robocalls, we propose a NLP based smartphone virtual assistant that automatically vets incoming calls. Similar to a human assistant, the virtual assistant picks up an incoming call and uses machine learning models to interact with the caller to determine if the call source is a human or a robocaller. It interrupts a user by ringing the phone only when the call is determined to be not from a robocaller. Security analysis performed by us shows that such a system can stop current and more sophisticated robocallers that might emerge in the future. We also conduct a user study that shows that the virtual assistant can preserve phone call user experience.",
    "author": "Authors:Sharbani Pandit,Georgia Institute of Technology;Krishanu Sarker,Georgia State University;Roberto Perdisci,University of Georgia and Georgia Institute of Technology;Mustaque Ahamad and Diyi Yang,Georgia Institute of Technology",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/pandit",
    "comment": ""
  },
  {
    "title": "On the Feasibility of Malware Unpacking via Hardware-assisted Loop Profiling",
    "abstract": "Abstract:Hardware Performance Counters (HPCs) are built-in registers of modern processors to count the occurrences of various micro-architectural events. Measuring HPCs values is a cost-effective way to characterize dynamic program behaviors. Because of the ease of use and tamper-resistant advantages, using HPCs coupled with machine learning models to address security problems is on the rise in recent years. However, lately the suitability of HPCs for security has been questioned in light of the non-determinism concerns: measurement errors caused by interrupt skid and time-division multiplexing can undermine the effectiveness of using HPCs in security applications.With these cautions in mind, we explore ways to tame hardware event’s non-determinism nature for malware unpacking, which is a long-standing challenge in malware analysis. Our research is motivated by two key observations. First, the unpacking process, which involves expensive iterations of decryption or decompression, can incur identifiable deviations in hardware events. Second, loop-centric HPCs profiling can minimize the imprecisions caused by interrupt skid and time-division multiplexing. Therefore, we utilize two mechanisms offered by Intel CPUs (i.e., Precise Event-Based Sampling (PEBS) and Last Branch Record) to develop a generic, hardware-assisted unpacking technique, called LoopHPCs. It offers a new, obfuscation-resilient solution to identify the original code from multiple “written-then-executed” layers. Our controlled experiments demonstrate that LoopHPCs can obtain precise and consistent HPCs values across different Intel CPU architectures and OSs.",
    "author": "Authors:Binlin Cheng,Shandong University & Hubei Normal University;Erika A Leal,Tulane University;Haotian Zhang,The University of Texas at Arlington;Jiang Ming,Tulane University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/cheng-binlin",
    "comment": ""
  },
  {
    "title": "Distance-Aware Private Set Intersection",
    "abstract": "Abstract:Private set intersection (PSI) allows two mutually untrusting parties to compute an intersection of their sets, without revealing information about items that are not in the intersection. This work introduces a PSI variant called distance-aware PSI (DA-PSI) for sets whose elements lie in a metric space. DAPSI returns pairs of items that are within a specified distance threshold of each other. This paper puts forward DA-PSI constructions for two metric spaces: (i) Minkowski distance of order 1 over the set of integers (i.e., for integers a and b, their distance is |a−b|); and (ii) Hamming distance over the set of binary strings of length ℓ. In the Minkowski DA-PSI protocol, the communication complexity scales logarithmically in the distance threshold and linearly in the set size. In the Hamming DA-PSI protocol, the communication volume scales quadratically in the distance threshold and is independent of the dimensionality of string length ℓ. Experimental results with real applications confirm that DA-PSI provides more effective matching at lower cost than naïve solutions.",
    "author": "Authors:Anrin Chakraborti,Duke University;Giulia Fanti,Carnegie Mellon University;Michael K. Reiter,Duke University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/chakraborti-intersection",
    "comment": ""
  },
  {
    "title": "NeuroPots: Realtime Proactive Defense against Bit-Flip Attacks in Neural Networks",
    "abstract": "Abstract:Deep neural networks (DNNs) are becoming ubiquitous in various safety- and security-sensitive applications such as self-driving cars and financial systems. Recent studies revealed that bit-flip attacks (BFAs) can destroy DNNs' functionality via DRAM rowhammer—by precisely injecting a few bit-flips into the quantized model parameters, attackers can either degrade the model accuracy to random guessing, or misclassify certain inputs into a target class. BFAs can cause catastrophic consequences if left undetected. However, detecting BFAs is challenging because bit-flips can occur on any weights in a DNN model, leading to a large detection surface. Unlike prior works that attempt to \"patch'' vulnerabilities of DNN models, our work is inspired by the idea of \"honeypot''. Specifically, we propose a proactive defense concept named NeuroPots, which embeds a few \"honey neurons'' as crafted vulnerabilities into the DNN model to lure the attacker into injecting faults in them, thus making detection and model recovery efficient. We utilize NeuroPots to develop a trapdoor-enabled defense framework. We design a honey neuron selection strategy, and propose two methods for embedding trapdoors into the DNN model. Furthermore, since the majority of injected bit flips will concentrate in the trapdoors, we use a checksum-based detection approach to efficiently detect faults in them, and rescue the model accuracy by \"refreshing'' those faulty trapdoors. Our experiments show that trapdoor-enabled defense achieves high detection performance and effectively recovers a compromised model at a low cost across a variety of DNN models and datasets.",
    "author": "Authors:Qi Liu,Lehigh University;Jieming Yin,Nanjing University of Posts and Telecommunications;Wujie Wen,Lehigh University;Chengmo Yang,University of Delaware;Shi Sha,Wilkes University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/liu-qi",
    "comment": ""
  },
  {
    "title": "Towards a General Video-based Keystroke Inference Attack",
    "abstract": "Abstract:A large collection of research literature has identified the privacy risks of keystroke inference attacks that use statistical models to extract content typed onto a keyboard. Yet existing attacks cannot operate in realistic settings, and rely on strong assumptions of labeled training data, knowledge of keyboard layout, carefully placed sensors or data from other side-channels.  This paper describes experiences developing and evaluating a general, video-based keystroke inference attack that operates in common public settings using a single commodity camera phone, with no pretraining, no keyboard knowledge, no local sensors, and no side-channels. We show that using a self-supervised approach, noisy finger tracking data from a video can be processed, labeled and filtered to train DNN keystroke inference models that operate accurately on the same video. Using IRB approved user studies, we validate attack efficacy across a variety of environments, keyboards, and content, and users with different typing behaviors and abilities.  Our project website is located at:https://sandlab.cs.uchicago.edu/keystroke/.",
    "author": "Authors:Zhuolin Yang, Yuxin Chen, and Zain Sarwar,University of Chicago;Hadleigh Schwartz,Columbia University;Ben Y. Zhao and Haitao Zheng,University of Chicago",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/yang-zhuolin",
    "comment": ""
  },
  {
    "title": "URET: Universal Robustness Evaluation Toolkit (for Evasion)",
    "abstract": "Abstract:Machine learning models are known to be vulnerable to adversarial evasion attacks as illustrated by image classification models. Thoroughly understanding such attacks is critical in order to ensure the safety and robustness of critical AI tasks. However, most evasion attacks are difficult to deploy against a majority of AI systems because they have focused on image domain with only few constraints. An image is composed of homogeneous, numerical, continuous, and independent features, unlike many other input types to AI systems used in practice. Furthermore, some input types include additional semantic and functional constraints that must be observed to generate realistic adversarial inputs. In this work, we propose a new framework to enable the generation of adversarial inputs irrespective of the input type and task domain. Given an input and a set of pre-defined input transformations, our framework discovers a sequence of transformations that result in a semantically correct and functional adversarial input. We demonstrate the generality of our approach on several diverse machine learning tasks with various input representations. We also show the importance of generating adversarial examples as they enable the deployment of mitigation techniques.",
    "author": "Authors:Kevin Eykholt, Taesung Lee, Douglas Schales, Jiyong Jang, and Ian Molloy,IBM Research;Masha Zorin,University of Cambridge",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/eykholt",
    "comment": ""
  },
  {
    "title": "You Can't See Me: Physical Removal Attacks on LiDAR-based Autonomous Vehicles Driving Frameworks",
    "abstract": "Abstract:Autonomous Vehicles (AVs) increasingly use LiDAR-based object detection systems to perceive other vehicles and pedestrians on the road. While existing attacks on LiDAR-based autonomous driving architectures focus on lowering the confidence score of AV object detection models to induce obstacle misdetection, our research discovers how to leverage laser-based spoofing techniques to selectively remove the LiDAR point cloud data of genuine obstacles at the sensor level before being used as input to the AV perception. The ablation of this critical LiDAR information causes autonomous driving obstacle detectors to fail to identify and locate obstacles and, consequently, induces AVs to make dangerous automatic driving decisions. In this paper, we present a method invisible to the human eye that hides objects and deceives autonomous vehicles’ obstacle detectors by exploiting inherent automatic transformation and filtering processes of LiDAR sensor data integrated with autonomous driving frameworks. We call such attacks Physical Removal Attacks (PRA), and we demonstrate their effectiveness against three popular AV obstacle detectors (Apollo, Autoware, PointPillars), and we achieve 45◦ attack capability. We evaluate the attack impact on three fusion models (Frustum-ConvNet, AVOD, and Integrated-Semantic Level Fusion) and the consequences on the driving decision using LGSVL, an industry-grade simulator. In our moving vehicle scenarios, we achieve a 92.7% success rate removing 90% of a target obstacle’s cloud points. Finally, we demonstrate the attack’s success against two popular defenses against spoofing and object hiding attacks and discuss two enhanced defense strategies to mitigate our attack.",
    "author": "Authors:Yulong Cao,University of Michigan;S. Hrushikesh Bhupathiraju and Pirouz Naghavi,University of Florida;Takeshi Sugawara,The University of Electro-Communications;Z. Morley Mao,University of Michigan;Sara Rampazzi,University of Florida",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/cao",
    "comment": ""
  },
  {
    "title": "Framing Frames: Bypassing Wi-Fi Encryption by Manipulating Transmit Queues",
    "abstract": "Abstract:Wi-Fi devices routinely queue frames at various layers of the network stack before transmitting, for instance, when the receiver is in sleep mode. In this work, we investigate how Wi-Fi access points manage the security context of queued frames. By exploiting power-save features, we show how to trick access points into leaking frames in plaintext, or encrypted using the group or an all-zero key. We demonstrate resulting attacks against several open-source network stacks. We attribute our findings to the lack of explicit guidance in managing security contexts of buffered frames in the 802.11 standards. The unprotected nature of the power-save bit in a frame’s header, which our work reveals to be a fundamental design flaw, also allows an adversary to force queue frames intended for a specific client resulting in its disconnection and trivially executing a denial-of-service attack. Furthermore, we demonstrate how an attacker can override and control the security context of frames that are yet to be queued. This exploits a design flaw in hotspot-like networks and allows the attacker to force an access points to encrypt yet to be queued frames using an adversary-chosen key, thereby bypassing Wi-Fi encryption entirely. Our attacks have a widespread impact as they affect various devices and operating systems (Linux, FreeBSD, iOS, and Android) and because they can be used to hijack TCP connections or intercept client and web traffic. Overall, we highlight the need for transparency in handling security context across the network stack layers and the challenges in doing so.",
    "author": "Authors:Domien Schepers and Aanjhan Ranganathan,Northeastern University;Mathy Vanhoef,imec-DistriNet, KU Leuven",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/schepers",
    "comment": ""
  },
  {
    "title": "SMACK: Semantically Meaningful Adversarial Audio Attack",
    "abstract": "Abstract:Voice controllable systems rely on speech recognition and speaker identification as the key enabling technologies. While they bring revolutionary changes to our daily lives, their security has become a growing concern. Existing work has demonstrated the feasibility of using maliciously crafted perturbations to manipulate speech or speaker recognition. Although these attacks vary in targets and techniques, they all require the addition of noise perturbations. While these perturbations are generally restricted toLp-bounded neighborhood, the added noises inevitably leave unnatural traces recognizable by humans, and can be used for defense. To address this limitation, we introduce a new class of adversarial audio attack, namedSemanticallyMeaningful AdversarialAudio AttaCK(SMACK), where the inherent speech attributes (such as prosody) are modified such that they still semantically represent the same speech and preserves the speech quality. The efficacy of SMACK was evaluated against five transcription systems and two speaker recognition systems in a black-box manner. By manipulating semantic attributes, our adversarial audio examples are capable of evading the state-of-the-art defenses, with better speech naturalness compared to traditionalLp-bounded attacks in the human perceptual study.",
    "author": "Authors:Zhiyuan Yu, Yuanhaur Chang, and Ning Zhang,Washington University in St. Louis;Chaowei Xiao,Arizona State University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/yu-zhiyuan-smack",
    "comment": ""
  },
  {
    "title": "Gradient Obfuscation Gives a False Sense of Security in Federated Learning",
    "abstract": "Abstract:Federated learning has been proposed as a privacy-preserving machine learning framework that enables multiple clients to collaborate without sharing raw data. However, client privacy protection is not guaranteed by design in this framework. Prior work has shown that the gradient sharing strategies in federated learning can be vulnerable to data reconstruction attacks. In practice, though, clients may not transmit raw gradients considering the high communication cost or due to privacy enhancement requirements. Empirical studies have demonstrated that gradient obfuscation, including intentional obfuscation via gradient noise injection and unintentional obfuscation via gradient compression, can provide more privacy protection against reconstruction attacks. In this work, we present a new reconstruction attack framework targeting the image classification task in federated learning. We show how commonly adopted gradient postprocessing procedures, such as gradient quantization, gradient sparsification, and gradient perturbation may give a false sense of security in federated learning. Contrary to prior studies, we argue that privacy enhancement should not be treated as a byproduct of gradient compression. Additionally, we design a new method under the proposed framework to reconstruct images at the semantic level. We quantify the semantic privacy leakage and compare it with conventional image similarity scores. Our comparisons challenge the image data leakage evaluation schemes in the literature. The results emphasize the importance of revisiting and redesigning the privacy protection mechanisms for client data in existing federated learning algorithms.",
    "author": "Authors:Kai Yue,North Carolina State University;Richeng Jin,Zhejiang University;Chau-Wai Wong, Dror Baron, and Huaiyu Dai,North Carolina State University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/yue",
    "comment": ""
  },
  {
    "title": "Automata-Guided Control-Flow-Sensitive Fuzz Driver Generation",
    "abstract": "Abstract:Fuzz drivers are essential for fuzzing library APIs. However, manually composing fuzz drivers is difficult and time-consuming. Therefore, several works have been proposed to generate fuzz drivers automatically. Although these works can learn correct API usage from the consumer programs of the target library, three challenges still hinder the quality of the generated fuzz drivers: 1) How to learn and utilize the control dependencies in API usage; 2) How to handle the noises of the learned API usage, especially for complex real-world consumer programs; 3) How to organize independent sets of API usage inside the fuzz driver to better coordinate with fuzzers.To solve these challenges, we propose RUBICK, an automata-guided control-flow-sensitive fuzz driver generation technique. RUBICK has three key features: 1) it models the API usage (including API data and control dependencies) as a deterministic finite automaton; 2) it leverages active automata learning algorithm to distill the learned API usage; 3) it synthesizes a single automata-guided fuzz driver, which provides scheduling interface for the fuzzer to test independent sets of API usage during fuzzing. During the experiments, the fuzz drivers generated by RUBICK showed a significant performance advantage over the baselines by covering an average of 50.42% more edges than fuzz drivers generated by FUZZGEN and 44.58% more edges than manually written fuzz drivers from OSS-Fuzz or human experts. By learning from large-scale open source projects, RUBICK has generated fuzz drivers for 11 popular Java projects and two of them have been merged into OSS-Fuzz. So far, 199 bugs, including four CVEs, are found using these fuzz drivers, which can affect popular PC and Android software with dozens of millions of downloads.",
    "author": "Authors:Cen Zhang and Yuekang Li,Nanyang Technological University, Continental-NTU Corporate Lab;Hao Zhou,The Hong Kong Polytechnic University;Xiaohan Zhang,Xidian University;Yaowen Zheng,Nanyang Technological University, Continental-NTU Corporate Lab;Xian Zhan,Southern University of Science and Technology; The Hong Kong Polytechnic University;Xiaofei Xie,Singapore Management University;Xiapu Luo,The Hong Kong Polytechnic University;Xinghua Li,Xidian University;Yang Liu,Nanyang Technological University, Continental-NTU Corporate Lab;Sheikh Mahbub Habib,Continental AG, Germany",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/zhang-cen",
    "comment": ""
  },
  {
    "title": "Are Consumers Willing to Pay for Security and Privacy of IoT Devices?",
    "abstract": "Abstract:Internet of Things (IoT) device manufacturers provide little information to consumers about their security and data handling practices. Therefore, IoT consumers cannot make informed purchase choices around security and privacy. While prior research has found that consumers would likely consider security and privacy when purchasing IoT devices, past work lacks empirical evidence as to whether they would actually pay more to purchase devices with enhanced security and privacy. To fill this gap, we conducted a two-phase incentive-compatible online study with 180 Prolific participants. We measured the impact of five security and privacy factors (e.g., access control) on participants' purchase behaviors when presented individually or together on an IoT label. Participants were willing to pay a significant premium for devices with better security and privacy practices. The biggest price differential we found was for de-identified rather than identifiable cloud storage. Mainly due to its usability challenges, the least valuable improvement for participants was to have multi-factor authentication as opposed to passwords. Based on our findings, we provide recommendations on creating more effective IoT security and privacy labeling programs.",
    "author": "Authors:Pardis Emami-Naeini,Duke University;Janarth Dheenadhayalan, Yuvraj Agarwal, and Lorrie Faith Cranor,Carnegie Mellon University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/emami-naeini",
    "comment": ""
  },
  {
    "title": "PhyAuth: Physical-Layer Message Authentication for ZigBee Networks",
    "abstract": "Abstract:ZigBee is a popular wireless communication standard for Internet of Things (IoT) networks. Since each ZigBee network uses hop-by-hop network-layer message authentication based on a common network key, it is highly vulnerable to packet-injection attacks, in which the adversary exploits the compromised network key to inject arbitrary fake packets from any spoofed address to disrupt network operations and consume the network/device resources. In this paper, we present PhyAuth, a PHY hop-by-hop message authentication framework to defend against packet-injection attacks in ZigBee networks. The key idea of PhyAuth is to let each ZigBee transmitter embed into its PHY signals a PHY one-time password (called POTP) derived from a device-specific secret key and an efficient cryptographic hash function. An authentic POTP serves as the transmitter's PHY transmission permission for the corresponding packet. PhyAuth provides three schemes to embed, detect, and verify POTPs based on different features of ZigBee PHY signals. In addition, PhyAuth involves lightweight PHY signal processing and no change to the ZigBee protocol stack. Comprehensive USRP experiments confirm that PhyAuth can efficiently detect fake packets with very low false-positive and false-negative rates while having a negligible negative impact on normal data transmissions.",
    "author": "Authors:Ang Li and Jiawei Li,Arizona State University;Dianqi Han,University of Texas at Arlington;Yan Zhang,The University of Akron;Tao Li,Indiana University–Purdue University Indianapolis;Ting Zhu,The Ohio State University;Yanchao Zhang,Arizona State University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/li-ang",
    "comment": ""
  },
  {
    "title": "Fairness Properties of Face Recognition and Obfuscation Systems",
    "abstract": "Abstract:The proliferation of automated face recognition in the commercial and government sectors has caused significant privacy concerns for individuals. One approach to address these privacy concerns is to employ evasion attacks against the metric embedding networks powering face recognition systems: Face obfuscation systems generate imperceptibly perturbed images that cause face recognition systems to misidentify the user. Perturbed faces are generated on metric embedding networks, which are known to be unfair in the context of face recognition. A question of demographic fairness naturally follows: are there demographic disparities in face obfuscation system performance? We answer this question with an analytical and empirical exploration of recent face obfuscation systems. Metric embedding networks are found to be demographically aware: face embeddings are clustered by demographic. We show how this clustering behavior leads to reduced face obfuscation utility for faces in minority groups. An intuitive analytical model yields insight into these phenomena.",
    "author": "Authors:Harrison Rosenberg,University of Wisconsin–Madison;Brian Tang,University of Michigan;Kassem Fawaz and Somesh Jha,University of Wisconsin–Madison",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/rosenberg",
    "comment": ""
  },
  {
    "title": "Beyond The Gates: An Empirical Analysis of HTTP-Managed Password Stealers and Operators",
    "abstract": "Abstract:Password Stealers (Stealers) are commodity malware that specialize in credential theft. This work presents a large-scale longitudinal study of Stealers and their operators. Using a commercial dataset, we characterize the activity of over 4, 586 distinct Stealer operators through their devices spanning 10\ndifferent Stealer families. Operators make heavy use of proxies, including traditional VPNs, residential proxies, mobile proxies, and the Tor network when managing their botnet. Our affiliation analysis unveils a stratified enterprise of cybercriminals for each service offering and we identify privileged operators using graph analysis. We find several Stealer-as-a-Service providers that lower the economical and technical barrier for many cybercriminals. We estimate that service providers benefit from high-profit margins (up to 98%) and a lower-bound profit estimate of $11, 000 per month. We find high-profile targeting like the Social Security Administration, the U.S. House of Representatives, and the U.S. Senate. We share our findings with law enforcement and publish six months of the dataset, analysis artifact, and code.",
    "author": "Authors:Athanasios Avgetidis, Omar Alrawi, Kevin Valakuzhy, and Charles Lever,Georgia Institute of Technology;Paul Burbage,MalBeacon;Angelos D. Keromytis, Fabian Monrose, and Manos Antonakakis,Georgia Institute of Technology",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/avgetidis",
    "comment": ""
  },
  {
    "title": "Decompiling x86 Deep Neural Network Executables",
    "abstract": "Abstract:Due to their widespread use on heterogeneous hardware devices, deep learning (DL) models are compiled into executables by DL compilers to fully leverage low-level hardware primitives. This approach allows DL computations to be undertaken at low cost across a variety of computing platforms, including CPUs, GPUs, and various hardware accelerators.We present BTD (Bin to DNN), a decompiler for deep neural network (DNN) executables. BTD takes DNN executables and outputs full model specifications, including types of DNN operators, network topology, dimensions, and parameters that are (nearly) identical to those of the input models. BTD delivers a practical framework to process DNN executables compiled by different DL compilers and with full optimizations enabled on x86 platforms. It employs learning-based techniques to infer DNN operators, dynamic analysis to reveal network architectures, and symbolic execution to facilitate inferring dimensions and parameters of DNN operators.Our evaluation reveals that BTD enables accurate recovery of full specifications of complex DNNs with millions of parameters (e.g., ResNet). The recovered DNN specifications can be re-compiled into a new DNN executable exhibiting identical behavior to the input executable. We show that BTD can boost two representative attacks, adversarial example generation and knowledge stealing, against DNN executables. We also demonstrate cross-architecture legacy code reuse using BTD, and envision BTD being used for other critical downstream tasks like DNN security hardening and patching.",
    "author": "Authors:Zhibo Liu, Yuanyuan Yuan, and Shuai Wang,The Hong Kong University of Science and Technology;Xiaofei Xie,Singapore Management University;Lei Ma,University of Alberta",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/liu-zhibo",
    "comment": ""
  },
  {
    "title": "PolyFuzz: Holistic Greybox Fuzzing of Multi-Language Systems",
    "abstract": "Abstract:While offering many advantages during software process, the practice of using multiple programming languages in constructing one software system also introduces additional security vulnerabilities in the resulting code. As this practice becomes increasingly prevalent, securing multi-language systems is of pressing criticality. Fuzzing has been a powerful security testing technique, yet existing fuzzers are commonly limited to single-language software. In this paper, we present PolyFuzz, a greybox fuzzer that holistically fuzzes a given multi-language system through cross-language coverage feedback and explicit modeling of the semantic relationships between (various segments of) program inputs and branch predicates across languages. PolyFuzz is extensible for supporting multilingual code written in different language combinations and has been implemented for C, Python, Java, and their combinations. We evaluated PolyFuzz versus state-of-the-art single-language fuzzers for these languages as baselines against 15 real-world multi-language systems and 15 single-language benchmarks. PolyFuzz achieved 25.3–52.3% higher code coverage and found 1–10 more bugs than the baselines against the multilingual programs, and even 10-20% higher coverage against the single-language benchmarks. In total, PolyFuzz has enabled the discovery of 12 previously unknown multilingual vulnerabilities and 2 single-language ones, with 5 CVEs assigned. Our results show great promises of PolyFuzz for cross-language fuzzing, while justifying the strong need for holistic fuzzing against trivially applying single-language fuzzers to multi-language software.",
    "author": "Authors:Wen Li, Jinyang Ruan, and Guangbei Yi,Washington State University;Long Cheng,Clemson University;Xiapu Luo,The Hong Kong Polytechnic University;Haipeng Cai,Washington State University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/li-wen",
    "comment": ""
  },
  {
    "title": "Linear Private Set Union from Multi-Query Reverse Private Membership Test",
    "abstract": "Abstract:Private set union (PSU) protocol enables two parties, each holding a set, to compute the union of their sets without revealing anything else to either party. So far, there are two known approaches for constructing PSU protocols. The first mainly depends on additively homomorphic encryption (AHE), which is generally inefficient since it needs to perform a non-constant number of homomorphic computations on each item. The second is mainly based on oblivious transfer and symmetric-key operations, which is recently proposed by Kolesnikov et al. (ASIACRYPT 2019). It features good practical performance, which is several orders of magnitude faster than the first one. However, neither of these two approaches is optimal in the sense that their computation and communication complexity are not bothO(n), wherenis the size of the set. Therefore, the problem of constructing the optimal PSU protocol remains open.In this work, we resolve this open problem by proposing a generic framework of PSU from oblivious transfer and a newly introduced protocol called multi-query reverse private membership test (mq-RPMT). We present two generic constructions of mq-RPMT. The first is based on symmetric-key encryption and general 2PC techniques. The second is based on re-randomizable public-key encryption. Both constructions lead to PSU with linear computation and communication complexity.We implement our two PSU protocols and compare them with the state-of-the-art PSU. Experiments show that our PKE-based protocol has the lowest communication of all schemes, which is 3.7-14.8× lower depending on set size. The running time of our PSU scheme is 1.2-12× faster than that of state-of-the-art depending on network environments.",
    "author": "Authors:Cong Zhang,State Key Laboratory of Information Security, Institute of Information Engineering, Chinese Academy of Sciences; School of Cyber Security, University of Chinese Academy of Sciences;Yu Chen,School of Cyber Science and Technology, Shandong University; State Key Laboratory of Cryptology; Key Laboratory of Cryptologic Technology and Information Security, Ministry of Education, Shandong University;Weiran Liu,Alibaba Group;Min Zhang,School of Cyber Science and Technology, Shandong University; State Key Laboratory of Cryptology; Key Laboratory of Cryptologic Technology and Information Security, Ministry of Education, Shandong University;Dongdai Lin,State Key Laboratory of Information Security, Institute of Information Engineering, Chinese Academy of Sciences; School of Cyber Security, University of Chinese Academy of Sciences",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/zhang-cong",
    "comment": ""
  },
  {
    "title": "An Efficient Design of Intelligent Network Data Plane",
    "abstract": "Abstract:Deploying machine learning models directly on the network data plane enables intelligent traffic analysis at line-speed using data-driven models rather than predefined protocols. Such a capability, referred to as Intelligent Data Plane (IDP), may potentially transform a wide range of networking designs. The emerging programmable switches provide crucial hardware support to realize IDP. Prior art in this regard is divided into two major categories: (i) focusing on extract useful flow information from the data plane, while placing the learning-based traffic analysis on the control plane; and (ii) taking a step further to embed learning models into the data plane, while failing to use flow-level features that are critical to achieve high learning accuracies. In this paper, we propose NetBeacon to advance the state-of-the-art in both model accuracy and model deployment efficiency. In particular, NetBeacon proposes a multi-phase sequential model architecture to perform dynamic packet analysis at different phases of a flow as it proceeds, by incorporating flow-level features that are computable at line-speed to boost learning accuracies. Further, NetBeacon designs efficient model representation mechanisms to address the table entry explosion problem when deploying tree-based models on the network data plane. Finally, NetBeacon hardens its scalability for handling concurrent flows via multiple tightly-coupled designs for managing stateful storage used to store per-flow state. We implement a prototype of NetBeacon and extensively evaluate its performance over multiple traffic analysis tasks.",
    "author": "Authors:Guangmeng Zhou,Tsinghua University;Zhuotao Liu,Tsinghua University and Zhongguancun Laboratory;Chuanpu Fu,Tsinghua University;Qi Li and Ke Xu,Tsinghua University and Zhongguancun LaboratoryDistinguished Paper Award Winner",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/zhou-guangmeng",
    "comment": ""
  },
  {
    "title": "AIFORE: Smart Fuzzing Based on Automatic Input Format Reverse Engineering",
    "abstract": "Abstract:Knowledge of a program’s input format is essential for effective input generation in fuzzing. Automated input format reverse engineering represents an attractive but challenging approach to learning the format. In this paper, we address several challenges of automated input format reverse engineering, and present a smart fuzzing solution AIFORE which makes full use of the reversed format and benefits from it. The structures and semantics of input fields are determined by the basic blocks (BBs) that process them rather than the input specification. Therefore, we first utilize byte-level taint analysis to recognize the input bytes processed by each BB, then identify indivisible input fields that are always processed together with a minimum cluster algorithm, and learn their types with a neural network model that characterizes the behavior of BBs. Lastly, we design a new power scheduling algorithm based on the inferred format knowledge to guide smart fuzzing. We implement a prototype of AIFORE and evaluate both the accuracy of format inference and the performance of fuzzing against state-of-the-art (SOTA) format reversing solutions and fuzzers. AIFORE significantly outperforms SOTA baselines on the accuracy of field boundary and type recognition. With AIFORE, we uncovered 20 bugs in 15 programs that were missed by other fuzzers.",
    "author": "Authors:Ji Shi,{CAS-KLONAT, BKLONSPT}, Institute of Information Engineering, Chinese Academy of Sciences; Institute for Network Science and Cyberspace & BNRist, Tsinghua University; Zhongguancun Lab; Singular Security Lab, Huawei Technologies; School of Cyber Security, University of Chinese Academy of Sciences;Zhun Wang,Institute for Network Science and Cyberspace & BNRist, Tsinghua University; Zhongguancun Lab;Zhiyao Feng,Institute for Network Science and Cyberspace & BNRist, Tsinghua University; Zhongguancun Lab; EPFL;Yang Lan and Shisong Qin,Institute for Network Science and Cyberspace & BNRist, Tsinghua University; Zhongguancun Lab;Wei You,Renmin University of China;Wei Zou,{CAS-KLONAT, BKLONSPT}, Institute of Information Engineering, Chinese Academy of Sciences; School of Cyber Security, University of Chinese Academy of Sciences;Mathias Payer,EPFL;Chao Zhang,Institute for Network Science and Cyberspace & BNRist, Tsinghua University; Zhongguancun Lab",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/shi-ji",
    "comment": ""
  },
  {
    "title": "Inducing Authentication Failures to Bypass Credit Card PINs",
    "abstract": "Abstract:For credit card transactions using the EMV standard, the integrity of transaction information is protected cryptographically by the credit card. Integrity checks by the payment terminal use RSA signatures and are part of EMV’s offline data authentication mechanism. Online integrity checks by the card issuer use a keyed MAC. One would expect that failures in either mechanism would always result in transaction failure, but this is not the case as offline authentication failures do not always result in declined transactions. Consequently, the integrity of transaction data that is not protected by the keyed MAC (online) cannot be guaranteed.We show how this missing integrity protection can be exploited to bypass PIN verification for high-value Mastercard transactions. As a proof-of-concept, we have built an Android app that modifies unprotected card-sourced data, including the data relevant for cardholder verification. Using our app, we have tricked real-world terminals into downgrading from PIN verification to either no cardholder verification or (paper) signature verification, for transactions of up to 500 Swiss Francs. Our findings have been disclosed to the vendor with the recommendation to decline any transaction where offline data authentication fails.",
    "author": "Authors:David Basin, Patrick Schaller, and Jorge Toro-Pozo,ETH Zurich",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/basin",
    "comment": ""
  },
  {
    "title": "Silent Spring: Prototype Pollution Leads to Remote Code Execution in Node.js",
    "abstract": "Abstract:Prototype pollution is a dangerous  vulnerability affecting prototype-based languages like JavaScript and the Node.js platform. It refers to the ability of an attacker to inject properties into an object's root prototype at runtime and subsequently trigger the execution of legitimate code gadgets that access these properties on the object's prototype, leading to attacks such as Denial of Service (DoS), privilege escalation, and Remote Code Execution (RCE). While there is anecdotal evidence that prototype pollution leads to RCE, current research does not tackle the challenge of gadget detection, thus only showing feasibility of DoS attacks, mainly against Node.js libraries.In this paper, we set out to study the problem in a holistic way, from the detection of prototype pollution to detection of gadgets, with the ambitious goal of finding end-to-end exploits beyond DoS, in full-fledged Node.js applications. We build the first multi-staged framework that usesmulti-labelstatic taint analysis to identify prototype pollution in Node.js libraries and applications,  as well as a hybrid approach to detectuniversal gadgets, notably, by analyzing the Node.js source code.  We implement our framework on top of GitHub's static analysis framework CodeQL to find 11 universal gadgets in core Node.js APIs, leading to code execution. Furthermore, we use our methodology in a study of 15 popular Node.js applications to identify prototype pollutions and gadgets. We manually exploit eight RCE vulnerabilities in three high-profile applications such as NPM CLI, Parse Server, and Rocket.Chat. Our results provide alarming evidence that prototype pollution in combination with powerful universal gadgets lead to RCE in Node.js.",
    "author": "Authors:Mikhail Shcherbakov and Musard Balliu,KTH Royal Institute of Technology;Cristian-Alexandru Staicu,CISPA Helmholtz Center for Information Security",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/shcherbakov",
    "comment": ""
  },
  {
    "title": "Reassembly is Hard: A Reflection on Challenges and Strategies",
    "abstract": "Abstract:Reassembly, a branch of static binary rewriting, has become a focus of research today. However, despite its widespread use and research interest, there have been no systematic investigations on the techniques and challenges of reassemblers. In this paper, we formally define different types of errors that occur in current existing reassemblers, and present an automated tool named REASSESSOR to find such errors. We attempt to show through our tool and the large-scale benchmark we created the current challenges in the field and how they can be approached.",
    "author": "Authors:Hyungseok Kim,KAIST and The Affiliated Institute of ETRI;Soomin Kim and Junoh Lee,KAIST;Kangkook Jee,University of Texas at Dallas;Sang Kil Cha,KAIST",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/kim-hyungseok",
    "comment": ""
  },
  {
    "title": "PCAT: Functionality and Data Stealing from Split Learning by Pseudo-Client Attack",
    "abstract": "Abstract:Split learning (SL) is a popular framework to protect a client's training data by splitting up a model among the client and the server. Previous efforts have shown that a semi-honest server can conduct a model inversion attack to recover the client's inputs and model parameters to some extent, as well as to infer the labels. However, those attacks require the knowledge of the client network structure and the performance deteriorates dramatically as the client network gets deeper (≥ 2 layers). In this work, we explore the attack on SL in a more general and challenging situation where the client model is a unknown to the server and gets more complex and deeper. Different from the conventional model inversion, we investigate the inherent privacy leakage through the server model in SL and reveal that clients' functionality and private data can be easily stolen by the server model, and a series of intermediate server models during SL can even cause more leakage. Based on the insights, we propose a new attack on SL:Pseudo-ClientATtack (PCAT). To the best of our knowledge, this is the first attack for a semi-honest server to steal clients' functionality, reconstruct private inputs and infer private labels without any knowledge about the clients' model. The only requirement for the server is a tiny dataset (about 0.1% - 5% of the private training set) for the same learning task. What's more, the attack is transparent to clients, so a server can obtain clients' privacy without taking any risk of being detected by the client. We implement PCAT on various benchmark datasets and models. Extensive experiments testify that our attack significantly outperforms the state-of-the-art attack in various conditions, including more complex models and learning tasks, even in non-i.i.d. conditions. Moreover, our functionality stealing attack is resilient to the existing defensive mechanism.",
    "author": "Authors:Xinben Gao and Lan Zhang,University of Science and Technology of China",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/gao",
    "comment": ""
  },
  {
    "title": "VulChecker: Graph-based Vulnerability Localization in Source Code",
    "abstract": "Abstract:In software development, it is critical to detect vulnerabilities in a project as early as possible. Although, deep learning has shown promise in this task, current state-of-the-art methods cannot classify and identify the line on which the vulnerability occurs. Instead, the developer is tasked with searching for an arbitrary bug in an entire function or even larger region of code.In this paper, we propose VulChecker: a tool that can precisely locate vulnerabilities in source code (down to the exact instruction) as well as classify their type (CWE). To accomplish this, we propose a new program representation, program slicing strategy, and the use of a message-passing graph neural network to utilize all of code's semantics and improve the reach between a vulnerability's root cause and manifestation points.We also propose a novel data augmentation strategy for cheaply creating strong datasets for vulnerability detection in the wild, using free synthetic samples available online. With this training strategy, VulChecker was able to identify 24 CVEs (10 from 2019 & 2020) in 19 projects taken from the wild, with nearly zero false positives compared to a commercial tool that could only detect 4. VulChecker also discovered an exploitable zero-day vulnerability, which has been reported to developers for responsible disclosure.",
    "author": "Authors:Yisroel Mirsky,Ben-Gurion University of the Negev;George Macon,Georgia Tech Research Institute;Michael Brown,Georgia Institute of Technology;Carter Yagemann,Ohio State University;Matthew Pruett, Evan Downing, Sukarno Mertoguno, and Wenke Lee,Georgia Institute of Technology",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/mirsky",
    "comment": ""
  },
  {
    "title": "Examining Consumer Reviews to Understand Security and Privacy Issues in the Market of Smart Home Devices",
    "abstract": "Abstract:Despite growing evidence that consumers care about secure Internet-of-Things (IoT) devices, relevant security and privacy-related information is unavailable at the point of purchase. While initiatives such as security labels create new avenues to signal a device's security and privacy posture, we analyse an existing avenue for such market signals - customer reviews. We investigate whether and to what extent customer reviews of IoT devices with well-known security and privacy issues reflect these concerns. We examine 83,686 reviews of four IoT device types commonly infected with Mirai across all Amazon websites in English. We perform topic modelling to group the reviews and conduct manual coding to understand (i) the prevalence of security and privacy issues and (ii) the themes that these issues articulate. Overall, around one in ten reviews (9.8%) mentions security and privacy issues; the geographical distribution varies across the six countries. We distil references to security and privacy into seven themes and identify two orthogonal themes: reviews written in technical language and those that mention friction with security steps. Our results thus highlight the value of the already existing avenue of customer reviews. We draw on these results to make recommendations and identify future research directions.",
    "author": "Authors:Swaathi Vetrivel, Veerle van Harten, Carlos H. Gañán, Michel van Eeten, and Simon Parkin,Delft University of Technology",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/vetrivel",
    "comment": ""
  },
  {
    "title": "Timeless Timing Attacks and Preload Defenses in Tor's DNS Cache",
    "abstract": "Abstract:We show that Tor's DNS cache is vulnerable to a timeless timing attack, allowing anyone to determine if a domain is cached or not without any false positives. The attack requires sending a single TLS record. It can be repeated to determine when a domain is no longer cached to leak the insertion time. Our evaluation in the Tor network shows no instances of cached domains being reported as uncached and vice versa after 12M repetitions while only targeting our own domains. This shifts DNS in Tor from an unreliable side-channel—using traditional timing attacks with network jitter—to being perfectly reliable. We responsibly disclosed the attack and suggested two short-term mitigations.As a long-term defense for the DNS cache in Tor against all types of (timeless) timing attacks, we propose a redesign where only an allowlist of domains is preloaded to always be cached across circuits. We compare the performance of a preloaded DNS cache to Tor's current solution towards DNS by measuring aggregated statistics for four months from two exits (after engaging with the Tor Research Safety Board and our university ethical review process). The evaluated preload lists are variants of the following top-lists: Alexa, Cisco Umbrella, and Tranco. Our results show that four-months-old preload lists can be tuned to offer comparable performance under similar resource usage or to significantly improve shared cache-hit ratios (2–3x) with a modest increase in memory usage and resolver load compared to a 100 Mbit/s exit. We conclude that Tor's current DNS cache is mostly a privacy harm because the majority of cached domains are unlikely to lead to cache hits but remain there to be probed by attackers.",
    "author": "Authors:Rasmus Dahlberg and Tobias Pulls,Karlstad University",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/dahlberg",
    "comment": ""
  },
  {
    "title": "Isolated and Exhausted: Attacking Operating Systems via Site Isolation in the Browser",
    "abstract": "Abstract:Site Isolation is a security architecture for browsers to protect against side-channel and renderer exploits by separating content from different sites at the operating system (OS) process level. By aligning web and OS security boundaries, Site Isolation promises to defend against these attack classes systematically in a streamlined architecture. However, Site Isolation is a large-scale architectural change that also makes OS resources more accessible to web attackers, and thus exposes web users to new risks at the OS level. In this paper, we present the first systematic study of OS resource exhaustion attacks based on Site Isolation, in the web attacker model, in three steps: (1) first-level resources directly accessible with Site Isolation; (2) second-level resources whose direct use is protected by the browser sandbox; (3) an advanced, real-world attack. For (1) we show how to create a fork bomb, highlighting conceptual gaps in the Site Isolation architecture. For (2) we show how to block all UDP sockets in an OS, using a variety of advanced browser features. For (3), we implement a fully working DNS Cache Poisoning attack based on Site Isolation, building on (2) and bypassing a major security feature of DNS. Our results show that the interplay between modern browser features and older OS features is increasingly problematic and needs further research.",
    "author": "Authors:Matthias Gierlings, Marcus Brinkmann, and Jörg Schwenk,Ruhr University Bochum",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/gierlings",
    "comment": ""
  },
  {
    "title": "Internet Service Providers' and Individuals' Attitudes, Barriers, and Incentives to Secure IoT",
    "abstract": "Abstract:Internet Service Providers (ISPs) and individual users of Internet of Things (IoT) play a vital role in securing IoT. However, encouraging them to do so is hard. Our study investigates ISPs' and individuals' attitudes towards the security of IoT, the obstacles they face, and their incentives to keep IoT secure, drawing evidence from Japan.Due to the complex interactions of the stakeholders, we follow an iterative methodology where we present issues and potential solutions to our stakeholders in turn.  For ISPs, we survey 27 ISPs in Japan, followed by a workshop with representatives from government and 5 ISPs. Based on the findings from this, we conduct semi-structured interviews with 20 participants followed by a more quantitative survey with 328 participants. We review these results in a second workshop with representatives from government and 7 ISPs. The appreciation of challenges by each party has lead to findings that are supported by all stakeholders.Securing IoT devices is neither users' nor ISPs' priority. Individuals are keen on more interventions both from the government as part of regulation and from ISPs in terms of filtering malicious traffic. Participants are willing to pay for enhanced monitoring and filtering. While ISPs do want to help users, there appears to be a lack of effective technology to aid them. ISPs would like to see more public recognition for their efforts, but internally they struggle with executive buy-in and effective means to communicate with their customers. The majority of barriers and incentives are external to ISPs and individuals, demonstrating the complexity of keeping IoT secure and emphasizing the need for relevant stakeholders in the IoT ecosystem to work in tandem.",
    "author": "Authors:Nissy Sombatruang,National Institute of Information and Communications Technology;Tristan Caulfield and Ingolf Becker,University College London;Akira Fujita, Takahiro Kasama, Koji Nakao, and Daisuke Inoue,National Institute of Information and Communications Technology",
    "year": "2023",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity23/presentation/sombatruang",
    "comment": ""
  }
]