[
  {
    "title": "CACTI: Captcha Avoidance via Client-side TEE Integration",
    "abstract": "Abstract:Preventing abuse of web services by bots is an increasingly important problem, as abusive activities grow in both volume and variety. CAPTCHAs are the most common way for thwarting bot activities. However, they are often ineffective against bots and frustrating for humans. In addition, some recent CAPTCHA techniques diminish user privacy. Meanwhile, client-side Trusted Execution Environments (TEEs) are becoming increasingly widespread (notably, ARM TrustZone and Intel SGX), allowing establishment of trust in a small part (trust anchor or TCB) of client-side hardware. This prompts the question: can a TEE help reduce (or remove entirely) user burden of solving CAPTCHAs?In this paper, we design CACTI: CAPTCHA Avoidance via Client-side TEE Integration. Using client-side TEEs, CACTI allows legitimate clients to generate unforgeable rate-proofs demonstrating how frequently they have performed specific actions. These rate-proofs can be sent to web servers in lieu of solving CAPTCHAs. CACTI provides strong client privacy guarantees, since the information is only sent to the visited website and authenticated using a group signature scheme. Our evaluations show that overall latency of generating and verifying a CACTI rate-proof is less than 0.25 sec, while CACTI's bandwidth overhead is over 98% lower than that of current CAPTCHA systems.",
    "author": "Authors:Yoshimichi Nakatsuka and Ercan Ozturk,University of California, Irvine;Andrew Paverd,Microsoft Research;Gene Tsudik,University of California, Irvine",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/nakatsuka",
    "comment": ""
  },
  {
    "title": "Obfuscation-Resilient Executable Payload Extraction From Packed Malware",
    "abstract": "Abstract:Over the past two decades, packed malware is always a veritable challenge to security analysts. Not only is determining the end of the unpacking increasingly difficult, but also advanced packers embed a variety of anti-analysis tricks to impede reverse engineering. As malware's APIs provide rich information about malicious behavior, one common anti-analysis strategy is API obfuscation, which removes the metadata of imported APIs from malware's PE header and complicates API name resolution from API callsites. In this way, even when security analysts obtain the unpacked code, a disassembler still fails to recognize imported API names, and the unpacked code cannot be successfully executed. Recently, generic binary unpacking has made breakthrough progress with noticeable performance improvement. However, reconstructing unpacked code's import tables, which is vital for further malware static/dynamic analyses, has largely been overlooked. Existing approaches are far from mature: they either can be easily evaded by various API obfuscation schemes (e.g., stolen code), or suffer from incomplete API coverage.In this paper, we aim to achieve the ultimate goal of Windows malware unpacking: recovering an executable malware program from the packed and obfuscated binary code. Based on the process memory when the original entry point (OEP) is reached, we develop a hardware-assisted tool,API-Xray, to reconstruct import tables. Import table reconstruction is challenging enough in its own right. Our core technique,API Micro Execution, explores all possible API callsites and executes them without knowing API argument values. At the same time, we take advantage of hardware tracing via Intel Branch Trace Store and NX bit to resolve API names and finally rebuild import tables. Compared with the previous work, API-Xray has a better resistance against various API obfuscation schemes and more coverage on resolved Windows API names. Since July 2019, we have tested API-Xray in practice to assist security professionals in malware analysis: we have successfully rebuilt 155,811 executable malware programs and substantially improved the detection rate for 7,514 unknown or new malware variants.",
    "author": "Authors:Binlin Cheng,Hubei Normal University & Wuhan University;Jiang Ming, Erika A Leal, and Haotian Zhang,The University of Texas at Arlington;Jianming Fu and Guojun Peng,Wuhan University;Jean-Yves Marion,Université de Lorraine, CNRS, LORIA",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/cheng-binlin",
    "comment": ""
  },
  {
    "title": "Effect of Mood, Location, Trust, and Presence of Others on Video-Based Social Authentication",
    "abstract": "Abstract:Current fallback authentication mechanisms are unreliable (e.g., security questions are easy to guess) and need improvement. Social authentication shows promise as a novel form of fallback authentication. In this paper, we report the results of a four-week study that explored people's perceived willingness to use video chat as a form of social authentication. We investigated whether people's mood, location, and trust, and the presence of others affected perceived willingness to use video chat to authenticate. We found that participants who were alone, reported a more positive mood, and had more trust in others reported more willingness to use video chat as an authentication method. Participants also reported more willingness to help others to authenticate via video chat than to initiate a video chat authentication session themselves. Our results provide initial insights into human-computer interaction issues that could stem from using video chat as a fallback authentication method within a small social network of people (e.g., family members and close friends) who know each other well and trust each other.",
    "author": "Authors:Cheng Guo and Brianne Campbell,Clemson University;Apu Kapadia,Indiana University;Michael K. Reiter,Duke University;Kelly Caine,Clemson University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/guo",
    "comment": ""
  },
  {
    "title": "Abusing Hidden Properties to Attack the Node.js Ecosystem",
    "abstract": "Abstract:Nowadays, Node.js has been widely used in the development of server-side and desktop programs (e.g., Skype), with its cross-platform and high-performance execution environment of JavaScript. In past years, it has been reported other dynamic programming languages (e.g., PHP and Ruby) are unsafe on sharing objects. However, this security risk is not well studied and understood in JavaScript and Node.js programs.In this paper, we fill the gap by conducting the first systematic study on the communication process between client- and server-side code in Node.js programs. We extensively identify several new vulnerabilities in popular Node.js programs. To demonstrate their security implications, we design and develop a novel feasible attack, named hidden property abusing (HPA). Our further analysis shows HPA attacks are subtly different from existing findings regarding exploitation and attack effects. Through HPA attacks, a remote web attacker may obtain dangerous abilities, such as stealing confidential data, bypassing security checks, and launching DoS (Denial of Service) attacks.To help Node.js developers vet their programs against HPA, we design a novel vulnerability detection and verification tool, named Lynx, that utilizes hybrid program analysis to automatically reveal HPA vulnerabilities and even synthesize exploits. We apply Lynx on a set of widely-used Node.js programs and identify 15 previously unknown vulnerabilities. We have reported all of our findings to the Node.js community. 10 of them have been assigned with CVE, and 8 of them are rated as \"Critical'\" or \"High\" severity. This indicates HPA attacks can cause serious security threats.",
    "author": "Authors:Feng Xiao,Georgia Tech;Jianwei Huang,Texas A&M University;Yichang Xiong,Independent Researcher;Guangliang Yang,Georgia Tech;Hong Hu,Penn State University;Guofei Gu,Texas A&M University;Wenke Lee,Georgia Tech",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/xiao",
    "comment": ""
  },
  {
    "title": "Formally Verified Memory Protection for a Commodity Multiprocessor Hypervisor",
    "abstract": "Abstract:Hypervisors are widely deployed by cloud computing providers to support virtual machines, but their growing complexity poses a security risk, as large codebases contain many vulnerabilities. We present SeKVM, a layered Linux KVM hypervisor architecture that has been formally verified on multiprocessor hardware. Using layers, we isolate KVM's trusted computing base into a small core such that only the core needs to be verified to ensure KVM's security guarantees. Using layers, we model hardware features at different levels of abstraction tailored to each layer of software. Lower hypervisor layers that configure and control hardware are verified using a novel machine model that includes multiprocessor memory management hardware such as multi-level shared page tables, tagged TLBs, and a coherent cache hierarchy with cache bypass support. Higher hypervisor layers that build on the lower layers are then verified using a more abstract and simplified model, taking advantage of layer encapsulation to reduce proof burden. Furthermore, layers provide modularity to reduce verification effort across multiple implementation versions. We have retrofitted and verified multiple versions of KVM on Arm multiprocessor hardware, proving the correctness of the implementations and that they contain no vulnerabilities that can affect KVM's security guarantees. Our work is the first machine-checked proof for a commodity hypervisor using multiprocessor memory management hardware. SeKVM requires only modest KVM modifications and incurs only modest performance overhead versus unmodified KVM on real application workloads.",
    "author": "Authors:Shih-Wei Li, Xupeng Li, Ronghui Gu, Jason Nieh, and John Zhuang Hui,Columbia University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/li-shih-wei",
    "comment": ""
  },
  {
    "title": "'Passwords Keep Me Safe' – Understanding What Children Think about Passwords",
    "abstract": "Abstract:Children use technology from a very young age, and often have to authenticate. The goal of this study is to explore children's practices, perceptions, and knowledge regarding passwords. Given the limited work to date and the fact  that the world's cyber posture and culture will be dependent on today's youth, it is imperative to conduct cybersecurity research with children. We conducted the first large-scale survey of 1,505 3rd to 12th graders from schools across the United States. Not surprisingly, children have fewer passwords than adults. We found that children have complicated relationships with passwords: on one hand, their perceptions about passwords and statements about password behavior are appropriate; on the other hand, however, they simultaneously do not tend to make strong passwords, and practice bad password behavior such as sharing passwords with friends. We conclude with a call for cybersecurity education to bridge the gap between students' password knowledge with their password behavior, while continuing to provide and promote security understandings.",
    "author": "Authors:Mary Theofanos and Yee-Yin Choong,National Institute of Standards and Technology;Olivia Murphy,University of Maryland, College Park",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/theofanos",
    "comment": ""
  },
  {
    "title": "Domain Shadowing: Leveraging Content Delivery Networks for Robust Blocking-Resistant Communications",
    "abstract": "Abstract:We debutdomain shadowing, a novel censorship evasion technique leveraging content delivery networks (CDNs). Domain shadowing exploits the fact that CDNs allow their customers to claim arbitrary domains as the back-end. By setting the frond-end of a CDN service as an allowed domain and the back-end a blocked one, a censored user can access resources of the blocked domain with all \"indicators\", including the connecting URL, the SNI of the TLS connection, and the Host header of the HTTP(S) request, appear to belong to the allowed domain. Furthermore, we demonstrate that domain shadowing can be proliferated bydomain fronting, a censorship evasion technique popularly used a few years ago, making it even more difficult to block. Compared with existing censorship evasion solutions, domain shadowing is lightweight, incurs negligible overhead, and does not require dedicated third-party support. As a proof of concept, we implemented domain shadowing as a Firefox browser extension and presented its capability in circumventing censorship within a heavily censored country known by its strict censorship policies and advanced technologies.",
    "author": "Authors:Mingkui Wei,George Mason University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/wei",
    "comment": ""
  },
  {
    "title": "Automatic Policy Generation for Inter-Service Access Control of Microservices",
    "abstract": "Abstract:Cloud applications today are often composed of many microservices. To prevent a microservice from being abused by other (compromised) microservices, inter-service access control is applied. However, the complexity of ﬁne-grained access control policies, along with the large-scale and dynamic nature of microservices, makes the current manual conﬁguration-based access control unsuitable. This paper presents AUTOARMOR, the ﬁrst attempt to automate inter-service access control policy generation for microservices, with two fundamental techniques: (1) a static analysis-based request extraction mechanism that automatically obtains the invocation logic among microservices, and (2) a graph-based policy management mechanism that generates corresponding access control policies with on-demand policy update. Our evaluation on popular microservice applications shows that AUTOARMOR is able to generate ﬁne-grained inter-service access control policies and update them timely based on changes in the application, with only a minor runtime overhead. By seamlessly integrating with the lifecycle of microservices, it does not require any changes to existing code and infrastructures.",
    "author": "Authors:Xing Li,Zhejiang University;Yan Chen,Northwestern University;Zhiqiang Lin,The Ohio State University;Xiao Wang and Jim Hao Chen,Northwestern University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/li-xing",
    "comment": ""
  },
  {
    "title": "ARCUS: Symbolic Root Cause Analysis of Exploits in Production Systems",
    "abstract": "Abstract:End-host runtime monitors (e.g., CFI, system call IDS) flag processes in response to symptoms of a possible attack. Unfortunately, the symptom (e.g., invalid control transfer) may occur long after the root cause (e.g., buffer overflow), creating a gap whereby bug reports received by developers contain (at best) a snapshot of the process long after it executed the buggy instructions. To help system administrators provide developers with more concise reports, we propose ARCUS, an automated framework that performs root cause analysis over the execution flagged by the end-host monitor. ARCUS works by testing “what if” questions to detect vulnerable states, systematically localizing bugs to their concise root cause while finding additional enforceable checks at the program binary level to demonstrably block them. Using hardware-supported processor tracing, ARCUS decouples the cost of analysis from host performance.We have implemented ARCUS and evaluated it on 31 vulnerabilities across 20 programs along with over 9,000 test cases from the RIPE and Juliet suites. ARCUS identifies the root cause of all tested exploits — with 0 false positives or negatives — and even finds 4 new 0-day vulnerabilities in traces averaging 4,000,000 basic blocks. ARCUS handles programs compiled from upwards of 810,000 lines of C/C++ code without needing concrete inputs or re-execution.",
    "author": "Authors:Carter Yagemann,Georgia Institute of Technology;Matthew Pruett,Georgia Tech Research Institute;Simon P. Chung,Georgia Institute of Technology;Kennon Bittick,Georgia Tech Research Institute;Brendan Saltaformaggio and Wenke Lee,Georgia Institute of Technology",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/yagemann",
    "comment": ""
  },
  {
    "title": "PolyScope: Multi-Policy Access Control Analysis to Compute Authorized Attack Operations in Android Systems",
    "abstract": "Abstract:Android's filesystem access control provides a foundation for system integrity. It combines mandatory (e.g., SEAndroid)and discretionary (e.g., Unix permissions) access control, protecting both the Android platform from Android/OEM services and Android/OEM services from third-party applications. However, OEMs often introduce vulnerabilities when they add market-differentiating features and fail to correctly reconfigure  this  complex  combination  of policies.  In this paper, we propose the PolyScope tool to triage Android systems for vulnerabilities using their filesystem access control policies by: (1) identifying the resources that subjects are authorized to use that may be modified by their adversaries, both with and without policy manipulations, and (2) determining the attack operations on those resources that are actually available to adversaries to reveal the specific cases that need vulnerability testing. A key insight is that adversaries may exploit discretionary elements in Android access control to expand the permissions available to themselves and/or victims to launch attack operations, which we call permission expansion. We apply PolyScope to five Google and five OEM Android releases and find that permission expansion increases the privilege available to launch attacks, sometimes by more than 10x, but a significant fraction (about 15-20%) cannot be converted into attack operations due to other system configurations. Based on this analysis, we describe two previously un-known vulnerabilities and show how PolyScope helps OEMs triage the complex combination of access control policies down to attack operations worthy of testing",
    "author": "Authors:Yu-Tsung Lee,Penn State University;William Enck,North Carolina State University;Haining Chen,Google;Hayawardh Vijayakumar,Samsung Research;Ninghui Li,Purdue University;Zhiyun Qian and Daimeng Wang,UC Riverside;Giuseppe Petracca,Lyft;Trent Jaeger,Penn State University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/lee-yu-tsung",
    "comment": ""
  },
  {
    "title": "PatchGuard: A Provably Robust Defense against Adversarial Patches via Small Receptive Fields and Masking",
    "abstract": "Abstract:Localized adversarial patches aim to induce misclassification in machine learning models by arbitrarily modifying pixels within a restricted region of an image. Such attacks can be realized in the physical world by attaching the adversarial patch to the object to be misclassified, and defending against such attacks is an unsolved/open problem. In this paper, we propose a general defense framework called PatchGuard that can achieve high provable robustness while maintaining high clean accuracy against localized adversarial patches. The cornerstone of PatchGuard involves the use of CNNs with small receptive fields to impose a bound on the number of features corrupted by an adversarial patch. Given a bounded number of corrupted features, the problem of designing an adversarial patch defense reduces to that of designing a secure feature aggregation mechanism. Towards this end, we present our robust masking defense that robustly detects and masks corrupted features to recover the correct prediction. Notably, we can prove the robustness of our defense against any adversary within our threat model. Our extensive evaluation on ImageNet, ImageNette (a 10-class subset of ImageNet), and CIFAR-10 datasets demonstrates that our defense achieves state-of-the-art performance in terms of both provable robust accuracy and clean accuracy.",
    "author": "Authors:Chong Xiang,Princeton University;Arjun Nitin Bhagoji,University of Chicago;Vikash Sehwag and Prateek Mittal,Princeton University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/xiang",
    "comment": ""
  },
  {
    "title": "mID: Tracing Screen Photos via Moiré Patterns",
    "abstract": "Abstract:Cyber-theft of trade secrets has become a serious business threat. Digital watermarking is a popular technique to assist in identifying the source of the file leakage, whereby a unique watermark for each insider is hidden in sensitive files. However, malicious insiders may use their smartphones to photograph the secret file displayed on screens to remove the embedded hidden digital watermarks due to the optical noises introduced during photographing. To identify the leakage source despite such screen photo-based leakage attacks, we leverage Moiré pattern, an optical phenomenon resulted from the optical interaction between electronic screens and cameras. As such, we present mID, a new watermark-like technique that can create a carefully crafted Moiré pattern on the photo when it is taken towards the screen. We design patterns that appear to be natural yet can be linked to the identity of the leaker. We implemented mID and evaluate it with 5 display devices and 6 smartphones from various manufacturers and models. The results demonstrate that mID can achieve an average bit error rate (BER) of 0.6% and can successfully identify an ID with an average accuracy of 96%, with little influence from the type of display devices, cameras, IDs, and ambient lights.",
    "author": "Authors:Yushi Cheng, Xiaoyu Ji, Lixu Wang, and Qi Pang,Zhejiang University;Yi-Chao Chen,Shanghai Jiao Tong University;Wenyuan Xu,Zhejiang University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/cheng-yushi",
    "comment": ""
  },
  {
    "title": "Scalable Detection of Promotional Website Defacements in Black Hat SEO Campaigns",
    "abstract": "Abstract:Miscreants from online underground economies regularly exploit website vulnerabilities and inject fraudulent content into victim web pages to promote illicit goods and services. Scalable detection of such promotional website defacements remains an open problem despite their prevalence in Black Hat Search Engine Optimization (SEO) campaigns. Adversaries often manage to inject content in a stealthy manner by obfuscating the description of illicit products and/or the presence of defacements to make them undetectable. In this paper, we design and implement DMoS—a Defacement Monitoring System which protects websites from promotional defacements at scale. Our design is based on two key observations: Firstly, for effective advertising, the obfuscated jargons of illicit goods or services need to be easily understood by their target customers (i.e., sharing similar shape or pronunciation). Secondly, to promote the underground business, the defacements are crafted to boost search engine ranking of the defaced web pages while trying to stay stealthy from the maintainers and legitimate users of the compromised websites. Leveraging these insights, we first follow the human convention and design a jargon normalization algorithm to map obfuscated jargons to their original forms. We then develop a tag embedding mechanism, which enables DMoS to focus more on those not-so-visually-obvious, yet site-ranking influential HTML tags (i.e., title, meta). Consequently, DMoS can reliably detect illicit content hidden in compromised web pages. In particular, we have deployed DMoS as a cloud-based monitoring service for a five-month trial run. It has analyzed more than 38 million web pages across 7000+ commercial Chinese websites and found defacements in 11% of these websites. It achieves a recall over 99% with a precision about 89%. While the original design of DMoS focuses on the detection of Chinese promotional defacements, we have extended the system and demonstrated its applicability for English website defacement detection via proof-of-concept experiments.",
    "author": "Authors:Ronghai Yang,Sangfor Technologies Inc.;Xianbo Wang,The Chinese University of Hong Kong;Cheng Chi, Dawei Wang, Jiawei He, and Siming Pang,Sangfor Technologies Inc.;Wing Cheong Lau,The Chinese University of Hong Kong",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/yang-ronghai",
    "comment": ""
  },
  {
    "title": "Evaluating In-Workflow Messages for Improving Mental Models of End-to-End Encryption",
    "abstract": "Abstract:As large messaging providers increasingly adopt end-to-end encryption, private communication is readily available to more users than ever before. However, misunderstandings of end-to-end encryption's benefits and shortcomings limit people's ability to make informed choices about how and when to use these services. This paper explores the potential of using short educational messages, built into messaging workflows, to improve users' functional mental models of  secure communication. A preliminary survey study (n=461) finds that such messages, when used in isolation, can effectively improve understanding of several key concepts. We then conduct a longitudinal study (n=61) to test these messages in a more realistic environment: embedded into a secure messaging app. In this second study, we do not find statistically significant evidence of improvement  in mental models; however, qualitative evidence from participant interviews suggests that if made more salient, such messages could have potential to improve users' understanding.",
    "author": "Authors:Omer Akgul, Wei Bai, Shruti Das, and Michelle L. Mazurek,University of Maryland",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/akgul",
    "comment": ""
  },
  {
    "title": "LIGHTBLUE: Automatic Profile-Aware Debloating of Bluetooth Stacks",
    "abstract": "Abstract:The Bluetooth standard is ubiquitously supported by computers, smartphones, and IoT devices. Due to its complexity, implementations require large codebases, which are prone to security vulnerabilities, such as the recently discovered BlueBorne and BadBluetooth attacks. While defined by the standard, most of the Bluetooth functionality, as defined by different Bluetooth profiles, is not required in the common usage scenarios.Starting from this observation, we implement LIGHTBLUE, a framework performing automatic, profile-aware debloating of Bluetooth stacks, allowing users to automatically minimize their Bluetooth attack surface by removing unneeded Bluetooth features. L IGHT B LUE starts with a target Bluetooth application, detects the associated Bluetooth profiles, and applies a combination of control-flow and data-flow analysis to remove unused code within a Bluetooth host code. Furthermore, to debloat the Bluetooth firmware, LIGHTBLUE extracts the used Host Controller Interface (HCI) commands and patches the HCI dispatcher in the Bluetooth firmware automatically, so that the Bluetooth firmware avoids processing unneeded HCI commands.We evaluate LIGHTBLUE on four different Bluetooth hosts and three different Bluetooth controllers. Our evaluation shows that LIGHTB LUE achieves between 32% and 50% code reduction in the Bluetooth host code and between 57% and 83% HCI command reduction in the Bluetooth firmware. This code reduction leads to the prevention of attacks responsible for 20 known CVEs, such as BlueBorne and BadBluetooth, while introducing no performance overhead and without affecting the behavior of the debloated application.",
    "author": "Authors:Jianliang Wu and Ruoyu Wu,Purdue University;Daniele Antonioli and Mathias Payer,EPFL;Nils Ole Tippenhauer,CISPA Helmholtz Center for Information Security;Dongyan Xu, Dave (Jing) Tian, and Antonio Bianchi,Purdue University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/wu-jianliang",
    "comment": ""
  },
  {
    "title": "PrivSyn: Differentially Private Data Synthesis",
    "abstract": "Abstract:In differential privacy (DP), a challenging problem is to generate synthetic datasets that efficiently capture the useful information in the private data.  The synthetic dataset enables any task to be done without privacy concern and modification to existing algorithms.  In this paper, we present PrivSyn, the first automatic synthetic data generation method that can handle general tabular datasets (with 100 attributes and domain size > 2500). PrivSyn is composed of a new method to automatically and privately identify correlations in the data, and a novel method to generate sample data from a dense graphic model.  We extensively evaluate different methods on multiple datasets to demonstrate the performance of our method.",
    "author": "Authors:Zhikun Zhang,Zhejiang University and CISPA Helmholtz Center for Information Security;Tianhao Wang, Ninghui Li, and Jean Honorio,Purdue University;Michael Backes,CISPA Helmholtz Center for Information Security;Shibo He and Jiming Chen,Zhejiang University and Alibaba-Zhejiang University Joint Research Institute of Frontier Technologies;Yang Zhang,CISPA Helmholtz Center for Information Security",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/zhang-zhikun",
    "comment": ""
  },
  {
    "title": "Disrupting Continuity of Apple's Wireless Ecosystem Security: New Tracking, DoS, and MitM Attacks on iOS and macOS Through Bluetooth Low Energy, AWDL, and Wi-Fi",
    "abstract": "Abstract:Apple controls one of the largest mobile ecosystems, with 1.5 billion active devices worldwide, and offers twelve proprietary wireless Continuity services. Previous works have unveiled several security and privacy issues in the involved protocols. These works extensively studied AirDrop while the coverage of the remaining vast Continuity service space is still low. To facilitate the cumbersome reverse-engineering process, we describe the first guide on how to approach a structured analysis of the involved protocols using several vantage points available on macOS. Also, we develop a toolkit to automate parts of this otherwise manual process. Based on this guide, we analyze the full protocol stacks involved in three Continuity services, in particular, Handoff (HO), Universal Clipboard (UC), and Wi-Fi Password Sharing (PWS). We discover several vulnerabilities spanning from Bluetooth Low Energy (BLE) advertisements to Apple's proprietary authentication protocols. These flaws allow for device tracking via HO's mDNS responses, a denial-of-service (DoS) attack on HO and UC, a DoS attack on PWS that prevents Wi-Fi password entry, and a machine-in-the-middle (MitM) attack on PWS that connects a target to an attacker-controlled Wi-Fi network. Our PoC implementations demonstrate that the attacks can be mounted using affordable off-the-shelf hardware ($20 micro:bit and a Wi-Fi card). Finally, we suggest practical mitigations and share our findings with Apple, who have started to release fixes through iOS and macOS updates.",
    "author": "Authors:Milan Stute, Alexander Heinrich, Jannik Lorenz, and Matthias Hollick,Technical University of Darmstadt",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/stute",
    "comment": ""
  },
  {
    "title": "Muse: Secure Inference Resilient to Malicious Clients",
    "abstract": "Abstract:The increasing adoption of machine learning inference in applications has led to a corresponding increase in concerns about the privacy guarantees offered by existing mechanisms for inference. Such concerns have motivated the construction of efficientsecure inferenceprotocols that allow parties to perform inference without revealing their sensitive information. Recently, there has been a proliferation of such proposals, rapidly improving efficiency.  However, most of these protocols assume that the client is semi-honest, that is, the client does not deviate from the protocol; yet in practice, clients are many, have varying incentives, and can behave arbitrarily.To demonstrate that a malicious client can completely break the security of semi-honest protocols, we first develop a newmodel-extraction attackagainst many state-of-the-art secure inference protocols. Our attack enables a malicious client to learn model weights with 22x--312x fewer queries than the best black-box model-extraction attack and scales to much deeper networks.Motivated by the severity of our attack, we design and implement MUSE, an efficient two-party secure inference protocol resilient tomalicious clients. MUSE introduces a novel cryptographic protocol forconditional disclosure of secretsto switch between authenticated additive secret shares and garbled circuit labels, and an improvedBeaver's triple generationprocedure which is 8x--12.5x faster than existing techniques.These protocols allow MUSE to push a majority of its cryptographic overhead into a preprocessing phase: compared to the equivalentsemi-honestprotocol (which is close to state-of-the-art), MUSE's online phase is only 1.7x--2.2x slower and uses 1.4x more communication. Overall, MUSE is 13.4x--21x faster and uses 2x--3.6x less communication than existing secure inference protocols which defend against malicious clients.",
    "author": "Authors:Ryan Lehmkuhl and Pratyush Mishra,UC Berkeley;Akshayaram Srinivasan,Tata Institute of Fundamental Research;Raluca Ada Popa,UC Berkeley",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/lehmkuhl",
    "comment": ""
  },
  {
    "title": "I Always Feel Like Somebody's Sensing Me! A Framework to Detect, Identify, and Localize Clandestine Wireless Sensors",
    "abstract": "Abstract:The increasing ubiquity of low-cost wireless sensors has enabled users to easily deploy systems to remotely monitor and control their environments. However, this raises privacy concerns for third-party occupants, such as a hotel room guest who may be unaware of deployed clandestine sensors. Previous methods focused on specific modalities such as detecting cameras but do not provide a generalized and comprehensive method to capture arbitrary sensors which may be \"spying\" on a user. In this work, we propose SnoopDog, a framework to not only detect common Wi-Fi-based wireless sensors that are actively monitoring a user, but also classify and localize each device. SnoopDog works by establishing causality between patterns in observable wireless traffic and a trusted sensor in the same space, e.g., an inertial measurement unit (IMU) that captures a user's movement. Once causality is established, SnoopDog performs packet inspection to inform the user about the monitoring device. Finally, SnoopDog localizes the clandestine device in a 2D plane using a novel trial-based localization technique. We evaluated SnoopDog across several devices and various modalities and were able to detect causality for snooping devices 95.2% of the time and localize devices to a sufficiently reduced sub-space.",
    "author": "Authors:Akash Deep Singh,University of California, Los Angeles;Luis Garcia,University of California, Los Angeles, and USC ISI;Joseph Noor and Mani Srivastava,University of California, Los Angeles",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/singh",
    "comment": ""
  },
  {
    "title": "M2MON: Building an MMIO-based Security Reference Monitor for Unmanned Vehicles",
    "abstract": "Abstract:Unmanned Vehicles (UVs) often consist of multiple MicroController Units (MCUs) as peripherals to interact with the physical world, including GPS sensors, barometers, motors, etc. While the attack vectors for UV vary, a number of UV attacks aim to impact the physical world either from the cyber or the physical space, e.g., hijacking the mission of UVs via malicious ground control commands or GPS spoofing. This provides us an opportunity to build a unified and generic security framework defending against multiple kinds of UV attacks by monitoring the system's I/O activities. Accordingly, we build a security reference monitor for UVs by hooking into the memory-mapped I/O (MMIO), namely M2MON. Instead of building upon existing RTOS, we implement M2MON as a microkernel running in the privileged mode interceptingMMIOs while pushing the RTOS and applications into the unprivileged mode. We further instantiate an MMIO firewall using M2MON and demonstrate how to implement a secure Extended Kalman Filter (EKF) within M2MON. Our evaluation on a real-world UV system shows that M2MON incurs an 8.85% runtime overhead.  Furthermore, M2MON-based firewall is able to defend against different cyber and physical attacks. The M2MON microkernel contains less than 4K LoC comparing to the 3M LoC RTOS used in our evaluation. We believe M2MON provides the first step towards building a trusted and practical security reference monitor for UVs.",
    "author": "Authors:Arslan Khan and Hyungsub Kim,Purdue University;Byoungyoung Lee,Seoul National University (SNU);Dongyan Xu, Antonio Bianchi, and Dave (Jing) Tian,Purdue University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/khan-arslan",
    "comment": ""
  },
  {
    "title": "Systematic Evaluation of Privacy Risks of Machine Learning Models",
    "abstract": "Abstract:Machine learning models are prone to memorizing sensitive data, making them vulnerable to membership inference attacks in which an adversary aims to guess if an input sample was used to train the model.  In this paper, we show that prior work on membership inference attacks may severely underestimate the privacy risks by relying solely on training custom neural network classifiers to perform attacks and focusing only on the aggregate results over data samples, such as the attack accuracy. To overcome these limitations, we first propose to benchmark membership inference privacy risks by improving existing non-neural network based inference attacks and proposing a new inference attack method based on a modification of prediction entropy. We propose to supplement existing neural network based attacks with our proposed benchmark attacks to effectively measure the privacy risks. We also propose benchmarks for defense mechanisms by accounting for adaptive adversaries with knowledge of the defense and also accounting for the trade-off between model accuracy and privacy risks. Using our benchmark attacks, we demonstrate that existing defense approaches against membership inference attacks are not as effective as previously reported.Next, we introduce a new approach for fine-grained privacy analysis by formulating and deriving a new metric called the privacy risk score. Our privacy risk score metric measures an individual sample's likelihood of being a training member, which allows an adversary to identify samples with high privacy risks and perform membership inference attacks with high confidence. We propose to combine both existing aggregate privacy analysis and our proposed fine-grained privacy analysis for systematically measuring privacy risks. We experimentally validate the effectiveness of the privacy risk score metric and demonstrate that the distribution of privacy risk scores across individual samples is heterogeneous.  Finally, we perform an in-depth investigation to understand why certain samples have high privacy risk scores, including correlations with model properties such as model sensitivity, generalization error, and feature embeddings. Our work emphasizes the importance of a systematic and rigorous evaluation of privacy risks of machine learning models. We publicly release our code athttps://github.com/inspire-group/membership-inference-evaluationand our evaluation mechanisms have also been integrated in Google's TensorFlow Privacy library.",
    "author": "Authors:Liwei Song and Prateek Mittal,Princeton University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/song",
    "comment": ""
  },
  {
    "title": "\"It's stressful having all these phones\": Investigating Sex Workers' Safety Goals, Risks, and Practices Online",
    "abstract": "Abstract:We investigate how a population of end-users with especially salient security and privacy risks --- sex workers --- conceptualizes and manages their digital safety. The commercial sex industry is increasingly Internet-mediated. As such, sex workers are facing new challenges in protecting their digital privacy and security and avoiding serious consequences such as stalking, blackmail, and social exclusion. Through interviews (n=29) and a survey (n=65) with sex workers in European countries where sex work is legal and regulated, we find that sex workers have well-defined safety goals and clear awareness of the risks to their safety: clients, deficient legal protections, and hostile digital platforms. In response to these risks, our participants developed complex strategies for protecting their safety, but use few tools specifically designed for security and privacy. Our results suggest that if even high-risk users with clear risk conceptions view existing tools as insufficiently effective to merit the cost of use, these tools are not actually addressing their real security needs. Our findings underscore the importance of more holistic design of security tools to address both online and offline axes of safety.",
    "author": "Authors:Allison McDonald,University of Michigan;Catherine Barwulor,Clemson University;Michelle L. Mazurek,University of Maryland;Florian Schaub,University of Michigan;Elissa M. Redmiles,Max Planck Institute for Software SystemsDistinguished Paper Award Winner",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/mcdonald",
    "comment": ""
  },
  {
    "title": "\"Now I'm a bit angry:\" Individuals' Awareness, Perception, and Responses to Data Breaches that Affected Them",
    "abstract": "Abstract:Despite the prevalence of data breaches, there is a limited understanding of individuals' awareness, perception, and responses to breaches that affect them. We provide novel insights into this topic through an online study (n=413) in which we presented participants with up to three data breaches that had exposed their email addresses and other personal information. Overall, 73% of participants were affected by at least one breach, 5.36 breaches on average. Many participants attributed the cause of being affected by a breach} to their poor email and security practices; only 14% correctly attributed the cause to external factors such as breached organizations and hackers. Participants were unaware of 74% of displayed breaches and expressed various emotions when learning about them. While some reported intending to take action, most participants believed the breach would not impact them. Our findings underline the need for user-friendly tools to improve consumers' resilience against breaches and accountability for breached organizations to provide more proactive post-breach communications and mitigations.",
    "author": "Authors:Peter Mayer,Karlsruhe Institute of Technology;Yixin Zou and Florian Schaub,University of Michigan;Adam J. Aviv,The George Washington University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/mayer",
    "comment": ""
  },
  {
    "title": "PASAN: Detecting Peripheral Access Concurrency Bugs within Bare-Metal Embedded Applications",
    "abstract": "Abstract:Concurrency bugs might be one of the most challenging software defects to detect and debug due to their non-deterministic triggers caused by task scheduling and interrupt handling. While different tools have been proposed to address concurrency issues, protecting peripherals in embedded systems from concurrent accesses imposes unique challenges. A naïve lock protection on a certain memory-mapped I/O (MMIO) address still allows concurrent accesses to other MMIO addresses of a peripheral. Meanwhile, embedded peripherals such as sensors often employ some internal state machines to achieve certain functionalities. As a result, improper locking can lead to the corruption of peripherals' on-going jobs (we call transaction corruption) thus corrupted sensor values or failed jobs.In this paper, we propose a static analysis tool namely PASAN to detect peripheral access concurrency issues for embedded systems. PASAN automatically finds the MMIO address range of each peripheral device using the parser-ready memory layout documents, extracts the peripheral's internal state machines using the corresponding device drivers, and detects concurrency bugs of peripheral accesses automatically. We evaluate PASAN on seven different embedded platforms, including multiple real time operating systems (RTOSes) and robotic aerial vehicles (RAVs). PASAN found 17 true positive concurrency bugs in total from three different platforms with the bug detection rates ranging from 40% to 100%. We have reported all our findings to the corresponding parties. To the best of our knowledge, PASAN is the first static analysis tool detecting the intrinsic problems in concurrent peripheral accesses for embedded systems.",
    "author": "Authors:Taegyu Kim,Purdue University;Vireshwar Kumar,Indian Institute of Technology, Delhi;Junghwan Rhee,University of Central Oklahoma;Jizhou Chen and Kyungtae Kim,Purdue University;Chung Hwan Kim,University of Texas at Dallas;Dongyan Xu and Dave (Jing) Tian,Purdue University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/kim",
    "comment": ""
  },
  {
    "title": "LZR: Identifying Unexpected Internet Services",
    "abstract": "Abstract:Internet-wide scanning is a commonly used research technique that has helped uncover real-world attacks, find cryptographic weaknesses, and understand both operator and miscreant behavior. Studies that employ scanning have largely assumed that services are hosted on their IANA-assigned ports, overlooking the study of services on unusual ports. In this work, we investigate where Internet services are deployed in practice and evaluate the security posture of services on unexpected ports. We show protocol deployment is more diffuse than previously believed and that protocols run on many additional ports beyond their primary IANA-assigned port. For example, only 3% of HTTP and 6% of TLS services run on ports 80 and 443, respectively. Services on non-standard ports are more likely to be insecure, which results in studies dramatically underestimating the security posture of Internet hosts. Building on our observations, we introduce LZR (\"Laser\"), a system that identifies 99% of identifiable unexpected services in five handshakes and dramatically reduces the time needed to perform application-layer scans on ports with few responsive expected services (e.g., 5500% speedup on 27017/MongoDB). We conclude with recommendations for future studies.",
    "author": "Authors:Liz Izhikevich,Stanford University;Renata Teixeira,Inria;Zakir Durumeric,Stanford University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/izhikevich",
    "comment": ""
  },
  {
    "title": "Explanation-Guided Backdoor Poisoning Attacks Against Malware Classifiers",
    "abstract": "Abstract:Training pipelines for machine learning (ML) based malware classification often rely on crowdsourced threat feeds, exposing a natural attack injection point. In this paper, we study the susceptibility of feature-based ML malware classifiers to backdoor poisoning attacks, specifically focusing on challenging \"clean label\" attacks where attackers do not control the sample labeling process. We propose the use of techniques from explainable machine learning to guide the selection of relevant features and values  to create effective backdoor triggers in a model-agnostic fashion. Using  multiple reference datasets for malware classification, including  Windows PE files, PDFs, and Android applications, we demonstrate effective attacks against a diverse set of machine learning models and evaluate the effect of various constraints imposed on the attacker.  To demonstrate the feasibility of our backdoor attacks in practice, we create a watermarking utility for Windows PE files that preserves the binary's functionality, and we leverage similar behavior-preserving alteration methodologies for Android and PDF files. Finally, we experiment with potential defensive strategies and show the difficulties of completely defending against these attacks, especially when the attacks blend in with the legitimate sample distribution.",
    "author": "Authors:Giorgio Severi,Northeastern University;Jim Meyer,Xailient Inc.;Scott Coull,FireEye Inc.;Alina Oprea,Northeastern University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/severi",
    "comment": ""
  },
  {
    "title": "Cerebro: A Platform for Multi-Party Cryptographic Collaborative Learning",
    "abstract": "Abstract:Many organizations need large amounts of high quality data for their applications, and one way to acquire such data is to combine datasets from multiple parties. Since these organizations often own sensitive data that cannot be shared in the clear with others due to policy regulation and business competition, there is increased interest in utilizing secure multi-party computation (MPC). MPC allows multiple parties to jointly compute a function without revealing their inputs to each other. We present Cerebro, an end-to-end collaborative learning platform that enables parties to compute learning tasks without sharing plaintext data. By taking an end-to-end approach to the system design, Cerebro allows multiple parties with complex economic relationships to safely collaborate on machine learning computation through the use of release policies and auditing, while also enabling users to achieve good performance without manually navigating the complex performance tradeoffs between MPC protocols.",
    "author": "Authors:Wenting Zheng,UC Berkeley/CMU;Ryan Deng, Weikeng Chen, and Raluca Ada Popa,UC Berkeley;Aurojit Panda,New York University;Ion Stoica,UC Berkeley",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/zheng",
    "comment": ""
  },
  {
    "title": "A Large-Scale Interview Study on Information Security in and Attacks against Small and Medium-sized Enterprises",
    "abstract": "Abstract:Cybercrime is on the rise. Attacks by hackers, organized crime and nation-state adversaries are an economic threat for companies world-wide. Small and medium-sized enterprises (SMEs) have increasingly become victims of cyberattacks in recent years. SMEs often lack the awareness and resources to deploy extensive information security measures.  However, the health of SMEs is critical for society: For example, in Germany, 38.8% of all employees work in SMEs, which contributed 31.9% of the German annual gross domestic product in 2018. Many guidelines and recommendations encourage companies to invest more into their information security measures. However, there is a lack of understanding of the adoption of security measures in SMEs, their risk perception with regards to cybercrime and their experiences with cyberattacks. To address this gap in research, we performed 5,000 computer-assisted telephone-interviews (CATIs) with representatives of SMEs in Germany. We report on their experiences with cybercrime, management of information security and risk perception. We present and discuss empirical results of the adoption of both technical and organizational security measures and risk awareness in SMEs. We find that many technical security measures and basic awareness have been deployed in the majority of companies. We uncover differences in reporting cybercrime incidences for SMEs based on their industry sector, company size and security awareness. We conclude our work with a discussion of recommendations for future research, industry and policy makers.",
    "author": "Authors:Nicolas Huaman,Leibniz University Hannover; CISPA Helmholtz Center for Information Security;Bennet von Skarczinski,PwC Germany;Christian Stransky and Dominik Wermke,Leibniz University Hannover;Yasemin Acar,Leibniz University Hannover; Max Planck Institute for Security and PrivacyArne Dreißigacker,Criminological Research Institute of Lower Saxony;Sascha Fahl,Leibniz University Hannover; CISPA Helmholtz Center for Information Security",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/huaman",
    "comment": ""
  },
  {
    "title": "Jetset: Targeted Firmware Rehosting for Embedded Systems",
    "abstract": "Abstract:The ability to execute code in an emulator is a fundamental part of modern vulnerability testing. Unfortunately, this poses a challenge for many embedded systems, where firmware expects to interact with hardware devices specific to the target. Getting embedded system firmware to run outside its native environment, termedrehosting, requires emulating these hardware devices with enough accuracy to convince the firmware that it is executing on the target hardware. However, full fidelity emulation of target devices (which requires considerable engineering effort) may not be necessary to boot the firmware to a point of interest for an analyst (for example, a point where fuzzer input can be injected). We hypothesized that, for the firmware to boot successfully, it is sufficient to emulate only the behavior expected by the firmware, and that this behavior could be inferred automatically.To test this hypothesis, we developed and implemented Jetset, a system that uses symbolic execution to infer what behavior firmware expects from a target device. Jetset can generate devices models for hardware peripherals in C, allowing an analyst to boot the firmware in an emulator (e.g., QEMU). We successfully applied Jetset to thirteen distinct pieces of firmware together representing three architectures, three application domains (power grid, avionics, and consumer electronics), and five different operating systems. We also demonstrate how Jetset-assisted rehosting facilitates fuzz-testing, a common security analysis technique, on an avionics embedded system, in which we found a previously unknown privilege escalation vulnerability.",
    "author": "Authors:Evan Johnson,University of California, San Diego;Maxwell Bland, YiFei Zhu, and Joshua Mason,University of Illinois at Urbana–Champaign;Stephen Checkoway,Oberlin College;Stefan Savage,University of California, San Diego;Kirill Levchenko,University of Illinois at Urbana–Champaign",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/johnson",
    "comment": ""
  },
  {
    "title": "T-Miner: A Generative Approach to Defend Against Trojan Attacks on DNN-based Text Classification",
    "abstract": "Abstract:Deep Neural Network (DNN) classifiers are known to be vulnerable toTrojan or backdoorattacks, where the classifier is manipulated such that it misclassifies any input containing an attacker-determinedTrojan trigger. Backdoors compromise a model's integrity, thereby posing a severe threat to the landscape of DNN-based classification. While multiple defenses against such attacks exist for classifiers in the image domain, there have been limited efforts to protect classifiers in the text domain.We presentTrojan-Miner (T-Miner)--- a defense framework for Trojan attacks on DNN-based text classifiers. T-Miner employs a sequence-to-sequence (seq-2-seq) generative model that probes the suspicious classifier and learns to produce text sequences that are likely to contain the Trojan trigger. T-Miner then analyzes the text produced by the generative model to  determine if they contain trigger phrases, and correspondingly, whether the tested classifier has a backdoor. T-Miner requires no access to the training dataset or clean inputs of the suspicious classifier, and instead uses synthetically crafted \"nonsensical\" text inputs to train the generative model. We extensively evaluate T-Miner on 1100 model instances spanning 3 ubiquitous DNN model architectures, 5 different classification tasks, and a variety of trigger phrases. We show that T-Miner detects Trojan and clean models with a 98.75% overall accuracy, while achieving low false positives on clean models. We also show that T-Miner is robust against a variety of targeted, advanced attacks from an adaptive attacker.",
    "author": "Authors:Ahmadreza Azizi and Ibrahim Asadullah Tahmid,Virginia Tech;Asim Waheed,LUMS Pakistan;Neal Mangaokar,University of Michigan;Jiameng Pu,Virginia Tech;Mobin Javed,LUMS Pakistan;Chandan K. Reddy and Bimal Viswanath,Virginia Tech",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/azizi",
    "comment": ""
  },
  {
    "title": "On the Design and Misuse of Microcoded (Embedded) Processors — A Cautionary Note",
    "abstract": "Abstract:Today's microprocessors often rely on microcode updates to address issues such as security or functional patches.  Unfortunately, microcode update flexibility opens up new attack vectors through malicious microcode alterations. Such attacks share many features with hardware Trojans and have similar devastating consequences for system security. However, due to microcode's opaque nature, little is known in the open literature about the capabilities and limitations of microcode Trojans.We introduce the design of a microcoded RISC-V processor architecture together with a microcode development and evaluation environment. Even though microcode typically has almost complete control of the processor hardware, the design of meaningful microcode Trojans is not straightforward. This somewhat counter-intuitive insight is due to the lack of information at the hardware level about the semantics of executed software. In three security case studies we demonstrate how to overcome these issues and give insights on how to design meaningful microcode Trojans that undermine system security. To foster future research and applications, we publicly release our implementation and evaluation platform.",
    "author": "Authors:Nils Albartus and Clemens Nasenberg,Ruhr University Bochum, Germany; Max Planck Institute for Security and Privacy, Germany;Florian Stolz,Ruhr University Bochum, Germany;Marc Fyrbiak,Max Planck Institute for Security and Privacy, Germany;Christof Paar,Ruhr University Bochum, Germany; Max Planck Institute for Security and Privacy, Germany;Russell Tessier,University of Massachusetts, Amherst, USA",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/albartus",
    "comment": ""
  },
  {
    "title": "Constraint-guided Directed Greybox Fuzzing",
    "abstract": "Abstract:Directed greybox fuzzing is an augmented fuzzing technique intended for the targeted usages such as crash reproduction and proof-of-concept generation, which gives directedness to fuzzing by driving the seeds toward the designated program locations called target sites. However, we find that directed greybox fuzzing can still suffer from the long fuzzing time before exposing the targeted crash, because it does not consider the ordered target sites and the data conditions. This paper presents constraint-guided directed greybox fuzzing that aims to satisfy a sequence of constraints rather than merely reaching a set of target sites. Constraint-guided greybox fuzzing defines a constraint as the combination of a target site and the data conditions, and drives the seeds to satisfy the constraints in the specified order. We automatically generate the constraints with seven types of crash dumps and four types of patch changelogs, and evaluate the prototype system CAFL against the representative directed greybox fuzzing system AFLGo with 47 real-world crashes and 12 patch changelogs. The evaluation shows CAFL outperforms AFLGo by 2.88x for crash reproduction, and better performs in PoC generation as the constraints get explicit.",
    "author": "Authors:Gwangmu Lee,Seoul National University;Woochul Shim,Samsung Research;Byoungyoung Lee,Seoul National University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/lee-gwangmu",
    "comment": ""
  },
  {
    "title": "Automatic Extraction of Secrets from the Transistor Jungle using Laser-Assisted Side-Channel Attacks",
    "abstract": "Abstract:The security of modern electronic devices relies on secret keys stored on secure hardware modules as the root-of-trust (RoT). Extracting those keys would break the security of the entire system. As shown before, sophisticated side-channel analysis (SCA) attacks, using chip failure analysis (FA) techniques, can extract data from on-chip memory cells. However, since the chip's layout is unknown to the adversary in practice, secret key localization and reverse engineering are onerous tasks. Consequently, hardware vendors commonly believe that the ever-growing physical complexity of the integrated circuit (IC) designs can be a natural barrier against potential adversaries. In this work, we present a novel approach that can extract the secret key without any knowledge of the IC's layout, and independent from the employed memory technology as key storage. We automate the—traditionally very labor-intensive—reverse engineering and data extraction process. To that end, we demonstrate that black-box measurements captured using laser-assisted SCA techniques from a training device with known key can be used to profile the device for a later key prediction on other victim devices with unknown keys. To showcase the potential of our approach, we target keys on three different hardware platforms, which are utilized as RoT in different products.",
    "author": "Authors:Thilo Krachenfels and Tuba Kiyan,Technische Universität Berlin;Shahin Tajik,Worcester Polytechnic Institute;Jean-Pierre Seifert,Technische Universität Berlin; Fraunhofer SIT",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/krachenfels",
    "comment": ""
  },
  {
    "title": "Fingerprinting in Style: Detecting Browser Extensions via Injected Style Sheets",
    "abstract": "Abstract:Browser extensions enhance the web experience and have seen great adoption from users in the past decade. At the same time, past research has shown that online trackers can use various techniques to infer the presence of installed extensions and abuse them to track users as well as uncover sensitive information about them.In this work we present a novel extension-fingerprinting vector showing how style modifications from browser extensions can be abused to identify installed extensions. We propose a pipeline that analyzes extensions both statically and dynamically and pinpoints their injected style sheets. Based on these, we craft a set of triggers that uniquely identify browser extensions from the context of the visited page. We analyzed 116K extensions from Chrome's Web Store and report that 6,645 of them inject style sheets on any website that users visit. Our pipeline has created triggers that uniquely identify 4,446 of these extensions, 1,074 (24%) of which could not be fingerprinted with previous techniques. Given the power of this new extension-fingerprinting vector, we propose specific countermeasures against style fingerprinting that have minimal impact on the overall user experience.",
    "author": "Authors:Pierre Laperdrix,Univ. Lille, CNRS, Inria;Oleksii Starov,Palo Alto Networks;Quan Chen and Alexandros Kapravelos,North Carolina State University;Nick Nikiforakis,Stony Brook University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/laperdrix",
    "comment": ""
  },
  {
    "title": "Fine Grained Dataflow Tracking with Proximal Gradients",
    "abstract": "Abstract:Dataflow tracking with Dynamic Taint Analysis (DTA) is an important method in systems security with many applications, including exploit analysis, guided fuzzing, and side-channel information leak detection. However, DTA is fundamentally limited by the Boolean nature of taint labels, which provide no information about the significance of detected dataflows and lead to false positives/negatives on complex real world programs.We introduce proximal gradient analysis (PGA), a novel, theoretically grounded approach that can track more accurate and fine-grained dataflow information. PGA uses proximal gradients, a generalization of gradients for non-differentiable functions, to precisely compose gradients over non-differentiable operations in programs. Composing gradients over programs eliminates many of the dataflow propagation errors that occur in DTA and provides richer information about how each measured dataflow effects a program.We compare our prototype PGA implementation to three state of the art DTA implementations on 7 real-world programs. Our results show that PGA can improve the F1 accuracy of data flow tracking by up to 33% over taint tracking (20% on average) without introducing any significant overhead (< 5% on average). We further demonstrate the effectiveness of PGA by discovering 22 bugs (20 confirmed by developers) and 2 side-channel leaks, and identifying exploitable dataflows in 19 existing CVEs in the tested programs.",
    "author": "Authors:Gabriel Ryan, Abhishek Shah, and Dongdong She,Columbia University;Koustubha Bhat,Vrije Universiteit Amsterdam;Suman Jana,Columbia University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/ryan",
    "comment": ""
  },
  {
    "title": "Card Brand Mixup Attack: Bypassing the PIN in non-Visa Cards by Using Them for Visa Transactions",
    "abstract": "Abstract:Most EMV transactions require online authorization by the card issuer. Namely, the merchant's payment terminal sends an authorization request to the card issuer over a payment network, typically operated by the company that brands the card such as Visa or Mastercard. In this paper we show that it is possible to induce a mismatch between the card brand and the payment network, from the terminal's perspective. The resulting card brand mixup attack has serious security consequences. In particular, it enables criminals to use a victim's Mastercard contactless card to pay for expensive goods without knowing the card's PIN. Concretely, the attacker fools the terminal into believing that the card being used is a Visa card and then applies the recent PIN bypass attack that we reported on Visa. We have built an Android application and successfully used it to carry out this attack for transactions with both Mastercard debit and credit cards, including a transaction for over 400 USD with a Maestro debit card. Finally, we extend our formal model of the EMV contactless protocol to machine-check fixes to the issues found.",
    "author": "Authors:David Basin, Ralf Sasse, and Jorge Toro-Pozo,Department of Computer Science, ETH Zurich",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/basin",
    "comment": ""
  },
  {
    "title": "SEAL: Storage-efficient Causality Analysis on Enterprise Logs with Query-friendly Compression",
    "abstract": "Abstract:Causality analysis automates attack forensic and facilitates behavioral detection by associating causally related but temporally distant system events. Despite its proven usefulness, the analysis suffers from the innate big data challenge to store and process a colossal amount of system events that are constantly collected from hundreds of thousands of end-hosts in a realistic network. In addition, the effectiveness of the analysis to discover security breaches relies on the assumption that comprehensive historical events over a long span are stored.  Hence, it is imminent to address the scalability issue in order to make causality analysis practical and applicable to the enterprise-level environment.In this work, we present SEAL, a novel data compression approach for causality analysis. Based on information-theoretic observations on system event data, our approach achieves lossless compression and supports near real-time retrieval of historic events. In the compression step, the causality graph induced by the system logs is investigated, and abundant edge reduction potentials are explored. In the query step, for maximal speed, decompression is opportunistically executed. Experiments on two real-world datasets show that SEAL offers 2.63x and 12.94x data size reduction, respectively. Besides, 89% of the queries are faster on the compressed dataset than the uncompressed one, and SEAL returns exactly the same query results as the uncompressed data.",
    "author": "Authors:Peng Fei, Zhou Li, and Zhiying Wang,University of California, Irvine;Xiao Yu,NEC Laboratories America, Inc.;Ding Li,Peking University;Kangkook Jee,University of Texas at Dallas",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/fei",
    "comment": ""
  },
  {
    "title": "Android SmartTVs Vulnerability Discovery via Log-Guided Fuzzing",
    "abstract": "Abstract:The recent rise of Smart IoT devices has opened new doors for cyber criminals to achieve damages unique to the ecosystem. SmartTVs, the most widely adopted home-based IoT devices, are no exception. Albeit their popularity, little has been done to evaluate their security and associated risks.  To proactively address the problem, we propose a systematic evaluation of Android SmartTVs security. We overcome a number of prominent challenges such as most of the added TV related functionalities are (partially) implemented in the native layer and many security problems only manifest themselves on the physical aspect without causing any misbehaviors inside the OS. We develop a novel dynamic fuzzing approach, which features an on-the-fly log-based input specification derivation and feedback collection. Our solution further introduces a novel external Observer that monitors the TV-related physical symptoms (i.e., visual and auditory) to detect potential physical anomalies.  We leverage our technique to analyze 11 Android TV Boxes. Our analysis reveals 37 unique vulnerabilities, leading to high-impact cyber threats (e.g., corrupting critical boot environment settings and accessing highly-sensitive data), memory corruptions, and even visual and auditory disturbances (e.g., persistent display content corruption and audio muting)",
    "author": "Authors:Yousra Aafer,University of Waterloo;Wei You,Renmin University of China;Yi Sun, Yu Shi, and Xiangyu Zhang,Purdue University;Heng Yin,UC Riverside",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/aafer",
    "comment": ""
  },
  {
    "title": "Exposing New Vulnerabilities of Error Handling Mechanism in CAN",
    "abstract": "Abstract:Controller Area Network (CAN) has established itself as the main internal communication medium for vehicles. However, recent works have shown that error handling makes CAN nodes vulnerable to certain attacks. In the light of such a threat, we systematically analyze CAN's error handling and fault confinement mechanism to investigate it for further vulnerabilities. In this paper, we develop CANOX, a testing tool\nthat monitors the behavior of a CAN node under different bus and error conditions, and flags conditions that cause an unexpected node behavior. Using CANOX, we found three major undiscovered vulnerabilities in the CAN standard that could be exploited to launch a variety of attacks. Combining the three vulnerabilities, we construct the Scan-Then-Strike Attack (STS), a multi-staged attack in which an attacker with no previous knowledge of the vehicle's internals maps the vehicle's CAN bus, identifies a safety-critical ECU, swiftly silences it, and persistently prevents it from recovering. We validate the practicality of STS by evaluating it on a CAN bus testbed and a real vehicle.",
    "author": "Authors:Khaled Serag and Rohit Bhatia,Purdue University;Vireshwar Kumar,Indian Institute of Technology Delhi;Z. Berkay Celik and Dongyan Xu,Purdue University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/serag",
    "comment": ""
  },
  {
    "title": "Defeating DNN-Based Traffic Analysis Systems in Real-Time With Blind Adversarial Perturbations",
    "abstract": "Abstract:Deep neural networks (DNNs) are commonly used for various traffic analysis problems, such as website fingerprinting and flow correlation, as they outperform traditional (e.g., statistical) techniques by large margins. However, deep neural networks are known to be vulnerable to adversarial examples: adversarial inputs to the model that get labeled incorrectly by the model due to small adversarial perturbations. In this paper, for the first time, we show that an adversary can defeat DNN-based traffic analysis techniques by applyingadversarial perturbationson the patterns oflivenetwork traffic.Applying adversarial perturbations (examples) on traffic analysis classifiers faces two major challenges. First, the perturbing party (i.e., the adversary) should be able to apply the adversarial network perturbations onlivetraffic, with no need to buffering traffic or having some prior knowledge about upcoming network packets. We design a systematic approach to create adversarial perturbations that are independent of their target network connections, and therefore can be applied in real-time on live traffic. We therefore call such adversarial perturbationsblind.Second, unlike image classification applications, perturbing traffic features is not straight-forward as this needs to be done while preserving the correctness of dependent traffic features. We address this challenge by introducing remapping functions that we use to enforce different network constraints while creating blind adversarial perturbations.Our blind adversarial perturbations algorithm isgenericand can be applied on various types of traffic classifiers. We demonstrate this by implementing a Tor pluggable transport that applies adversarial perturbations on live Tor connections to defeat DNN-based website fingerprinting and flow correlation techniques, the two most-studied types of traffic analysis. We show that our blind adversarial perturbations are eventransferablebetween different models and architectures, so they can be applied by blackbox adversaries. Finally, we show that existing countermeasures perform poorly against blind adversarial perturbations, therefore, we introduce a tailored countermeasure.",
    "author": "Authors:Milad Nasr, Alireza Bahramali, and Amir Houmansadr,University of Massachusetts Amherst",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/nasr",
    "comment": ""
  },
  {
    "title": "Lord of the Ring(s): Side Channel Attacks on the CPU On-Chip Ring Interconnect Are Practical",
    "abstract": "Abstract:We introduce the first microarchitectural side channel attacks that leverage contention on the CPU ring interconnect. There are two challenges that make it uniquely difficult to exploit this channel. First, little is known about the ring interconnect's functioning and architecture. Second, information that can be learned by an attacker through ring contention is noisy by nature and has coarse spatial granularity. To address the first challenge, we perform a thorough reverse engineering of the sophisticated protocols that handle communication on the ring interconnect. With this knowledge, we build a cross-core covert channel over the ring interconnect with a capacity of over 4 Mbps from a single thread, the largest to date for a cross-core channel not relying on shared memory. To address the second challenge, we leverage the fine-grained temporal patterns of ring contention to infer a victim program's secrets. We demonstrate our attack by extracting key bits from vulnerable EdDSA and RSA implementations, as well as inferring the precise timing of keystrokes typed by a victim user.",
    "author": "Authors:Riccardo Paccagnella, Licheng Luo, and Christopher W. Fletcher,University of Illinois at Urbana-Champaign",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/paccagnella",
    "comment": ""
  },
  {
    "title": "Automatic Firmware Emulation through Invalidity-guided Knowledge Inference",
    "abstract": "Abstract:Emulating ﬁrmware for microcontrollers is challenging due to the tight coupling between the hardware and ﬁrmware. This has greatly impeded the application of dynamic analysis tools to ﬁrmware analysis. The state-of-the-art work automatically models unknown peripherals by observing their access patterns, and then leverages heuristics to calculate the appropriate responses when unknown peripheral registers are accessed. However, we empirically found that this approach and the corresponding heuristics are frequently insufﬁcient to emulate ﬁrmware. In this work, we propose a new approach called µEmu to emulate ﬁrmware with unknown peripherals. Unlike existing work that attempts to build a general model for each peripheral, our approach learns how to correctly emulate ﬁrmware execution at individual peripheral access points. It takes the image as input and symbolically executes it by representing unknown peripheral registers as symbols. During symbolic execution, it infers the rules to respond to unknown peripheral accesses. These rules are stored in a knowledge base, which is referred to during the dynamic ﬁrmware analysis. µEmu achieved a passing rate of 93% in a set of unit tests for peripheral drivers without any manual assistance. We also evaluated µEmu with real-world ﬁrmware samples and new bugs were discovered.",
    "author": "Authors:Wei Zhou,National Computer Network Intrusion Protection Center, University of Chinese Academy of Sciences;Le Guan,Department of Computer Science, University of Georgia;Peng Liu,College of Information Sciences and Technology, The Pennsylvania State University;Yuqing Zhang,National Computer Network Intrusion Protection Center, University of Chinese Academy of Sciences; School of Cyber Engineering, Xidian University; School of Computer Science and Cyberspace Security, Hainan University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/zhou",
    "comment": ""
  },
  {
    "title": "Reducing HSM Reliance in Payments through Proxy Re-Encryption",
    "abstract": "Abstract:Credit and debit-card payments are typically authenticated with PINs. Once entered into a terminal, the PIN is sent as an encryptedPIN blockacross a payments network to the destination bank, which decrypts and verifies the PIN block. Each node in the payments network routes the PIN block to the next node by decrypting the block with its own key, and then re-encrypting the PIN block with the next node's key; nodes establish shared secret keys with their neighbors to do so. This decrypt-then-encrypt operation over PIN blocks is known asPIN translation, and it is currently performed in Hardware Security Modules (HSMs) to avoid possible PIN exposure. However, HSMs incur heavy acquisition and operational expenses.Introduced at EUROCRYPT '98, proxy re-encryption (PRE) is a cryptographic primitive which can re-encrypt without exposing sensitive data. We perform an extensive study of PRE as applied to PIN translation, and show through formalization, security analysis, and an implementation study that PRE is a practical alternative to HSMs. With PRE, we eliminate the need for HSMs during re-encryption of a PIN, thus greatly reducing the number of HSMs needed by each participant in the payments ecosystem. Along the way we conduct practice-oriented PRE research, with novel theoretical contributions to resolve issues in comparing so-called honest re-encryption to chosen ciphertext PRE security, and a new efficient PRE scheme achieving a type of chosen ciphertext security.",
    "author": "Authors:Sivanarayana Gaddam,Visa;Atul Luykx,Security Engineering Research, Google;Rohit Sinha,Swirlds Inc.;Gaven Watson,Visa Research",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/gaddam",
    "comment": ""
  },
  {
    "title": "Examining the Efficacy of Decoy-based and Psychological Cyber Deception",
    "abstract": "Abstract:The threat of cyber attacks is a growing concern across the world, leading to an increasing need for sophisticated cyber defense techniques. Attackers often rely on direct observation of cyber environments. This reliance provides opportunities for defenders to affect attacker perception and behavior by plying the powerful tools of defensive cyber deception. In this paper we analyze data from a controlled experiment designed to understand how defensive deception, both cyber and psychological, affects attackers [16]. Over 130 professional red teamers participated in a network penetration test in which both the presence and explicit mention of deceptive defensive techniques were controlled. While a detailed description of the experimental design and execution along with preliminary results related to red teamer characteristics has been published, it did not address any of the main hypotheses. Granted access to the cyber and self-report data collected from the experiment, this publication begins to address theses hypotheses by investigating the effectiveness of decoy systems for cyber defense through comparison of various measures of participant forward progress across the four experimental conditions. Results presented in this paper support a new finding that the combination of the presence of decoys and providing information that deception is present has the greatest impact on cyber attack behavior, when compared to a control condition in which no deception was used.",
    "author": "Authors:Kimberly J. Ferguson-Walter,Laboratory for Advanced Cybersecurity Research;Maxine M. Major,Naval Information Warfare Center, Pacific;Chelsea K. Johnson,Arizona State University;Daniel H. Muhleman,Naval Information Warfare Center, Pacific",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/ferguson-walter",
    "comment": ""
  },
  {
    "title": "Does logic locking work with EDA tools?",
    "abstract": "Abstract:Logic locking is a promising solution against emerging hardware security threats, which entails protecting a Boolean circuit using a “keying” mechanism. The latest and hitherto unbroken logic-locking techniques are based on the “corrupt-and-correct (CAC)” principle, offering provable security against input-output query attacks. However, it remains unclear whether these techniques are susceptible to structural attacks. This paper exploits the properties of integrated circuit (IC) design tools, also termed electronic design automation (EDA) tools, to undermine the security of the CAC techniques. Our proposed attack can break all the CAC techniques, including the unbroken CACrem technique that 40+ hackers taking part in a competition for more than three months could not break. Our attack can break circuits processed with any EDA tools, which is alarming because, until now, none of the EDA tools can render a secure locking solution: logic locking cannot make use of the existing EDA tools. We also provide a security property to ensure resilience against structural attacks. The commonly-used circuits can satisfy this property but only in a few cases where they cannot even defeat brute-force; thus, questions arise on the use of these circuits as benchmarks to evaluate logic locking and other security techniques.",
    "author": "Authors:Zhaokun Han, Muhammad Yasin, and Jeyavijayan (JV) Rajendran,Texas A&M University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/han-zhaokun",
    "comment": ""
  },
  {
    "title": "ExpRace: Exploiting Kernel Races through Raising Interrupts",
    "abstract": "Abstract:A kernel data race is notoriously challenging to detect, reproduce, and diagnose, mainly caused by nondeterministic thread interleaving. The kernel data race has a critical security implication since it often leads to memory corruption, which can be abused to launch privilege escalation attacks. Interestingly, due to the challenges above, the exploitation of the kernel data race is also challenging. Specifically, we find that some kernel races are nearly impossible to exploit due to its unique requirement on execution orders, which is almost impossible to happen without manual intervention.This paper develops a generic exploitation technique for kernel data races. To this end, we first analyze kernel data races, which finds an intrinsic condition classifying easy-to-exploit and hard-to-exploit races. Then we develop ExpRace a generic race exploitation technique for various kernels including Linux, Microsoft Windows, and Mac OS X. ExpRace turns hard-to-exploit races into easy-to-exploit races by manipulating an interrupt mechanism during the exploitation. According to our evaluation with 10 real-world hard-to-exploit races, ExpRace was able to exploit all of those within 10 to 118 seconds, while an exploitation without ExpRace failed for all given 24 hours.",
    "author": "Authors:Yoochan Lee,Seoul National University;Changwoo Min,Virginia Tech;Byoungyoung Lee,Seoul National University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/lee-yoochan",
    "comment": ""
  },
  {
    "title": "CANARY - a reactive defense mechanism for Controller Area Networks based on Active RelaYs",
    "abstract": "Abstract:We are rethinking the decades-old design of the CAN bus by incorporating reactive defense capabilities in it. While its reliability and cost effectiveness turned CAN into the most widely used in-vehicle communication interface, its topology, physical layer and arbitration mechanism make it impossible to prevent certain types of adversarial activities on the bus. For example, DoS attacks cannot be stopped as the physical layer gives equal rights to all the connected ECUs and an adversary may exploit this by flooding the network with high priority frames or cause transmission errors which may move honest ECUs into the bus-off state. In response to this, we propose a reactive mechanism based on relays placed along the bus that will change the network topology in case of an attack, i.e., a moving target defense mechanism, allowing a bus guardian to filter and redirect legitimate traffic. We take care of physical properties of the bus and keep the 120 Ω load constant at the end of the lines whenever relays are triggered to modify the topology of the bus. We build a proof-of-concept implementation and test it in a laboratory setup with automotive-grade controllers that demonstrates its functionality over collected real-world in-vehicle traffic. Our experiments show that despite short term disturbances when the relays are triggered, the frame loss is effectively zero.",
    "author": "Authors:Bogdan Groza, Lucian Popa, and Pal-Stefan Murvay,Universitatea Politehnica Timisoara;Yuval Elovici and Asaf Shabtai,Ben-Gurion University of the Negev",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/groza",
    "comment": ""
  },
  {
    "title": "CLARION: Sound and Clear Provenance Tracking for Microservice Deployments",
    "abstract": "Abstract:Linux container-based microservices have emerged as an attractive alternative to virtualization as they reduce application footprints and facilitate more efficient resource utilization.  Their popularity has also led to increased scrutiny of the underlying security properties and attack surface of container technology.  Provenance-based analysis techniques have been proposed as an effective means toward comprehensive and high-assurance security control as they provide fine-grained mechanisms to track data flows across the system and detect unwanted or unexpected changes to data objects.  However, existing provenance tracking techniques are limited in their ability to build sound and clear provenance in container network environments due to complexities introduced by namespace virtualization.We describe a namespace- and container-aware provenance tracking solution, called CLARION, that addresses the unique soundness and clarity challenges introduced by traditional provenance tracking solutions. Specifically, we first describe fragmentation and ambiguities introduced in provenance analysis tools by each of the Linux namespaces and propose solutions to address analysis soundness.  Then we discuss the design of specialized semantics-summarization techniques that improve the clarity of provenance analysis.  We have developed a prototype implementation of CLARION and evaluate its performance against a spectrum of container-specific attacks. The results demonstrate the utility of our system and how it outperforms the state-of-the-art provenance tracking systems by providing an accurate and concise view of data provenance in container environments.",
    "author": "Authors:Xutong Chen,Northwestern University;Hassaan Irshad,SRI International;Yan Chen,Northwestern University;Ashish Gehani and Vinod Yegneswaran,SRI International",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/chen-xutong",
    "comment": ""
  },
  {
    "title": "Blind In/On-Path Attacks and Applications to VPNs",
    "abstract": "Abstract:Protecting network protocols within an encrypted tunnel, using technologies such as Virtual Private Networks (VPNs), is increasingly important to millions of users needing solutions to evade censorship or protect their traffic against in/on-path observers/attackers.  In this paper, we present a series of attacks from two threat models: an attacker that can inject spoofed packets into the network stack of a VPN client (called client-side), and an attacker that can spoof packets on the Internet and send them to a VPN server (called server-side).  In both cases, we assume that the attacker is in/on-path, and can count encrypted bytes or packets over time.  In both threat models, we demonstrate attacks to infer the existence of, interfere with, or inject data into TCP connections forwarded through the encrypted VPN tunnel.  In the server-side threat model, we also demonstrate an attack to hijack tunneled DNS queries and completely remove the protections of the VPN tunnel. For the attacks presented in this paper, we (1) assess their feasibility in terms of packet rates and timing; (2) test their applicability against a broad range of VPN technologies, types, and vendors; and (3) consider practical issues with respect to real-world attacks. We followed an ethical disclosure process for all attacks presented in this paper. Client-side attacks were addressed with two CVEs and partially mitigated by a series of updates from some operating system and VPN client vendors.  Server-side attacks have not been addressed and are still feasible with all operating systems and VPN servers that we tested.",
    "author": "Authors:William J. Tolley and Beau Kujath,Breakpointing Bad/Arizona State University;Mohammad Taha Khan,Washington and Lee University;Narseo Vallina-Rodriguez,IMDEA Networks Institute/ICSI;Jedidiah R. Crandall,Breakpointing Bad/Arizona State University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/tolley",
    "comment": ""
  },
  {
    "title": "Jaqen: A High-Performance Switch-Native Approach for Detecting and Mitigating Volumetric DDoS Attacks with Programmable Switches",
    "abstract": "Abstract:The emergence of programmable switches offers a new opportunity to revisit ISP-scale defenses for volumetric DDoS attacks. In theory, these can offer better cost vs. performance vs. flexibility trade-offs relative to proprietary hardware and virtual appliances. However, the ISP setting creates unique challenges in this regard---we need to run a broad spectrum of detection and mitigation functions natively on the programmable switch hardware and respond to dynamic adaptive attacks at scale. Thus, prior efforts in using programmable switches that assume out-of-band detection and/or use switches merely as accelerators for specific tasks are no longer sufficient, and as such, this potential remains unrealized. To tackle these challenges, we design and implement Jaqen, a switch-native approach for volumetric DDoS defense that can run detection and mitigation functions entirely inline on switches, without relying on additional data plane hardware. We design switch-optimized, resource-efficient detection and mitigation building blocks. We design a flexible API to construct a wide spectrum of best-practice (and future) defense strategies that efficiently use switch capabilities. We build a network-wide resource manager that quickly adapts to the attack posture changes. Our experiments show that Jaqen is orders of magnitude more performant than existing systems: Jaqen can handle large-scale hybrid and dynamic attacks within seconds, and mitigate them effectively at high line-rates (380 Gbps).",
    "author": "Authors:Zaoxing Liu,Boston University;Hun Namkung,Carnegie Mellon University;Georgios Nikolaidis, Jeongkeun Lee, and Changhoon Kim,Intel, Barefoot Switch Division;Xin Jin,Peking University;Vladimir Braverman,Johns Hopkins University;Minlan Yu,Harvard University;Vyas Sekar,Carnegie Mellon University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/liu-zaoxing",
    "comment": ""
  },
  {
    "title": "JAW: Studying Client-side CSRF with Hybrid Property Graphs and Declarative Traversals",
    "abstract": "Abstract:Client-side CSRF is a new type of CSRF vulnerability where the adversary can trick the client-side JavaScript program to send a forged HTTP request to a vulnerable target site by modifying the program's input parameters. We have little-to-no knowledge of this new vulnerability, and exploratory security evaluations of JavaScript-based web applications are impeded by the scarcity of reliable and scalable testing techniques. This paper presents JAW, a framework that enables the analysis of modern web applications against client-side CSRF leveraging declarative traversals on hybrid property graphs, a canonical, hybrid model for JavaScript programs. We use JAW to evaluate the prevalence of client-side CSRF vulnerabilities among all (i.e., 106) web applications from the Bitnami catalog, covering over 228M lines of JavaScript code. Our approach uncovers 12,701 forgeable client-side requests affecting 87 web applications in total. For 203 forgeable requests, we successfully created client-side CSRF exploits against seven web applications that can execute arbitrary server-side state-changing operations or enable cross-site scripting and SQL injection, that are not reachable via the classical attack vectors. Finally, we analyzed the forgeable requests and identified 25 request templates, highlighting the fields that can be manipulated and the type of manipulation.",
    "author": "Authors:Soheil Khodayari and Giancarlo Pellegrino,CISPA Helmholtz Center for Information Security",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/khodayari",
    "comment": ""
  },
  {
    "title": "On the Usability of Authenticity Checks for Hardware Security Tokens",
    "abstract": "Abstract:The final responsibility to verify whether a newly purchased hardware security token (HST) is authentic and unmodified lies with the end user. However, recently reported attacks on such tokens suggest that users cannot take the security guarantees of their HSTs for granted, even despite widely deployed authenticity checks. We present the first comprehensive market review evaluating the effectiveness and usability of authenticity checks for the most commonly used HSTs. Furthermore, we conducted a survey (n=194) to examine users' perceptions and usage of these checks.We found that due to a lack of transparency and information, users often do not carry out---or even are not aware of---essential checks but rely on less meaningful methods. Moreover, our results confirm that currently deployed authenticity checks suffer from improperly perceived effectiveness and cannot mitigate all variants of distribution attacks. Furthermore, some authenticity concepts of different manufacturers contradict each other. In order to address these challenges, we suggest (i) a combination of conventional and novel authenticity checks, and (ii) a user-centered, transparent design.",
    "author": "Authors:Katharina Pfeffer and Alexandra Mai,SBA Research;Adrian Dabrowski,University of California, Irvine;Matthias Gusenbauer,Tokyo Institute of Technology & SBA Research;Philipp Schindler,SBA Research;Edgar Weippl,University of Vienna;Michael Franz,University of California, Irvine;Katharina Krombholz,CISPA Helmholtz Center for Information Security",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/pfeffer",
    "comment": ""
  },
  {
    "title": "Phishpedia: A Hybrid Deep Learning Based Approach to Visually Identify Phishing Webpages",
    "abstract": "Abstract:Recent years have seen the development of phishing detection and identification approaches to defend against phishing attacks. Phishing detection solutions often report binary results, i.e., phishing or not, without any explanation. In contrast, phishing identification approaches identify phishing webpages by visually comparing  webpages with predefined legitimate references and report phishing along with its target brand, thereby having explainable results.  However, there are technical challenges in visual analyses that limit existing solutions from being effective (with high accuracy) and efficient (with low runtime overhead), to be put to practical use.In this work, we design a hybrid deep learning system, Phishpedia, to address two prominent technical challenges in phishing identification, i.e., (i) accurate recognition of identity logos on webpage screenshots, and (ii) matching logo variants of the same brand. Phishpedia achieves both high accuracy and low runtime overhead. And very importantly, different from common approaches, Phishpedia does not require training on any phishing samples. We carry out extensive experiments using real phishing data; the results demonstrate that Phishpedia significantly outperforms baseline identification approaches (EMD, PhishZoo, and LogoSENSE) in accurately and efficiently identifying phishing pages. We also deployed Phishpedia with CertStream service and discovered 1704 new real phishing websites within 30 days, way more than other solutions; moreover, 1113 of them are not reported by any engines in VirusTotal.",
    "author": "Authors:Yun Lin and Ruofan Liu,National University of Singapore;Dinil Mon Divakaran,Trustwave;Jun Yang Ng and Qing Zhou Chan,National University of Singapore;Yiwen Lu, Yuxuan Si, and Fan Zhang,Zhejiang University;Jin Song Dong,National University of Singapore",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/lin",
    "comment": ""
  },
  {
    "title": "AdCube: WebVR Ad Fraud and Practical Confinement of Third-Party Ads",
    "abstract": "Abstract:Web technology has evolved to offer 360-degree immersive browsing experiences. This new technology, called WebVR, enables virtual reality by rendering a three-dimensional world on an HTML canvas. Unfortunately, there exists no browser-supported way of sharing this canvas between different parties. Assuming an abusive ad service provider who exploits this absence, we present four new ad fraud attack methods. Our user study demonstrates that the success rates of our attacks range from 88.23% to 100%, confirming their effectiveness. To mitigate the presented threats, we propose AdCube, which allows publishers to specify the behaviors of third-party ad code and enforce this specification. We show that AdCube is able to block the presented threats with a small page loading latency of 236 msec and a negligible frame-per-second (FPS) drop for nine WebVR official demo sites.",
    "author": "Authors:Hyunjoo Lee, Jiyeon Lee, and Daejun Kim,Korea Advanced Institute of Science and Technology;Suman Jana,Columbia University;Insik Shin and Sooel Son,Korea Advanced Institute of Science and Technology",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/lee-hyunjoo",
    "comment": ""
  },
  {
    "title": "Injection Attacks Reloaded: Tunnelling Malicious Payloads over DNS",
    "abstract": "Abstract:The traditional design principle for Internet protocols indicates: \"Be strict when sending and tolerant when receiving\" [RFC1958], and DNS is no exception to this. The transparency of DNS in handling the DNS records, also standardised specifically for DNS [RFC3597], is one of the key features that made it such a popular platform facilitating a constantly increasing number of new applications. An application simply creates a new DNS record and can instantly start distributing it over DNS without requiring any changes to the DNS servers and platforms. Our Internet wide study confirms that more than 1.3M (96% of tested) open DNS resolvers are standard compliant and treat DNS records transparently.In this work we show that this `transparency' introduces a severe vulnerability in the Internet: we demonstrate a new method to launch string injection attacks by encoding malicious payloads into DNS records. We show how to weaponise such DNS records to attack popular applications. For instance, we apply string injection to launch a new type of DNS cache poisoning attack, which we evaluated against a population of open resolvers and found 105K to be vulnerable. Such cache poisoning cannot be prevented with common setups of DNSSEC. Our attacks apply to internal as well as to public services, for instance, we reveal that all eduroam services are vulnerable to our injection attacks, allowing us to launch exploits ranging from unauthorised access to eduroam networks to resource starvation. Depending on the application, our attacks cause system crashes, data corruption and leakage, degradation of security, and can introduce remote code execution and arbitrary errors.In our evaluation of the attacks in the Internet we find that all the standard compliant open DNS resolvers we tested allow our injection attacks against applications and users on their networks.",
    "author": "Authors:Philipp Jeitner,TU Darmstadt;Haya Shulman,Fraunhofer SIT",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/jeitner",
    "comment": ""
  },
  {
    "title": "Where's Crypto?: Automated Identification and Classification of Proprietary Cryptographic Primitives in Binary Code",
    "abstract": "Abstract:The continuing use of proprietary cryptography in embedded systems across many industry verticals, from physical access control systems and telecommunications to machine-to-machine authentication, presents a significant obstacle to black-box security-evaluation efforts. In-depth security analysis requires locating and classifying the algorithm in often very large binary images, thus rendering manual inspection, even when aided by heuristics, time consuming.In this paper, we present a novel approach to automate the identification and classification of (proprietary) cryptographic primitives within binary code. Our approach is based on Data Flow Graph (DFG) isomorphism, previously proposed by Lestringant et al. Unfortunately, their DFG isomorphism approach is limited to known primitives only, and relies on heuristics for selecting code fragments for analysis. By combining the said approach with symbolic execution, we overcome all their limitations, and are able to extend the analysis into the domain of unknown, proprietary cryptographic primitives. To demonstrate that our proposal is practical, we develop various signatures, each targeted at a distinct class of cryptographic primitives, and present experimental evaluations for each of them on a set of binaries, both publicly available (and thus providing reproducible results), and proprietary ones. Lastly, we provide a free and open-source implementation of our approach, called Where's Crypto?, in the form of a plug-in for the popular IDA disassembler.",
    "author": "Authors:Carlo Meijer,Radboud University;Veelasha Moonsamy,Ruhr University Bochum;Jos Wetzels,Midnight Blue Labs",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/meijer",
    "comment": ""
  },
  {
    "title": "SocialHEISTing: Understanding Stolen Facebook Accounts",
    "abstract": "Abstract:Online social network (OSN) accounts are often more user-centric than other types of online accounts (e.g., email accounts) because they present a number of demographic attributes such as age, gender, location, and occupation. While these attributes allow for more meaningful online interactions, they can also be used by malicious parties to craft various types of abuse. To understand the effects of demographic attributes on attacker behavior in stolen social accounts, we devised a method to instrument and monitor such accounts. We then created, instrumented, and deployed more than 1000 Facebook accounts, and exposed them to criminals. Our results confirm that victim demographic traits indeed influence the way cybercriminals abuse their accounts. For example, we find that cybercriminals that access teen accounts write messages and posts more than the ones accessing adult accounts, and attackers that compromise male accounts perform disruptive activities such as changing some of their profile information more than the ones that access female accounts. This knowledge could potentially help online services develop new models to characterize benign and malicious activity across various demographic attributes, and thus automatically classify future activity.",
    "author": "Authors:Jeremiah Onaolapo,University of Vermont;Nektarios Leontiadis and Despoina Magka,Facebook;Gianluca Stringhini,Boston University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/onaolapo",
    "comment": ""
  },
  {
    "title": "Static Detection of Unsafe DMA Accesses in Device Drivers",
    "abstract": "Abstract:Direct Memory Access (DMA) is a popular mechanism for improving hardware I/O performance, and it has been widely used by many existing device drivers. However, DMA accesses can be unsafe, from two aspects. First, without proper synchronization of DMA buffers with hardware registers and CPU cache, the buffer data stored in CPU cache and hardware registers can be inconsistent, which can cause unexpected hardware behaviors. Second, a malfunctioning or untrusted hardware device can write bad data into system memory, which can trigger security bugs (such as buffer overflow and invalid pointer access), if the driver uses the data without correct validation. To detect unsafe DMA accesses, some key challenges need to be solved. For example, because each DMA access is implemented as a regular variable access in the driver code, identifying DMA accesses is difficult.In this paper, we propose a static-analysis approach named SADA, to automatically and accurately detect unsafe DMA accesses in device drivers. SADA consists of three basic steps. First, SADA uses a field-based alias analysis to identify DMA accesses, according to the information of DMA-buffer creation. Second, SADA uses a flow-sensitive and pattern-based analysis to check the safety of each DMA access, to detect possible unsafe DMA accesses. Finally, SADA uses a SMT solver to validate the code-path condition of each possible unsafe DMA access, to drop false positives. We have evaluated SADA on the driver code of Linux 5.6, and found 284 real unsafe DMA accesses. Among them, we highlight that 121 can trigger buffer-overflow bugs and 36 can trigger invalid-pointer accesses causing arbitrary read or write. We have reported these unsafe DMA accesses to Linux driver developers, and 105 of them have been confirmed.",
    "author": "Authors:Jia-Ju Bai and Tuo Li,Tsinghua University;Kangjie Lu,University of Minnesota;Shi-Min Hu,Tsinghua University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/bai",
    "comment": ""
  },
  {
    "title": "Causal Analysis for Software-Defined Networking Attacks",
    "abstract": "Abstract:Software-defined networking (SDN) has emerged as a flexible network architecture for central and programmatic control. Although SDN can improve network security oversight and policy enforcement, ensuring the security of SDN from sophisticated attacks is an ongoing challenge for practitioners. Existing network forensics tools attempt to identify and track such attacks, but holistic causal reasoning across control and data planes remains challenging.We present PicoSDN, a provenance-informed causal observer for SDN attack analysis. PicoSDN leverages fine-grained data and execution partitioning techniques, as well as a unified control and data plane model, to allow practitioners to efficiently determine root causes of attacks and to make informed decisions on mitigating them. We implement PicoSDN on the popular ONOS SDN controller. Our evaluation across several attack case studies shows that PicoSDN is practical for the identification, analysis, and mitigation of SDN attacks.",
    "author": "Authors:Benjamin E. Ujcich,Georgetown University;Samuel Jero and Richard Skowyra,MIT Lincoln Laboratory;Adam Bates,University of Illinois at Urbana-Champaign;William H. Sanders,Carnegie Mellon University;Hamed Okhravi,MIT Lincoln Laboratory",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/ujcich",
    "comment": ""
  },
  {
    "title": "Data Poisoning Attacks to Local Differential Privacy Protocols",
    "abstract": "Abstract:Local Differential Privacy (LDP) protocols enable an untrusted data collector to perform privacy-preserving data analytics. In particular, each user locally perturbs its data to preserve privacy before sending it to the data collector, who aggregates the perturbed data to obtain statistics of interest. In the past several years, researchers from multiple communities—such as security, database, and theoretical computer science—have proposed many LDP protocols. These studies mainly focused on improving the utility of the LDP protocols. However, the security of LDP protocols is largely unexplored.In this work, we aim to bridge this gap. We focus on LDP protocols forfrequency estimationandheavy hitter identification, which are two basic data analytics tasks. Specifically, we show that an attacker can inject fake users into an LDP protocol and the fake users send carefully crafted data to the data collector such that the LDP protocol estimates high frequencies for arbitrary attacker-chosen items or identifies them as heavy hitters. We call our attacksdata poisoning attacks. We theoretically and/or empirically show the effectiveness of our attacks. We also explore three countermeasures against our attacks. Our experimental results show that they can effectively defend against our attacks in some scenarios but have limited effectiveness in others, highlighting the needs for new defenses against our attacks.",
    "author": "Authors:Xiaoyu Cao, Jinyuan Jia, and Neil Zhenqiang Gong,Duke University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/cao-xiaoyu",
    "comment": ""
  },
  {
    "title": "How to Make Private Distributed Cardinality Estimation Practical, and Get Differential Privacy for Free",
    "abstract": "Abstract:Secure computation is a promising privacy enhancing technology, but it is often not scalable enough for data intensive applications. On the other hand, the use of sketches has gained  popularity in data mining, because sketches often give rise to highly efficient and scalable sub-linear algorithms. It is natural to ask: what if we put secure computation and sketches together? We investigated the question and the findings are interesting: we can get security, we can get scalability, and somewhat unexpectedly, we can also get differential privacy—for free. Our study started from building a secure computation protocol based on the Flajolet-Martin (FM) sketches, for solving the Private Distributed Cardinality Estimation (PDCE) problem, which is a fundamental problem with applications ranging from crowd tracking to network monitoring. The state of art protocol for PDCE (Fenske et al. CCS '17) is computationally expensive and not scalable enough to cope with big data applications, which prompted us to design a better protocol. Our further analysis revealed that if the cardinality to be estimated is large enough, our protocol can achieve (ϵ,δ) differential privacy automatically, without requiring any additional manipulation of the output. The result signifies a new approach for achieving differential privacy that departs from the mainstream approach (i.e. adding noise to the result). Free differential privacy can be achieved because of two reasons: secure computation minimizes information leakage, and the intrinsic estimation variance of the FM sketch makes the output of our protocol uncertain. We further show that the result is not just theoretical: the minimal cardinality for differential privacy to hold is only 102– 104for typical parameters.",
    "author": "Authors:Changhui Hu,Newcastle University;Jin Li,Guangzhou University;Zheli Liu, Xiaojie Guo, Yu Wei, and Xuan Guang,Nankai University;Grigorios Loukides,King's College London;Changyu Dong,Newcastle University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/hu-changhui",
    "comment": ""
  },
  {
    "title": "SLAP: Improving Physical Adversarial Examples with Short-Lived Adversarial Perturbations",
    "abstract": "Abstract:Research into adversarial examples (AE) has developed rapidly, yet static adversarial patches are still the main technique for conducting attacks in the real world, despite being obvious, semi-permanent and unmodifiable once deployed.In this paper, we propose Short-Lived Adversarial Perturbations (SLAP), a novel technique that allows adversaries to realize physically robust real-world AE by using a projector. Attackers can project specifically crafted adversarial perturbations onto real-world objects, transforming them into AE. This grants adversaries greater control over the attack compared to adversarial patches, as projections can be turned on and off as needed and leave no obvious trace of an attack.We study the feasibility of SLAP in the self-driving scenario, targeting both object detector and traffic sign recognition tasks, focusing on the detection of stop signs. We conduct experiments in a variety of ambient light conditions, including outdoors, showing how in non-bright settings the proposed method generates AE that are extremely robust, causing misclassifications on state-of-the-art neural networks with up to 99% success rate. Our experiments show that SLAP-generated AE do not present detectable behaviours seen in adversarial patches and therefore bypass SentiNet, a physical AE detection method. We evaluate other defences including an adaptive defender using adversarial learning which is able to thwart the attack effectiveness up to 80% even in favourable attacker conditions.",
    "author": "Authors:Giulio Lovisotto, Henry Turner, and Ivo Sluganovic,University of Oxford;Martin Strohmeier,armasuisse;Ivan Martinovic,University of Oxford",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/lovisotto",
    "comment": ""
  },
  {
    "title": "Compromised or Attacker-Owned: A Large Scale Classification and Study of Hosting Domains of Malicious URLs",
    "abstract": "Abstract:The mitigation action against a malicious website may differ greatly depending on how that site is hosted. If it is hosted under a private apex domain, where all its subdomains and pages are under the apex domain owner's direct control, we could block at the apex domain level. If it is hosted under a public apex domain though (e.g., a web hosting service provider), it would be more appropriate to block at the subdomain level. Further, for the former case, the private apex domain may be legitimate but compromised, or may be attacker-generated, which, again, would warrant different mitigation actions: attacker-owned apex domains could be blocked permanently, while only temporarily for compromised ones.In this paper, we study over eight hundred million VirusTotal (VT) URL scans from Aug. 1, 2019 to Nov. 18, 2019 and build the first content agnostic machine learning models to distinguish between the above mentioned different types of apex domains hosting malicious websites. Specifically, we first build a highly accurate model to distinguish between public and private apex domains. Then we build additional models to further distinguish compromised  domains from attacker-owned ones. Utilizing our trained models, we conduct a large-scale study of the host domains of malicious websites. We observe that even though public apex domains are less than 1% of the apexes hosting malicious websites, they amount to a whopping 46.5% malicious web pages seen in VT URL feeds during our study period. 19.5% of these public malicious websites are compromised. Out of the remaining websites (53.5%), which are hosted on private apexes, we observe that attackers mostly compromise benign websites (65.6%) to launch their attacks, whereas only 34.4% of malicious websites are hosted on domains registered by attackers. Overall, we observe the concerning trend that the majority (81.7%) of malicious websites are hosted under apex domains that attackers do not own.",
    "author": "Authors:Ravindu De Silva,SCoRe Lab and Qatar Computing Research Institute;Mohamed Nabeel,Qatar Computing Research Institute;Charith Elvitigala,SCoRe Lab;Issa Khalil and Ting Yu,Qatar Computing Research Institute;Chamath Keppitiyagama,University of Colombo School of Computing",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/desilva",
    "comment": ""
  },
  {
    "title": "Helping Users Automatically Find and Manage Sensitive, Expendable Files in Cloud Storage",
    "abstract": "Abstract:With the ubiquity of data breaches, forgotten-about files stored in the cloud create latent privacy risks. We take a holistic approach to help users identify sensitive, unwanted files in cloud storage. We first conducted 17 qualitative interviews to characterize factors that make humans perceive a file as sensitive, useful, and worthy of either protection or deletion. Building on our findings, we conducted a primarily quantitative online study. We showed 108 long-term users of Google Drive or Dropbox a selection of files from their accounts. They labeled and explained these files' sensitivity, usefulness, and desired management (whether they wanted to keep, delete, or protect them). For each file, we collected many metadata and content features, building a training dataset of 3,525 labeled files. We then built Aletheia, which predicts a file's perceived sensitivity and usefulness, as well as its desired management. Aletheia improves over state-of-the-art baselines by 26% to 159%, predicting users' desired file-management decisions with 79% accuracy. Notably, predicting subjective perceptions of usefulness and sensitivity led to a 10% absolute accuracy improvement in predicting desired file-management decisions. Aletheia's performance validates a human-centric approach to feature selection when using inference techniques on subjective security-related tasks. It also improves upon the state of the art in minimizing the attack surface of cloud accounts.",
    "author": "Authors:Mohammad Taha Khan,University of Illinois at Chicago / Washington & Lee University;Christopher Tran and Shubham Singh,University of Illinois at Chicago;Dimitri Vasilkov,University of Chicago;Chris Kanich,University of Illinois at Chicago;Blase Ur,University of Chicago;Elena Zheleva,University of Illinois at Chicago",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/khan-mohammad",
    "comment": ""
  },
  {
    "title": "The Circle Of Life: A Large-Scale Study of The IoT Malware Lifecycle",
    "abstract": "Abstract:Our current defenses against IoT malware may not be adequate to remediate an IoT malware attack similar to the Mirai botnet. This work seeks to investigate this matter by systematically and empirically studying the lifecycle of IoT malware and comparing it with traditional malware that target desktop and mobile platforms. We present a large-scale measurement of more than 166K Linux-based IoT malware samples collected over a year. We compare our results with prior works by systematizing desktop and mobile malware studies into a novel framework and answering key questions about defense readiness. Based on our findings, we deduce that the required technology to defend against IoT malware is available, but we conclude that there are insufficient efforts in place to deal with a large-scale IoT malware infection breakout.",
    "author": "Authors:Omar Alrawi, Charles Lever, and Kevin Valakuzhy,Georgia Institute of Technology;Ryan Court and Kevin Snow,Zero Point Dynamics;Fabian Monrose,University of North Carolina at Chapel Hill;Manos Antonakakis,Georgia Institute of Technology",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/alrawi-circle",
    "comment": ""
  },
  {
    "title": "Inexpensive Brainwave Authentication: New Techniques and Insights on User Acceptance",
    "abstract": "Abstract:Brainwaves have proved to be unique enough across individuals to be useful as biometrics. They also provide promising advantages over traditional means of authentication, such as resistance to external observability, revocability, and intrinsic liveness detection. However, most of the research so far has been conducted with expensive, bulky, medical-grade helmets, which offer limited applicability for everyday usage. With the aim to bring brainwave authentication and its benefits closer to real world deployment, we investigate brain biometrics with consumer devices. We conduct a comprehensive experiment that compares five authentication tasks on a user sample up to 10 times larger than those from previous studies, introducing three novel techniques based on cognitive semantic processing. We analyze both the performance and usability of the different options and use this evidence to elicit design and research recommendations. Our results show that it is possible to achieve Equal Error Rates of 14.5% (a reduction between 37%-44% with respect to existing approaches) based on brain responses to images with current inexpensive technology. With regard to adoption, users call for simpler devices, faster authentication, and better privacy.",
    "author": "Authors:Patricia Arias-Cabarcos,KASTEL/KIT;Thilo Habrich, Karen Becker, and Christian Becker,University of Mannheim;Thorsten Strufe,KASTEL/KIT",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/arias-cabarcos",
    "comment": ""
  },
  {
    "title": "MAZE: Towards Automated Heap Feng Shui",
    "abstract": "Abstract:A large number of memory corruption vulnerabilities, e.g., heap overflow and use after free (UAF), could only be exploited in specific heap layouts via techniques like heap feng shui. To pave the way for automated exploit generation (AEG), automated heap layout manipulation is demanded.In this paper, we present a novel solution MAZE to manipulate proof-of-concept (POC) samples' heap layouts. It first identifies heap layout primitives (i.e., input fragments or code snippets) available for users to manipulate the heap. Then, it applies a novel Dig & Fill algorithm, which models the problem as a Linear Diophantine Equation and solves it deterministically, to infer a primitive operation sequence that is able to generate target heap layout.We implemented a prototype of MAZE based on the analysis engine S2E, and evaluated it on the PHP, Python and Perl interpreters and a set of CTF (capture the flag) programs, as well as a large micro-benchmark. Results showed that MAZE could generate expected heap layouts for over 90% of them.",
    "author": "Authors:Yan Wang,{CAS-KLONAT, BKLONSPT}, Institute of Information Engineering, Chinese Academy of Sciences; WeiRan Lab, Huawei Technologies;Chao Zhang,BNRist & Institute for Network Science and Cyberspace, Tsinghua University; Tsinghua University-QI-ANXIN Group JCNS;Zixuan Zhao, Bolun Zhang, Xiaorui Gong, and Wei Zou,{CAS-KLONAT, BKLONSPT}, Institute of Information Engineering, Chinese Academy of Sciences; School of Cyber Security, University of Chinese Academy of Sciences",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/wang-yan",
    "comment": ""
  },
  {
    "title": "SelectiveTaint: Efficient Data Flow Tracking With Static Binary Rewriting",
    "abstract": "Abstract:Taint analysis has been widely used in many security applications such as exploit detection, information flow tracking, malware analysis, and protocol reverse engineering. State-of-the-art taint analysis tools are usually built atop dynamic binary instrumentation, which instruments at every possible instruction, and rely on runtime information to decide whether a particular instruction involves taint or not, thereby usually having high performance overhead. This paper presents SelectiveTaint, an efficient selective taint analysis framework for binary executables. The key idea is to selectively instrument the instructions involving taint analysis using static binary rewriting instead of dynamic binary instrumentation. At a high level, SelectiveTaint statically scans taint sources of interest in the binary code, leverages value set analysis to conservatively determine whether an instruction operand needs to be tainted or not, and then selectively taints the instructions of interest. We have implemented SelectiveTaint and evaluated it with a set of binary programs including 16 coreutils (focusing on file I/O) and five network daemon programs (focusing on network I/O) such as nginx web server. Our evaluation results show that the binaries statically instrumented by SelectiveTaint has superior performance compared to the state-of-the-art dynamic taint analysis frameworks (e.g., 1.7xfaster than that of libdft).",
    "author": "Authors:Sanchuan Chen, Zhiqiang Lin, and Yinqian Zhang,The Ohio State University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/chen-sanchuan",
    "comment": ""
  },
  {
    "title": "Experiences Deploying Multi-Vantage-Point Domain Validation at Let's Encrypt",
    "abstract": "Abstract:An attacker can obtain a valid TLS certificate for a domain by hijacking communication between a certificate authority (CA) and a victim domain. Performing domain validation from multiple vantage points can defend against these attacks. We explore the design space of multi-vantage-point domain validation to achieve (1)securityvia sufficiently diverse vantage points, (2)performanceby ensuring low latency and overhead in certificate issuance, (3)manageabilityby complying with CA/Browser forum requirements, and requiring minimal changes to CA operations, and (4) a lowbenign failurerate for legitimate requests. Our opensource implementation was deployed by the Let's Encrypt CA in February 2020, and has since secured the issuance of more than half a billion certificates during the first year of its deployment. Using real-world operational data from Let's Encrypt, we show that our approach has negligible latency and communication overhead, and a benign failure rate comparable to conventional designs with one vantage point. Finally, we evaluate the security improvements using a combination of ethically conducted real-world BGP hijacks, Internet-scale traceroute experiments, and a novel BGP simulation framework. We show that multi-vantage-point domain validation can thwart the vast majority of BGP attacks. Our work motivates the deployment of multi-vantage-point domain validation across the CA ecosystem to strengthen TLS certificate issuance and user privacy.",
    "author": "Authors:Henry Birge-Lee and Liang Wang,Princeton University;Daniel McCarney,Square Inc.;Roland Shoemaker,unaffiliated;Jennifer Rexford and Prateek Mittal,Princeton University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/birge-lee",
    "comment": ""
  },
  {
    "title": "Coco: Co-Design and Co-Verification of Masked Software Implementations on CPUs",
    "abstract": "Abstract:The protection of cryptographic implementations against power analysis attacks is of critical importance for many applications in embedded systems. The typical approach of protecting against these attacks is to implement algorithmic countermeasures, like masking. However, implementing these countermeasures in a secure and correct manner is challenging. Masking schemes require the independent processing of secret shares, which is a property that is often violated by CPU microarchitectures in practice. In order to write leakage-free code, the typical approach in practice is to iteratively explore instruction sequences and to empirically verify whether there is leakage caused by the hardware for this instruction sequence or not. Clearly, this approach is neither efficient, nor does it lead to rigorous security statements.In this paper, we overcome the current situation and present the first approach for co-design and co-verification of masked software implementations on CPUs. First, we present Coco, a tool that allows us to provide security proofs at the gate-level for the execution of a masked software implementation on a concrete CPU. Using Coco, we analyze the popular 32-bit RISC-V Ibex core, identify all design aspects that violate the security of our tested masked software implementations and perform corrections, mostly in hardware. The resulting secured Ibex core has an area overhead around 10%, the runtime of software on this core is largely unaffected, and the formal verification with Coco of an, e.g., first-order masked Keccak S-box running on the secured Ibex core takes around 156 seconds. To demonstrate the effectiveness of our suggested design modifications, we perform practical leakage assessments using an FPGA evaluation board.",
    "author": "Authors:Barbara Gigerl, Vedad Hadzic, and Robert Primas,Graz University of Technology;Stefan Mangard,Graz University of Technology, Lamarr Security Research;Roderick Bloem,Graz University of Technology",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/gigerl",
    "comment": ""
  },
  {
    "title": "Reducing Bias in Modeling Real-world Password Strength via Deep Learning and Dynamic Dictionaries",
    "abstract": "Abstract:Password security hinges on an in-depth understanding of the techniques adopted by attackers. Unfortunately, real-world adversaries resort to pragmatic guessing strategies such as dictionary attacks that are inherently difficult to model in password security studies. In order to be representative of the actual threat, dictionary attacks must be thoughtfully configured and tuned. However, this process requires a domain-knowledge and expertise that cannot be easily replicated. The consequence of inaccurately calibrating dictionary attacks is the unreliability of password security analyses, impaired by a severe measurement bias.In the present work, we introduce a new generation of dictionary attacks that is consistently more resilient to inadequate configurations. Requiring no supervision or domain-knowledge, this technique automatically approximates the advanced guessing strategies adopted by real-world attackers. To achieve this: (1) We use deep neural networks to model the proficiency of adversaries in building attack configurations. (2) Then, we introduce dynamic guessing strategies within dictionary attacks. These mimic experts' ability to adapt their guessing strategies on the fly by incorporating knowledge on their targets.Our techniques enable more robust and sound password strength estimates within dictionary attacks, eventually reducing overestimation in modeling real-world threats in password security.",
    "author": "Authors:Dario Pasquini,Sapienza University of Rome, Institute of Applied Computing CNR;Marco Cianfriglia,Institute of Applied Computing CNR;Giuseppe Ateniese,Stevens Institute of Technology;Massimo Bernaschi,Institute of Applied Computing CNR",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/pasquini",
    "comment": ""
  },
  {
    "title": "WaveGuard: Understanding and Mitigating Audio Adversarial Examples",
    "abstract": "Abstract:There has been a recent surge in adversarial attacks on deep learning based automatic speech recognition (ASR) systems. These attacks pose new challenges to deep learning security and have raised significant concerns in deploying ASR systems in safety-critical applications. In this work, we introduce WaveGuard: a framework for detecting adversarial inputs that are crafted to attack ASR systems. Our framework incorporates audio transformation functions and analyses the ASR transcriptions of the original and transformed audio to detect adversarial inputs. We demonstrate that our defense framework is able to reliably detect adversarial examples constructed by four recent audio adversarial attacks, with a variety of audio transformation functions. With careful regard for best practices in defense evaluations, we analyze our proposed defense and its strength to withstand adaptive and robust attacks in the audio domain. We empirically demonstrate that audio transformations that recover audio from perceptually informed representations can lead to a strong defense that is robust against an adaptive adversary even in a complete white-box setting. Furthermore, WaveGuard can be used out-of-the box and integrated directly with any ASR model to efficiently detect audio adversarial examples, without the need for model retraining.",
    "author": "Authors:Shehzeen Hussain, Paarth Neekhara, Shlomo Dubnov, Julian McAuley, and Farinaz Koushanfar,University of California, San Diego",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/hussain",
    "comment": ""
  },
  {
    "title": "Using Amnesia to Detect Credential Database Breaches",
    "abstract": "Abstract:Known approaches for using decoy passwords (honeywords) to detect credential database breaches suffer from the need for a trusted component to recognize decoys when entered in login attempts, and from an attacker's ability to test stolen passwords atothersites to identify user-chosen passwords based on their reuse at those sites.  Amnesia is a framework that resolves these difficulties.  Amnesia requires no secret state to detect the entry of honeywords and additionally allows a site to monitor for the entry of its decoy passwords elsewhere.  We quantify the benefits of Amnesia using probabilistic model checking and the practicality of this framework through measurements of a working implementation.",
    "author": "Authors:Ke Coby Wang,University of North Carolina at Chapel Hill;Michael K. Reiter,Duke University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/wang-ke-coby",
    "comment": ""
  },
  {
    "title": "Undo Workarounds for Kernel Bugs",
    "abstract": "Abstract:OS kernels are full of bugs resulting in security, reliability, and usability issues. Several kernel fuzzers have recently been developed to find these bugs and have proven to be effective.\n Yet, bugs take several months to be patched once they are discovered. In this window of vulnerability, bugs continue to pose concerns. We present workarounds for kernel bugs, called bowknots, which maintain the functionality of the system even when bugs are triggered, are applicable to many kernel bugs, do not cause noticeable performance overhead, and have a small kernel footprint. The key idea behind bowknots is to undo the side effects of the in-flight syscall that triggers a bug, effectively neutralizing the syscall. We also present a static analysis tool, called Hecaton, that generates bowknots automatically and inserts them into the kernel. Through extensive evaluations on the kernel of Android devices as well as x86 upstream kernels, we demonstrate that bowknots are effective in mitigating kernel bugs and vulnerabilities. We also show that Hecaton is capable of generating the right bowknots fully automatically in majority of cases, and requires minimal help from the analyst for the rest. Finally, we demonstrate the benefits of bowknots in improving the efficiency of kernel fuzzing by eliminating repetitive reboots.",
    "author": "Authors:Seyed Mohammadjavad Seyed Talebi, Zhihao Yao, and Ardalan Amiri Sani,UC Irvine;Zhiyun Qian,UC Riverside;Daniel Austin,Atlassian",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/talebi",
    "comment": ""
  },
  {
    "title": "SMASH: Synchronized Many-sided Rowhammer Attacks from JavaScript",
    "abstract": "Abstract:Despite their in-DRAM Target Row Refresh (TRR) mitigations, some of the most recent DDR4 modules are still vulnerable to many-sided Rowhammer bit flips. While these bit flips are exploitable from native code, triggering them in the browser from JavaScript faces three nontrivial challenges. First, given the lack of cache flushing instructions in JavaScript, existing eviction-based Rowhammer attacks are already slow for the older single- or double-sided variants and thus not always effective. With many-sided Rowhammer, mounting effective attacks is even more challenging, as it requires the eviction of many different aggressor addresses from the CPU caches. Second, the most effective many-sided variants, known asn-sided, require large physically-contiguous memory regions which are not available in JavaScript. Finally, as we show for the first time, eviction-based Rowhammer attacks require proper synchronization to bypass in-DRAM TRR mitigations.Using a number of novel insights, we overcome these challenges to build SMASH (Synchronized MAny-Sided Hammering), a technique to succesfully trigger Rowhammer bit flips from JavaScript on modern DDR4 systems. To mount effective attacks, SMASH exploits high-level knowledge of cache replacement policies to generate optimal access patterns for eviction-based many-sided Rowhammer. To lift the requirement for large physically-contiguous memory regions, SMASH decomposesn-sided Rowhammer into multiple double-sided pairs, which we can identify using slice coloring. Finally, to bypass the in-DRAM TRR mitigations, SMASH carefully schedules cache hits and misses to successfully triggersynchronized many-sided Rowhammerbit flips. We showcase SMASH with an end-to-end JavaScript exploit which can fully compromise the Firefox browser in 15 minutes on average.",
    "author": "Authors:Finn de Ridder,ETH Zurich and VU Amsterdam;Pietro Frigo, Emanuele Vannacci, Herbert Bos, and Cristiano Giuffrida,VU Amsterdam;Kaveh Razavi,ETH Zurich",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/ridder",
    "comment": ""
  },
  {
    "title": "ICSFuzz: Manipulating I/Os and Repurposing Binary Code to Enable Instrumented Fuzzing in ICS Control Applications",
    "abstract": "Abstract:Industrial Control Systems (ICS) have seen a rapid proliferation in the last decade amplified by the advent of the 4th Industrial Revolution. At the same time, several notable cybersecurity incidents in industrial environments have underlined the lack of depth in security evaluation of industrial devices such as Programmable Logic Controllers (PLC). Modern PLCs are based on widely used microprocessors and deploy commodity operating systems (e.g., ARM on Linux). Thus, threats from the information technology domain can be readily ported to industrial environments. PLC application binaries in particular have never been considered as regular programs able to introduce traditional security threats, such as buffer overflows. In this work, we investigate the feasibility of exploiting PLC binaries as well as their surrounding PLC-specific environment. We examine binaries produced by all available IEC 61131-3 control system programming languages for compilation-based differences and introduced vulnerabilities. Driven by this analysis, we develop a fuzzing framework to perform security evaluation of the PLC binaries along with the host functions they interact with. Fuzzing such non-executable binaries is non-trivial, as they operate with real-time constraints and receive their inputs from peripherals. To prove the correctness of our fuzzing tool, we use a database of in-house developed binaries in addition to functional control applications collected from online repositories. We showcase the efficacy of our technique by demonstrating uncovered vulnerabilities in both control application binaries and their runtime system. Furthermore, we demonstrate an exploitation methodology for an in-house as well as a regular control binary, based on the uncovered vulnerabilities.",
    "author": "Authors:Dimitrios Tychalas,NYU Tandon School of Engineering;Hadjer Benkraouda and Michail Maniatakos,New York University Abu Dhabi",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/tychalas",
    "comment": ""
  },
  {
    "title": "DeepReflect: Discovering Malicious Functionality through Binary Reconstruction",
    "abstract": "Abstract:Deep learning has continued to show promising results for malware classification. However, to identify key malicious behaviors, malware analysts are still tasked with reverse engineering unknown malware binaries using static analysis tools, which can take hours. Although machine learning can be used to help identify important parts of a binary, supervised approaches are impractical due to the expense of acquiring a sufficiently large labeled dataset.To increase the productivity of static (or manual) reverse engineering, we propose DeepReflect: a tool for localizing and identifying malware components within a malicious binary. To localize malware components, we use an unsupervised deep neural network in a novel way, and classify the components through a semi-supervised cluster analysis, where analysts incrementally provide labels during their daily work flow. The tool is practical since it requires no data labeling to train the localization model, and minimal/noninvasive labeling to train the classifier incrementally.In our evaluation with five malware analysts on over 26k malware samples, we found that DeepReflect reduces the number of functions that an analyst  needs to reverse engineer by 85% on average. Our approach also detects 80% of the malware components compared to 43% when using a signature-based tool (CAPA). Furthermore, DeepReflect performs better with our proposed autoencoder than SHAP (an AI explanation tool). This is significant because SHAP, a state-of-the-art method, requires a labeled dataset and autoencoders do not.",
    "author": "Authors:Evan Downing,Georgia Institute of Technology;Yisroel Mirsky,Georgia Institute of Technology & Ben-Gurion University;Kyuhong Park and Wenke Lee,Georgia Institute of Technology",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/downing",
    "comment": ""
  },
  {
    "title": "What's in a Name? Exploring CA Certificate Control",
    "abstract": "Abstract:TLS clients rely on a supporting PKI in which certificate authorities (CAs)—trusted organizations—validate and cryptographically attest to the identities of web servers. A client's confidence that it is connecting to the right server depends entirely on the set of CAs that it trusts. However, as we demonstrate in this work, the identity specified in CA certificates is frequently inaccurate due to lax naming requirements, ownership changes, and long-lived certificates. This not only muddles client selection of trusted CAs, but also prevents PKI operators and researchers from correctly attributing CA certificate issues to CA organizations. To help Web PKI participants understand the organizations that control each CA certificate, we develop Fides, a system that models and clusters CA operational behavior in order to detect CA certificates under shared operational control. We label the clusters that Fides uncovers, and build a new database of CA ownership that corrects the CA operator for 241 CA certificates, and expands coverage to 651 new CA certificates, leading to a more complete picture of CA certificate control.",
    "author": "Authors:Zane Ma and Joshua Mason,University of Illinois at Urbana-Champaign;Manos Antonakakis,Georgia Institute of Technology;Zakir Durumeric,Stanford University;Michael Bailey,University of Illinois at Urbana-Champaign",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/ma",
    "comment": ""
  },
  {
    "title": "ALPACA: Application Layer Protocol Confusion - Analyzing and Mitigating Cracks in TLS Authentication",
    "abstract": "Abstract:TLS is widely used to add confidentiality, authenticity and integrity to application layer protocols such as HTTP, SMTP, IMAP, POP3, and FTP. However, TLS does not bind a TCP connection to the intended application layer protocol. This allows a man-in-the-middle attacker to redirect TLS traffic to a different TLS service endpoint on another IP address and/or port. For example, if subdomains share a wildcard certificate, an attacker can redirect traffic from one subdomain to another, resulting in a valid TLS session. This breaks the authentication of TLS and cross-protocol attacks may be possible where the behavior of one service may compromise the security of the other at the application layer.In this paper, we investigate cross-protocol attacks on TLS in general and conduct a systematic case study on web servers, redirecting HTTPS requests from a victim's web browser to SMTP, IMAP, POP3, and FTP servers. We show that in realistic scenarios, the attacker can extract session cookies and other private user data or execute arbitrary JavaScript in the context of the vulnerable web server, therefore bypassing TLS and web application security.We evaluate the real-world attack surface of web browsers and widely-deployed email and FTP servers in lab experiments and with internet-wide scans. We find that 1.4M web servers are generally vulnerable to cross-protocol attacks, i.e., TLS application data confusion is possible.  Of these, 114k web servers can be attacked using an exploitable application server. Finally, we discuss the effectiveness of TLS extensions such as Application Layer Protocol Negotiation (ALPN) and Server Name Indiciation (SNI) in mitigating these and other cross-protocol attacks.",
    "author": "Authors:Marcus Brinkmann,Ruhr University Bochum;Christian Dresen,Münster University of Applied Sciences;Robert Merget,Ruhr University Bochum;Damian Poddebniak,Münster University of Applied Sciences;Jens Müller,Ruhr University Bochum;Juraj Somorovsky,Paderborn University;Jörg Schwenk,Ruhr University Bochum;Sebastian Schinzel,Münster University of Applied Sciences",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/brinkmann",
    "comment": ""
  },
  {
    "title": "PrivateDrop: Practical Privacy-Preserving Authentication for Apple AirDrop",
    "abstract": "Abstract:Apple's offline file-sharing service AirDrop is integrated into more than 1.5 billion end-user devices worldwide. We discovered two design flaws in the underlying protocol that allow attackers to learn the phone numbers and email addresses of both sender and receiver devices. As a remediation, we study the applicability of private set intersection (PSI) to mutual authentication, which is similar to contact discovery in mobile messengers. We propose a novel optimized PSI-based protocol called PrivateDrop that addresses the specific challenges of offline resource-constrained operation and integrates seamlessly into the current AirDrop protocol stack. Using our native PrivateDrop implementation for iOS and macOS, we experimentally demonstrate that PrivateDrop preserves AirDrop's exemplary user experience with an authentication delay well below one second. We responsibly disclosed our findings to Apple and open-sourced our PrivateDrop implementation.",
    "author": "Authors:Alexander Heinrich, Matthias Hollick, Thomas Schneider, Milan Stute, and Christian Weinert,TU Darmstadt",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/heinrich",
    "comment": ""
  },
  {
    "title": "Graph Backdoor",
    "abstract": "Abstract:One intriguing property of deep neural networks (DNNs) is their inherent vulnerability to backdoor attacks—a trojan model responds to trigger-embedded inputs in a highly predictable manner while functioning normally otherwise. Despite the plethora of prior work on DNNs for continuous data (e.g., images), the vulnerability of graph neural networks (GNNs) for discrete-structured data (e.g., graphs) is largely unexplored, which is highly concerning given their increasing use in security-sensitive domains.To bridge this gap, we present GTA, the first backdoor attack on GNNs. Compared with prior work, GTA departs in significant ways: graph-oriented—it defines triggers as specific subgraphs, including both topological structures and descriptive features, entailing a large design spectrum for the adversary; input-tailored—it dynamically adapts triggers to individual graphs, thereby optimizing both attack effectiveness and evasiveness; downstream model-agnostic—it can be readily launched without knowledge regarding downstream models or fine-tuning strategies; and attack-extensible—it can be instantiated for both transductive (e.g., node classification) and inductive (e.g., graph classification) tasks, constituting severe threats for a range of security-critical applications. Through extensive evaluation using benchmark datasets and state-of-the-art models, we demonstrate the effectiveness of GTA. We further provide analytical justification for its effectiveness and discuss potential countermeasures, pointing to several promising research directions.",
    "author": "Authors:Zhaohan Xi and Ren Pang,Pennsylvania State University;Shouling Ji,Zhejiang University;Ting Wang,Pennsylvania State University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/xi",
    "comment": ""
  },
  {
    "title": "Prime+Probe 1, JavaScript 0: Overcoming Browser-based Side-Channel Defenses",
    "abstract": "Abstract:The \"eternal war in cache\" has reached browsers, with multiple cache-based side-channel attacks and countermeasures being suggested. A common approach for countermeasures is to disable or restrict JavaScript features deemed essential for carrying out attacks.To assess the effectiveness of this approach, in this work we seek to identify those JavaScript features which are essential for carrying out a cache-based attack. We develop a sequence of attacks with progressively decreasing dependency on JavaScript features, culminating in the first browser-based side-channel attack which is constructed entirely from Cascading Style Sheets (CSS) and HTML, and works even when script execution is completely blocked. We then show that  avoiding JavaScript  features makes our techniques architecturally agnostic,  resulting in microarchitectural website fingerprinting attacks that work across hardware platforms including Intel Core, AMD Ryzen, Samsung Exynos, and Apple M1 architectures.As a final contribution, we evaluate our techniques in hardened browser environments including the Tor browser, DeterFox (Cao et al., CCS 2017), and Chrome Zero (Schwartz et al., NDSS 2018). We confirm that none of these approaches completely defend against our attacks. We further argue that the protections of Chrome Zero need to be more comprehensively applied, and that the performance and user experience of Chrome Zero will be severely degraded if this approach is taken.",
    "author": "Authors:Anatoly Shusterman,Ben-Gurion University of the Negev;Ayush Agarwal,University of Michigan;Sioli O'Connell,University of Adelaide;Daniel Genkin,University of Michigan;Yossi Oren,Ben-Gurion University of the Negev;Yuval Yarom,University of Adelaide and Data61",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/shusterman",
    "comment": ""
  },
  {
    "title": "Swivel: Hardening WebAssembly against Spectre",
    "abstract": "Abstract:We describe Swivel, a new compiler framework for hardening WebAssembly (Wasm) against Spectre attacks. Outside the browser, Wasm has become a popular lightweight, in-process sandbox and is, for example, used in production to isolate different clients on edge clouds and function-as-a-service platforms. Unfortunately, Spectre attacks can bypass Wasm's isolation guarantees. Swivel hardens Wasm against this class of attacks by ensuring that potentially malicious code can neither use Spectre attacks to break out of the Wasm sandbox nor coerce victim code—another Wasm client or the embedding process—to leak secret data.We describe two Swivel designs, a software-only approach that can be used on existing CPUs, and a hardware-assisted approach that uses extension available in Intel® 11th generation CPUs. For both, we evaluate a randomized approach that mitigates Spectre and a deterministic approach that eliminates Spectre altogether. Our randomized implementations impose under 10.3% overhead on the Wasm-compatible subset of SPEC 2006, while our deterministic implementations impose overheads between 3.3% and 240.2%. Though high on some benchmarks, Swivel's overhead is still between 9× and 36.3× smaller than existing defenses that rely on pipeline fences.",
    "author": "Authors:Shravan Narayan and Craig Disselkoen,UC San Diego;Daniel Moghimi,Worcester Polytechnic Institute and UC San Diego;Sunjay Cauligi, Evan Johnson, and Zhao Gang,UC San Diego;Anjo Vahldiek-Oberwagner,Intel Labs;Ravi Sahita,Intel;Hovav Shacham,UT Austin;Dean Tullsen and Deian Stefan,UC San Diego",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/narayan",
    "comment": ""
  },
  {
    "title": "Entangled Watermarks as a Defense against Model Extraction",
    "abstract": "Abstract:Machine learning involves expensive data collection and training procedures. Model owners may be concerned that valuable intellectual property can be leaked if adversaries mount model extraction attacks. As it is difficult to defend against model extraction without sacrificing significant prediction accuracy, watermarking instead leveragesunused model capacityto have the model overfit to outlier input-output pairs. Such pairs are watermarks, which are not sampled from the task distribution and are only known to the defender. The defender then demonstrates knowledge of the input-output pairs to claim ownership of the model at inference. The effectiveness of watermarks remains limited because they are distinct from the task distribution and can thus be easily removed through compression or other forms of knowledge transfer.We introduceEntangled Watermarking Embeddings (EWE). Our approach encourages the model to learn features for classifying data that is sampled from thetask distribution and data that encodes watermarks. An adversary attempting to remove watermarks that are entangled with legitimate data is alsoforced to sacrifice performanceon legitimate data. Experiments on MNIST, Fashion-MNIST, CIFAR-10, and Speech Commands validate that the defender can claim model ownership with 95% confidence with less than 100 queries to the stolen copy, at a modest cost below 0.81 percentage points on average in the defended model's performance.",
    "author": "Authors:Hengrui Jia and Christopher A. Choquette-Choo,University of Toronto and Vector Institute;Varun Chandrasekaran,University of Wisconsin-Madison;Nicolas Papernot,University of Toronto and Vector Institute",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/jia",
    "comment": ""
  },
  {
    "title": "Mind Your Weight(s): A Large-scale Study on Insufficient Machine Learning Model Protection in Mobile Apps",
    "abstract": "Abstract:On-device machine learning (ML) is quickly gaining popularity among mobile apps. It allows offline model inference while preserving user privacy. However, ML models, considered as core intellectual properties of model owners, are now stored on billions of untrusted devices and subject to potential thefts. Leaked models can cause both severe financial loss and security consequences. This paper presents the first empirical study of ML model protection on mobile devices. Our study aims to answer three open questions with quantitative evidence: How widely is model protection used in apps? How robust are existing model protection techniques? What impacts can (stolen) models incur? To that end, we built a simple app analysis pipeline and analyzed 46,753 popular apps collected from the US and Chinese app markets. We identified 1,468 ML apps spanning all popular app categories. We found that, alarmingly, 41% of ML apps do not protect their models at all, which can be trivially stolen from app packages. Even for those apps that use model protection or encryption, we were able to extract the models from 66% of them via unsophisticated dynamic analysis techniques. The extracted models are mostly commercial products and used for face recognition, liveness detection, ID/bank card recognition, and malware detection. We quantitatively estimated the potential financial and security impact of a leaked model, which can amount to millions of dollars for different stakeholders. Our study reveals that on-device models are currently at high risk of being leaked; attackers are highly motivated to steal such models. Drawn from our large-scale study, we report our insights into this emerging security problem and discuss the technical challenges, hoping to inspire future research on robust and practical model protection for mobile devices.",
    "author": "Authors:Zhichuang Sun, Ruimin Sun, Long Lu, and Alan Mislove,Northeastern University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/sun-zhichuang",
    "comment": ""
  },
  {
    "title": "Breaking Through Binaries: Compiler-quality Instrumentation for Better Binary-only Fuzzing",
    "abstract": "Abstract:Coverage-guided fuzzing is one of the most effective software security testing techniques. Fuzzing takes on one of two forms: compiler-based or binary-only, depending on the availability of source code. While the fuzzing community has improved compiler-based fuzzing with performance- and feedback-enhancing program transformations, binary-only fuzzing lags behind due to the semantic and performance limitations of instrumenting code at the binary level. Many fuzzing use cases are binary-only (i.e., closed source). Thus, applying fuzzing-enhancing program transformations to binary-only fuzzing—without sacrificing performance—remains a compelling challenge. This paper examines the properties required to achieve compiler-quality binary-only fuzzing instrumentation. Based on our findings, we design ZAFL: a platform for applying fuzzing-enhancing program transformations to binary-only targets—maintaining compiler-level performance. We showcase ZAFL's capabilities in an implementation for the popular fuzzer AFL, including five compiler-style fuzzing-enhancing transformations, and evaluate it against the leading binary-only fuzzing instrumenters AFL-QEMU and AFL-Dyninst. Across LAVA-M and real-world targets, ZAFL improves crash-finding by 26–96% and 37–131%; and throughput by 48– 78% and 159–203% compared to AFL-Dyninst and AFL-QEMU, respectively—while maintaining compiler-level of overhead of 27%. We also show that ZAFL supports real-world open- and closed-source software of varying size (10K– 100MB), complexity (100–1M basic blocks), platform (Linux and Windows), and format (e.g., stripped and PIC).",
    "author": "Authors:Stefan Nagy,Virginia Tech;Anh Nguyen-Tuong, Jason D. Hiser, and Jack W. Davidson,University of Virginia;Matthew Hicks,Virginia Tech",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/nagy",
    "comment": ""
  },
  {
    "title": "Cost-Aware Robust Tree Ensembles for Security Applications",
    "abstract": "Abstract:There are various costs for attackers to manipulate the features of security classifiers. The costs are asymmetric across features and to the directions of changes, which cannot be precisely captured by existing cost models based on Lp-norm robustness. In this paper, we utilize such domain knowledge to increase the attack cost of evading classifiers, specifically, tree ensemble models that are widely used by security tasks. We propose a new cost modeling method to capture the feature manipulation cost as constraint, and then we integrate the cost-driven constraint into the node construction process to train robust tree ensembles. During the training process, we use the constraint to find data points that are likely to be perturbed given the feature manipulation cost, and we use a new robust training algorithm to optimize the quality of the trees. Our cost-aware training method can be applied to different types of tree ensembles, including gradient boosted decision trees and random forest models. Using Twitter spam detection as the case study, our evaluation results show that we can increase the attack cost by 10.6X compared to the baseline. Moreover, our robust training method using cost-driven constraint can achieve higher accuracy, lower false positive rate, and stronger cost-aware robustness than the state-of-the-art training method using L∞-norm cost model. Our code is available athttps://github.com/surrealyz/growtrees.",
    "author": "Authors:Yizheng Chen, Shiqi Wang, Weifan Jiang, Asaf Cidon, and Suman Jana,Columbia University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/chen-yizheng",
    "comment": ""
  },
  {
    "title": "Too Good to Be Safe: Tricking Lane Detection in Autonomous Driving with Crafted Perturbations",
    "abstract": "Abstract:Autonomous driving is developing rapidly and has achieved promising performance by adopting machine learning algorithms to finish various tasks automatically. Lane detection is one of the major tasks because its result directly affects the steering decisions. Although recent studies have discovered some vulnerabilities in autonomous vehicles, to the best of our knowledge, none has investigated the security of lane detection module in real vehicles. In this paper, we conduct the first investigation on the lane detection module in a real vehicle, and reveal that the over-sensitivity of the target module can be exploited to launch attacks on the vehicle. More precisely, an over-sensitive lane detection module may regard small markings on the road surface, which are introduced by an adversary, as a valid lane and then drive the vehicle in the wrong direction. It is challenging to design such small road markings that should be perceived by the lane detection module but unnoticeable to the driver. Manual manipulation of the road markings to launch attacks on the lane detection module is very labor-intensive and error-prone. We propose a novel two-stage approach to automatically determine such road markings after tackling several technical challenges. Our approach first decides the optimal perturbations on the camera image and then maps them to road markings in physical world. We conduct extensive experiments on a Tesla Model S vehicle, and the experimental results show that the lane detection module can be deceived by very unobtrusive perturbations to create a lane, thus misleading the vehicle in auto-steer mode.",
    "author": "Authors:Pengfei Jing,The Hong Kong Polytechnic University and Keen Security Lab, Tencent;Qiyi Tang and Yuefeng Du,Keen Security Lab, Tencent;Lei Xue and Xiapu Luo,The Hong Kong Polytechnic University;Ting Wang,Pennsylvania State University;Sen Nie and Shi Wu,Keen Security Lab, Tencent",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/jing",
    "comment": ""
  },
  {
    "title": "On the Routing-Aware Peering against Network-Eclipse Attacks in Bitcoin",
    "abstract": "Abstract:Safeguarding blockchain peer-to-peer (P2P) networks is more critical than ever in light of recent network attacks. Bitcoin has been successfully handling traditional Sybil and eclipse attacks; however, a recent Erebus attack [Tran et al. IEEE S&P'20]  shows that effectively eclipsing a Bitcoin node is possible when the attack is combined with a network-Sybil capability; i.e., a malicious transit network can create millions or more Sybil identities. Given the immediate availability and stealthiness of the Erebus attack, Bitcoin Core has quickly implemented a few simple protocol/parameter changes to mitigate it. Our large-scale evaluations of these quick patches and three similar carefully-designed protocol tweaks confirm that, unfortunately, no simple solution can effectively handle the attack. This paper focuses on a more fundamental solution called routing-aware peering (or RAP), a proven silver bullet in detecting and circumventing similar network adversaries in other P2P networks. However, we show that, contrary to our expectation, preventing the Erebus attacks with RAP is only wishful thinking. We discover that Erebus adversaries can exploit a tiny portion of route inference errors in any RAP implementations, which gives an asymmetric advantage to the network adversaries and renders all RAP approaches ineffective. To that end, we propose an integrated defense framework that composes the available simple protocol tweaks and RAP implementation. In particular, we show that a highly customizable defense profile is required for individual Bitcoin nodes because RAP's efficacy depends significantly on where a Bitcoin node is located on the Internet topology. We present an algorithm that outputs a custom optimal defense profile that prevents most of Erebus attacks from the top-100 large transit networks.",
    "author": "Authors:Muoi Tran and Akshaye Shenoi,National University of Singapore;Min Suk Kang,KAIST",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/tran",
    "comment": ""
  },
  {
    "title": "MBA-Blast: Unveiling and Simplifying Mixed Boolean-Arithmetic Obfuscation",
    "abstract": "Abstract:Mixed Boolean-Arithmetic (MBA) obfuscation is a method to perform a\nsemantics-preserving transformation from a simple expression to a\nrepresentation that is hard to understand and analyze. More\nspecifically, this obfuscation technique consists of the mixture\nusage of arithmetic operations (e.g., ADD and IMUL) and Boolean\noperations (e.g., AND, OR, and NOT). Binary code with MBA\nobfuscation can effectively hide the secret data/algorithm from both\nstatic and dynamic reverse engineering, including advanced analyses\nutilizing SMT solvers. Unfortunately, deobfuscation research against\nMBA is still in its infancy: state-of-the-art solutions such as\npattern matching, bit-blasting, and program synthesis either suffer\nfrom severe performance penalties, are designed for specific MBA\npatterns, or generate too many false simplification results in\npractice.In this paper, we first demystify the underlying mechanism of MBA\nobfuscation. Our in-depth study reveals a hidden two-way feature\nregarding MBA transformation between 1-bit and n-bit variables. We\nexploit this feature and propose a viable solution to efficiently\ndeobfuscate code with MBA obfuscation. Our key insight is that MBA\ntransformations behave in the same way on 1-bit and n-bit variables.\nWe provide a mathematical proof to guarantee the correctness of this\nfinding. We further develop a novel technique to simplify MBA\nexpressions to a normal simple form by arithmetic reduction in 1-bit\nspace. We have implemented this idea as an open-source prototype,\nnamedMBA-Blast, and evaluated it on a comprehensive dataset\nwith about 10,000 MBA expressions. We also tested our method in\nreal-world, binary code deobfuscation scenarios, which demonstrate\nthat MBA-Blast can assist human analysts to harness the full\nstrength of SMT solvers. Compared with existing work, MBA-Blast is\nthe most generic and efficient MBA deobfuscation technique; it has a\nsolid theoretical underpinning, as well as, the highest success rate\nwith negligible overhead.",
    "author": "Authors:Binbin Liu,University of Science and Technology of China & University of New Hampshire;Junfu Shen,University of New Hampshire;Jiang Ming,University of Texas at Arlington;Qilong Zheng and Jing Li,University of Science and Technology of China;Dongpeng Xu,University of New Hampshire",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/liu-binbin",
    "comment": ""
  },
  {
    "title": "VScape: Assessing and Escaping Virtual Call Protections",
    "abstract": "Abstract:Many control-ﬂow integrity (CFI) solutions have been proposed to protect indirect control transfers (ICT), including C++ virtual calls. Assessing the security guarantees of these defenses is thus important but hard. In practice, for a (strong) defense, it usually requires abundant manual efforts to assess whether it could be bypassed, when given a speciﬁc (weak) vulnerability. Existing automated exploit generation solutions, which are proposed to assess the exploitability of vulnerabilities, have not addressed this issue yet.In this paper, we point out that a wide range of virtual call protections, which do not break the C++ ABI (application binary interface), are vulnerable to an advanced attack COOPLUS, even if the given vulnerabilities are weak. Then, we present a solution VScape to assess the effectiveness of virtual call protections against this attack. We developed a prototype of VScape, and utilized it to assess 11 CFI solutions and 14 C++ applications (including Firefox and PyQt) with known vulnerabilities. Results showed that real-world applications have a large set of exploitable virtual calls, and VScape could be utilized to generate working exploits to bypass deployed defenses via weak vulnerabilities.",
    "author": "Authors:Kaixiang Chen,Institute for Network Science and Cyberspace, Tsinghua University;Chao Zhang,Institute for Network Science and Cyberspace, Tsinghua University/Beijing National Research Center for Information Science and Technology/Tsinghua University-QI-ANXIN Group JCNS;Tingting Yin and Xingman Chen,Institute for Network Science and Cyberspace, Tsinghua University;Lei Zhao,School of Cyber Science and Engineering, Wuhan University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/chen-kaixiang",
    "comment": ""
  },
  {
    "title": "MIRAGE: Mitigating Conflict-Based Cache Attacks with a Practical Fully-Associative Design",
    "abstract": "Abstract:Shared caches in processors are vulnerable to conflict-based side-channel attacks, whereby an attacker can monitor the access pattern of a victim by evicting victim cache lines using cache-set conflicts. Recent mitigations propose randomized mapping of addresses to cache lines, to obfuscate the locations of set-conflicts. However, these are vulnerable to newer attack algorithms that discover conflicting sets of addresses despite such mitigations, because these designs select candidates for eviction from a small set of conflicting lines.This paper presentsMirage, a practical design for a fully associative cache, wherein eviction candidates are selected randomly from among all the lines resident in the cache, to be immune to set-conflicts. A key challenge in enabling such a design for large shared caches (containing tens of thousands of resident cache lines) is managing the complexity of cache-lookup, as a naive design can require searching through all the resident lines. Mirage achieves full-associativity while retaining practical set-associative lookups by decoupling placement and replacement, using pointer-based indirection from tag-store to data-store to allow a newly installed address to globally evict the data of any random resident line. To eliminate set-conflicts, Mirage provisions extra invalid tags in a skewed-associative tag-store design where lines can be installed without set-conflict, along with a load-aware skew-selection policy that guarantees the availability of sets with invalid tags. Our analysis shows Mirage provides the global eviction property of a fully-associative cache throughout system lifetime (violations of full-associativity, i.e. set-conflicts, occur less than once in 10^4 to 10^17 years), thus offering a principled defense against any eviction-set discovery and any potential conflict based attacks. Mirage incurs limited slowdown (2%) and 17– 20% extra storage compared to a non-secure cache.",
    "author": "Authors:Gururaj Saileshwar and Moinuddin Qureshi,Georgia Institute of Technology",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/saileshwar",
    "comment": ""
  },
  {
    "title": "Sharing More and Checking Less: Leveraging Common Input Keywords to Detect Bugs in Embedded Systems",
    "abstract": "Abstract:IoT devices have brought invaluable convenience to our daily life. However, their pervasiveness also amplifies the impact of security vulnerabilities. Many popular vulnerabilities of embedded systems reside in their vulnerable web services. Unfortunately, existing vulnerability detection methods cannot effectively nor efficiently analyze such web services: they either introduce heavy execution overheads or have many false positives and false negatives.In this paper, we propose a novel static taint checking solution, SaTC, to effectively detect security vulnerabilities in web services provided by embedded devices. Our key insight is that, string literals on web interfaces are commonly shared between front-end files and back-end binaries to encode user input. We thus extract such common keywords from the front-end, and use them to locate reference points in the back-end, which indicate the input entry. Then, we apply targeted data-flow analysis to accurately detect dangerous uses of the untrusted user input. We implemented a prototype of SaTC and evaluated it on 39 embedded system firmwares from six popular vendors. SaTC discovered 33 unknown bugs, of which 30 are confirmed by CVE/CNVD/PSV. Compared to the state-of-the-art tool KARONTE, SaTC found significantly more bugs on the test set. It shows that, SaTC is effective in discovering bugs in embedded systems.",
    "author": "Authors:Libo Chen,School of Electronic Information and Electrical Engineering, Shanghai Jiao Tong University;Yanhao Wang,QI-ANXIN Technology Research Institute;Quanpu Cai and Yunfan Zhan,School of Electronic Information and Electrical Engineering, Shanghai Jiao Tong University;Hong Hu,Pennsylvania State University;Jiaqi Linghu,QI-ANXIN Technology Research Institute;Qinsheng Hou,QI-ANXIN Technology Research Institute; Shandong University;Chao Zhang and Haixin Duan,BNRist & Institute for Network Science and Cyberspace, Tsinghua University; Tsinghua University-QI-ANXIN Group JCNS;Zhi Xue,School of Electronic Information and Electrical Engineering, Shanghai Jiao Tong University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/chen-libo",
    "comment": ""
  },
  {
    "title": "ObliCheck: Efficient Verification of Oblivious Algorithms with Unobservable State",
    "abstract": "Abstract:Encryption of secret data prevents an adversary from learning sensitive information by observing the transferred data. Even though the data itself is encrypted, however, an attacker can watch which locations of the memory, disk, and network are accessed and infer a significant amount of secret information.To defend against attacks based on this access pattern leakage, a number of oblivious algorithms have been devised. These algorithms transform the access pattern in a way that the access sequences are independent of the secret input data. Since oblivious algorithms tend to be slow, a go-to optimization for algorithm designers is to leverage space unobservable to the attacker.  However, one can easily miss a subtle detail and violate the oblivious property in the process of doing so.In this paper, we propose ObliCheck, a checker verifying whether a given algorithm is indeed oblivious. In contrast to existing checkers, ObliCheck distinguishes the observable and unobservable state of an algorithm. It employs symbolic execution to check whether all execution paths exhibit the same observable behavior. To achieve accuracy and efficiency, ObliCheck introduces two key techniques: Optimistic State Merging to quickly check if the algorithm is oblivious, and Iterative State Unmerging to iteratively refine its judgment if the algorithm is reported as not oblivious. ObliCheck achieves ×50300 of performance improvement over conventional symbolic execution without sacrificing accuracy.",
    "author": "Authors:Jeongseok Son, Griffin Prechter, Rishabh Poddar, Raluca Ada Popa, and Koushik Sen,University of California, Berkeley",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/son",
    "comment": ""
  },
  {
    "title": "Understanding Malicious Cross-library Data Harvesting on Android",
    "abstract": "Abstract:Recent years have witnessed the rise of security risks of libraries integrated in mobile apps, which are  reported to steal private user data from the host apps and the app backend servers. Their security implications, however, have never been fully understood. In our research, we brought to light a new attack vector long been ignored yet with serious privacy impacts – malicious libraries strategically target other vendors'SDKs integrated in the same host app to harvest private user data (e.g., Facebook's user profile). Using a methodology that incorporates semantic analysis on an SDK's Terms of Services (ToS, which describes restricted data access and sharing policies) and code analysis on cross-library interactions, we were able to investigate 1.3 million Google Play apps and the ToSes from 40 highly-popular SDKs, leading to the discovery of 42 distinct libraries stealthily harvesting data from 16 popular SDKs, which affect more than 19K apps with a total of 9 billion downloads. Our study further sheds light on the underground ecosystem behind such library-based data harvesting (e.g., monetary incentives for SDK integration), their unique strategies (e.g., hiding data in crash reports and using C2 server to schedule data exfiltration) and significant impacts.",
    "author": "Authors:Jice Wang,National Computer Network Intrusion Protection Center, University of Chinese Academy of Sciences; Indiana University Bloomington;Yue Xiao and Xueqiang Wang,Indiana University Bloomington;Yuhong Nan,Purdue University;Luyi Xing and Xiaojing Liao,Indiana University Bloomington;JinWei Dong,School of Cyber Engineering, Xidian University;Nicolas Serrano,Indiana University, Bloomington;Haoran Lu and XiaoFeng Wang,Indiana University Bloomington;Yuqing Zhang,National Computer Network Intrusion Protection Center, University of Chinese Academy of Sciences; School of Cyber Engineering, Xidian University; School of Computer Science and Cyberspace Security, Hainan University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/wang-jice",
    "comment": ""
  },
  {
    "title": "DRMI: A Dataset Reduction Technology based on Mutual Information for Black-box Attacks",
    "abstract": "Abstract:It is non-trivial to attack deep neural networks in black-box settings without any model detail disclosed.  Prior studies on black-box attacks leverage a number of queries to the target model for probing the target model or generating adversarial examples.  Queries are usually limited and costly so that the adversary probably fails to mount an effective attack. However, not all the queries have to be made since there exist repetitions or redundancies that induce many inefficient queries.  Therefore, it leaves a lot of room for data reduction and more efficient queries.  To this end, we first propose to use mutual information to measure the data redundancy between two data samples, and then develop a data reduction technique based on mutual information, termed as DRMI.  We implement an efficient optimization algorithm in DRMI, so as to obtain a particular subset of data samples, of which the mutual information in between is minimized.  We conduct extensive experiments on MNIST, CIFAR10, and ImageNet, and six types of deep neural networks, and evaluate DRMI in model extraction and adversarial attacks.  The results demonstrate its high effectiveness in these attacks, surpassing a state-of-the-art approach by raising 7% of model accuracy and two times more transferability of adversarial examples.  Through the comparison experiments with other three strategies, we identify what properties of data have been preserved and removed, to some extent reveal the essences of deep neural networks.",
    "author": "Authors:Yingzhe He, Guozhu Meng, Kai Chen, Xingbo Hu, and Jinwen He,SKLOIS, Institute of Information Engineering, Chinese Academy of Sciences/School of Cyber Security, University of Chinese Academy of Sciences",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/he-yingzhe",
    "comment": ""
  },
  {
    "title": "Fantastic Four: Honest-Majority Four-Party Secure Computation With Malicious Security",
    "abstract": "Abstract:This work introduces a novel four-party honest-majority MPC protocol with active security that achieves comparable efficiency to equivalent protocols in the same setting, while having a much simpler design and not relying on function-dependent preprocessing. Our initial protocol satisfies security with abort, but we present some extensions to achieve guaranteed output delivery. Unlike previous works, we do not achieve this by delegating the computation to one single party that is identified to be honest, which is likely to hinder the adoption of these technologies as it centralizes sensitive data. Instead, our novel approach guarantees termination of the protocol while ensuring that no single party (honest or corrupt) learns anything beyond the output.We implement our four-party protocol with abort in the MP-SPDZ framework for multi-party computation and benchmark multiple applications like MNIST classification training and ImageNet inference. Our results show that our four-party protocol performs similarly to an efficient honest-majority three-party protocol that only provides semi-honest/passive security, which suggests that adding a fourth party can be an effective method to achieve active security without harming performance.",
    "author": "Authors:Anders Dalskov,Aarhus University & Partisia;Daniel Escudero,Aarhus University;Marcel Keller,CSIRO's Data61",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/dalskov",
    "comment": ""
  },
  {
    "title": "Locally Differentially Private Analysis of Graph Statistics",
    "abstract": "Abstract:Differentially private analysis of graphs is widely used for releasing statistics from sensitive graphs while still preserving user privacy. Most existing algorithms however are in a centralized privacy model, where a trusted data curator holds the entire graph. As this model raises a number of privacy and security issues – such as, the trustworthiness of the curator and the possibility of data breaches, it is desirable to consider algorithms in a more decentralized local model where no server holds the entire graph.In this work, we consider a local model, and present algorithms for counting subgraphs – a fundamental task for analyzing the connection patterns in a graph – with LDP (Local Differential Privacy). For triangle counts, we present algorithms that use one and two rounds of interaction, and show that an additional round can significantly improve the utility. For k-star counts, we present an algorithm that achieves an order optimal estimation error in the non-interactive local model. We provide new lower-bounds on the estimation error for general graph statistics including triangle counts and k-star counts. Finally, we perform extensive experiments on two real datasets, and show that it is indeed possible to accurately estimate subgraph counts in the local differential privacy model.",
    "author": "Authors:Jacob Imola,UC San Diego;Takao Murakami,AIST;Kamalika Chaudhuri,UC San Diego",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/imola",
    "comment": ""
  },
  {
    "title": "EOSAFE: Security Analysis of EOSIO Smart Contracts",
    "abstract": "Abstract:The EOSIO blockchain, one of the representative Delegated Proof-of-Stake (DPoS) blockchain platforms, has grown rapidly recently. Meanwhile, a number of vulnerabilities and high-profile attacks against top EOSIO DApps and their smart contracts have also been discovered and observed in the wild, resulting in serious financial damages. Most of the EOSIO smart contracts are not open-sourced and typically compiled to WebAssembly (Wasm) bytecode, thus making it challenging to analyze and detect the presence of possible vulnerabilities. In this paper, we propose EOSAFE, the first static analysis framework that can be used to automatically detect vulnerabilities in EOSIO smart contracts at the bytecode level. Our framework includes a practical symbolic execution engine for Wasm, a customized library emulator for EOSIO smart contracts, and four heuristic-driven detectors to identify the presence of the four most popular vulnerabilities in EOSIO smart contracts. Experiments have shown that EOSAFE achieves promising results in detecting vulnerabilities, with an F1-measure of 98%. We have applied EOSAFE to all active 53,666 smart contracts in the ecosystem (as of November 15, 2019). Our results show that over 25% of the smart contracts are labeled vulnerable. We further analyze possible exploitation attempts on these vulnerable smart contracts and identify 48 in-the-wild attacks (27 of them have been confirmed by DApp developers), which have resulted in financial loss of at least 1.7 million USD.",
    "author": "Authors:Ningyu He,Key Lab on HCST (MOE), Peking University;Ruiyi Zhang,PeckShield, Inc.;Haoyu Wang,Beijing University of Posts and Telecommunications;Lei Wu,Zhejiang University;Xiapu Luo,The Hong Kong Polytechnic University;Yao Guo,Key Lab on HCST (MOE), Peking University;Ting Yu,Qatar Computing Research Institute;Xuxian Jiang,PeckShield, Inc.",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/he-ningyu",
    "comment": ""
  },
  {
    "title": "Blitz: Secure Multi-Hop Payments Without Two-Phase Commits",
    "abstract": "Abstract:Payment-channel networks (PCN) are the most prominent approach to tackle the scalability issues of current permissionless blockchains. A PCN reduces the load on-chain by allowing arbitrarily many off-chain multi-hop payments (MHPs) between any two users connected through a path of payment channels. Unfortunately, current MHP protocols are far from satisfactory. One-round MHPs (e.g., Interledger) are insecure as a malicious intermediary can steal the payment funds. Two-round MHPs (e.g., Lightning Network (LN)) follow the 2-phase-commit paradigm as in databases to overcome this issue. However, when tied with economical incentives, 2-phase-commit brings other security threats (i.e., wormhole attacks), staggered collateral (i.e., funds are locked for a time proportional to the payment path length) and dependency on specific scripting language functionality (e.g., Hash Time-Lock Contracts) that hinders a wider deployment in practice.We present Blitz, a novel MHP protocol that demonstrates for the first time that we can achieve the best of the two worlds: a single round MHP where no malicious intermediary can steal coins. Moreover, Blitz provides the same privacy for sender and receiver as current MHP protocols do, is not prone to the wormhole attack and requires only constant collateral. Additionally, we construct MHPs using only digital signatures and a timelock functionality, both available at the core of virtually every cryptocurrency today. We provide the cryptographic details of Blitz and we formally prove its security. Furthermore, our experimental evaluation on a LN snapshot shows that (i) staggered collateral in LN leads to in between 4x and 33x more unsuccessful payments than the constant collateral in Blitz; (ii) Blitz reduces the size of the payment contract by 26%; and (iii) Blitz prevents up to 0.3 BTC (3397 USD in October 2020) in fees being stolen over a three day period as it avoids wormhole attacks by design.",
    "author": "Authors:Lukas Aumayr,TU Wien;Pedro Moreno-Sanchez,IMDEA Software Institute;Aniket Kate,Purdue University;Matteo Maffei,TU Wien",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/aumayr",
    "comment": ""
  },
  {
    "title": "Messy States of Wiring: Vulnerabilities in Emerging Personal Payment Systems",
    "abstract": "Abstract:This paper presents our study on an emerging paradigm of payment service that allows individual merchants to leverage the personal transfer service in third-party platforms to support commercial transactions. This is made possible by leveraging an additional order management system, collectively named Personal Payment System (PPS). To gain a better understanding of these emerging systems, we conducted a systematic study on 35 PPSs covering over 11740 merchant clients supporting more than 20 million customers. By examining the documentation, available source codes, and demos, we extracted a common abstracted model for PPS and discovered seven categories of vulnerabilities in the existing personal payment protocol design and system implementation. It is alarming that all PPSs under study have at least one vulnerability. To further dissect these potential weaknesses, we present the corresponding attack methods to exploit the discovered vulnerabilities. To validate our proposed attacks, we conducted four successful real attacks to illustrate the severe consequences. We have responsibly disclosed the newly discovered vulnerabilities, with some patched after our reporting.",
    "author": "Authors:Jiadong Lou and Xu Yuan,University of Louisiana at Lafayette;Ning Zhang,Washington University in St. Louis",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/lou",
    "comment": ""
  },
  {
    "title": "SWIFT: Super-fast and Robust Privacy-Preserving Machine Learning",
    "abstract": "Abstract:Performing machine learning (ML) computation on private data while maintaining data privacy, aka Privacy-preserving Machine Learning (PPML), is an emergent field of research. Recently, PPML has seen a visible shift towards the adoption of the Secure Outsourced Computation (SOC) paradigm due to the heavy computation that it entails. In the SOC paradigm, computation is outsourced to a set of powerful and specially equipped servers that provide service on a pay-per-use basis. In this work, we propose SWIFT, arobustPPML framework for a range of ML algorithms in SOC setting, that guarantees output delivery to the users irrespective of any adversarial behaviour. Robustness, a highly desirable feature,   evokes user participation without the fear of denial of service.At the heart of our framework lies a highly-efficient, maliciously-secure, three-party computation (3PC) over rings that provides guaranteed output delivery (GOD) in the honest-majority setting.  To the best of our knowledge, SWIFT is the first robust and efficient  PPML framework in the 3PC setting. SWIFT is as fast as (and is strictly better in some cases than) the best-known 3PC framework BLAZE (Patra et al. NDSS '20), which only achieves fairness. We extend our 3PC framework for four parties (4PC). In this regime, SWIFT is as fast as the best knownfair4PC framework Trident (Chaudhari et al. NDSS '20) and twice faster than the best-knownrobust4PC framework FLASH (Byali et al. PETS '20).We demonstrate our framework's practical relevance by benchmarking popular ML algorithms such as Logistic Regression and deep Neural Networks such as VGG16 and LeNet, both over a 64-bit ring in a WAN setting. For deep NN, our results testify to our claims that we provide improved security guarantee while incurring no additional overhead for 3PC and obtaining 2x improvement for 4PC.",
    "author": "Authors:Nishat Koti, Mahak Pancholi, Arpita Patra, and Ajith Suresh,Indian Institute of Science, Bangalore",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/koti",
    "comment": ""
  },
  {
    "title": "Privacy-Preserving and Standard-Compatible AKA Protocol for 5G",
    "abstract": "Abstract:The 3GPP consortium has published the Authentication and Key Agreement protocol for the 5th generation (5G) mobile communication system (i.e., 5G-AKA) by Technical Specification (TS) 33.501. It introduces public key encryption to conceal the so-called SUPIs so as to enhance mobile users' privacy. However, 5G-AKA is only privacy-preserving at the presence of passive attackers, and is still vulnerable to the linkability attacks from active attackers. An active attacker can track target mobile phones via performing these attacks, which puts the privacy of users at risk.It is resistant to linkability attacks performed by active attackers, and is compatible with the SIM cards and currently deployed Serving Networks (SNs). In particular, we first conduct an analysis on the known linkability attacks in 5G-AKA, and find out a root cause of all attacks. Then, we design a counter-measure with the inherent key encapsulation mechanism of ECIES (i.e., ECIES-KEM), and use the shared key established by ECIES-KEM to encrypt the challenges sent by a Home Network (HN). With this measure, a target User Equipment (UE) who receives a message replayed from its previously attended sessions behaves as non-target UEs, which prevents the attacker from distinguishing the UE by linking it with its previous sessions. Moreover, 5G-AKA′ does not raise additional bandwidth cost, and only introduces limited additional time costs from 0.02% to 0.03%. Finally, we use a state-of-the-art formal verification tool, Tamarin prover, to prove that 5G-AKA′ achieves the desired security goals of privacy, authentication and secrecy.",
    "author": "Authors:Yuchen Wang,TCA of State Key Laboratory of Computer Science, Institute of Software, Chinese Academy of Sciences & Alibaba Group;Zhenfeng Zhang,TCA of State Key Laboratory of Computer Science, Institute of Software, Chinese Academy of Sciences;Yongquan Xie,Commercial Cryptography Testing Center of State Cryptography Administration",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/wang-yuchen",
    "comment": ""
  },
  {
    "title": "SEApp: Bringing Mandatory Access Control to Android Apps",
    "abstract": "Abstract:Mandatory Access Control (MAC) has provided a great contribution to the improvement of the security of modern operating systems. A clear demonstration is represented by Android, which has progressively assigned a greater role to SELinux since its introduction in 2013. These benefits have been mostly dedicated to the protection of system components against the behavior of apps and no control is offered to app developers on the use of MAC. Our solution overcomes this limitation, giving developers the power to define ad-hoc MAC policies for their apps, supporting the internal compartmentalization of app components.This is a natural evolution of the security mechanisms already available in Android, but its realization requires to consider that (i) the security of system components must be maintained, (ii) the solution must be usable by developers, and (iii) the performance impact should be limited. Our proposal meets these three requirements. The proposal is supported by an open-source implementation.",
    "author": "Authors:Matthew Rossi, Dario Facchinetti, and Enrico Bacis,Università degli Studi di Bergamo;Marco Rosa,SAP Security Research;Stefano Paraboschi,Università degli Studi di Bergamo",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/rossi",
    "comment": ""
  },
  {
    "title": "A11y and Privacy don't have to be mutually exclusive: Constraining Accessibility Service Misuse on Android",
    "abstract": "Abstract:Accessibility features of Android are crucial in assisting people with disabilities or impairment to navigate their devices. However, the same, powerful features are commonly misused by shady apps for malevolent purposes, such as stealing data from other apps. Unfortunately, existing defenses do not allow apps to protect themselves and at the same time to be fully inclusive to users with accessibility needs.To enhance the privacy protection of the user while preserving the accessibility features for assistive apps, we introduce an extension to Android's accessibility framework. Our design is based on a study of how accessibility features are used in 95 existing accessibility apps of different types (malware, utility, and a11y). Based on those insights, we propose to model the usage of the accessibility framework as a pipeline of code modules, which are all sandboxed on the system-side. By policing the data flows of those modules, we achieve more fine-grained control over the access to accessibility features and the way they are used in apps, allowing a balance between accessibility functionality for dependent users and reduced privacy risks. We demonstrate the feasibility of our solution by migrating two real-world apps to our privacy-enhanced accessibility framework.",
    "author": "Authors:Jie Huang, Michael Backes, and Sven Bugiel,CISPA Helmholtz Center for Information Security",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/huang",
    "comment": ""
  },
  {
    "title": "DICE*: A Formally Verified Implementation of DICE Measured Boot",
    "abstract": "Abstract:Measured boot is an important class of boot protocols that ensure that each\nlayer of firmware and software in a device's chain of trust is measured, and the\nmeasurements are reliably recorded for subsequent verification. This paper\npresents DICE*, a formal specification as well as a formally\nverified implementation of\nDICE, an industry standard measured boot protocol. DICE* is\nproved to be functionally correct, memory-safe, and resistant to timing- and\ncache-based side-channels. A key component of DICE*\nis a verified certificate creation library for a fragment of\nX.509. We have integrated DICE* into the boot firmware of an\nSTM32H753ZI micro-controller. Our evaluation shows that\nusing a fully verified implementation has minimal to no effect\non the code size and boot time when compared to an\nexisting unverified implementation.",
    "author": "Authors:Zhe Tao,University of California, Davis;Aseem Rastogi, Naman Gupta, and Kapil Vaswani,Microsoft Research;Aditya V. Thakur,University of California, Davis",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/tao",
    "comment": ""
  },
  {
    "title": "Research on the Security of Visual Reasoning CAPTCHA",
    "abstract": "Abstract:CAPTCHA is an effective mechanism for protecting computers from malicious bots. With the development of deep learning techniques, current mainstream text-based CAPTCHAs have been proven to be insecure. Therefore, a major effort has been directed toward developing image-based CAPTCHAs, and image-based visual reasoning is emerging as a new direction of such development. Recently, Tencent deployed the Visual Turing Test (VTT) CAPTCHA. This appears to have been the first application of a visual reasoning scheme. Subsequently, other CAPTCHA service providers (Geetest, NetEase, Dingxiang, etc.) have proposed their own visual reasoning schemes to defend against bots. It is, therefore, natural to ask a fundamental question: are visual reasoning CAPTCHAs as secure as their designers expect? This paper presents the first attempt to solve visual reasoning CAPTCHAs. We implemented a holistic attack and a modular attack, which achieved overall success rates of 67.3% and 88.0% on VTT CAPTCHA, respectively. The results show that visual reasoning CAPTCHAs are not as secure as anticipated; this latest effort to use novel, hard AI problems for CAPTCHAs has not yet succeeded. Based on the lessons we learned from our attacks, we also offer some guidelines for designing visual CAPTCHAs with better security.",
    "author": "Authors:Yipeng Gao, Haichang Gao, Sainan Luo, Yang Zi, Shudong Zhang, Wenjie Mao, Ping Wang, and Yulong Shen,Xidian University;Jeff Yan,Linköping University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/gao",
    "comment": ""
  },
  {
    "title": "SmarTest: Effectively Hunting Vulnerable Transaction Sequences in Smart Contracts through Language Model-Guided Symbolic Execution",
    "abstract": "Abstract:We present SmarTest, a novel symbolic execution technique for effectively hunting vulnerable transaction sequences in smart contracts. Because smart contracts are stateful programs whose states are altered by transactions, diagnosing and understanding nontrivial vulnerabilities requires generating sequences of transactions that demonstrate the flaws. However, finding such vulnerable transaction sequences is challenging as the number of possible combinations of transactions is intractably large. As a result, most existing tools for smart contract analysis use abstractions and merely point out the locations of vulnerabilities, which in turn imposes a steep burden on users of understanding the bugs, or have limited power in generating transaction sequences. In this paper, we aim to overcome this challenge by combining symbolic execution with a language model for vulnerable transaction sequences, so that symbolic execution effectively prioritizes program paths that are likely to reveal vulnerabilities. Experimental results with real-world smart contracts show that SmarTest significantly outperforms existing tools by finding more vulnerable transaction sequences including critical zero-day vulnerabilities.",
    "author": "Authors:Sunbeom So, Seongjoon Hong, and Hakjoo Oh,Korea University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/so",
    "comment": ""
  },
  {
    "title": "GForce: GPU-Friendly Oblivious and Rapid Neural Network Inference",
    "abstract": "Abstract:Neural-network classification is getting more pervasive. It captures data of the subjects to be classified, e.g., appearance for facial recognition, which is personal and often sensitive. Oblivious inference protects the data privacy of both the query and the model. However, it is not as fast and as accurate as its plaintext counterpart. A recent cryptographic solution Delphi (Usenix Security 2020) strives for low latency by using GPU on linear layers and replacing some non-linear units in the model at a price of accuracy. It can handle a query on CIFAR-100 with ~68% accuracy in 14s or ~66% accuracy in 2.6s.We propose GForce, tackling the latency issue from the root causes instead of approximating non-linear computations. With the SWALP training approach (ICML 2019), we propose stochastic rounding and truncation (SRT) layers, which fuse quantization with dequantization between non-linear and linear layers and free us from floating-point operations for efficiency. They also ensure high accuracy while working over the severely-finite cryptographic field. We further propose a suite of GPU-friendly secure online/offline protocols for common operations, including comparison and wrap-around handling, which benefit non-linear layers, including our SRT.With our two innovations, GForce supports VGG16, attaining ~73% accuracy over CIFAR-100 for the first time, in 0.4s. Compared with the prior best non-approximated solution (Usenix Security 2018), GForce speeds up non-linear~layers~in VGG by >34×. Our techniques shed light on a new direction that utilizes GPU throughout the model to minimize latency.",
    "author": "Authors:Lucien K. L. Ng and Sherman S. M. Chow,The Chinese University of Hong Kong, Hong Kong",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/ng",
    "comment": ""
  },
  {
    "title": "Acoustics to the Rescue: Physical Key Inference Attack Revisited",
    "abstract": "Abstract:Lock picking and key bumping are the most common attacks on traditional pin tumbler door locks. However, these approaches require physical access to the lock throughout the attack, increasing suspicion and chances of the attacker getting caught. To overcome this challenge, we propose Keynergy, a stealthy offline attack that infers key bittings (or secret) by substantially extending and improving prior work that only utilizes a still image of the key. Keynergy effectively utilizes the inherent audible “clicks” due to a victim's key insertion, together with video footage of the victim holding the key, in order to infer the victim's key's bittings. We evaluate Keynergy via a proof-of-concept implementation and real-world experiments comprising of participants that perform multiple key insertions across a total of 75 keys with the related audio recorded using different microphone types placed at varying distances. We demonstrate that Keynergy achieves an average reduction rate of around 75% with an acoustics-based approach alone. When we combine both acoustics and video together, Keynergy obtains a reduced keyspace below ten keys for 8% of the keys (i.e., six keys out of 75 keys tested).",
    "author": "Authors:Soundarya Ramesh and Rui Xiao,National University of Singapore;Anindya Maiti,University of Oklahoma;Jong Taek Lee, Harini Ramprasad, and Ananda Kumar,National University of Singapore;Murtuza Jadliwala,University of Texas at San Antonio;Jun Han,National University of Singapore",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/ramesh",
    "comment": ""
  },
  {
    "title": "DOLMA: Securing Speculation with the Principle of Transient Non-Observability",
    "abstract": "Abstract:Modern processors allow attackers to leak data during transient (i.e., mis-speculated) execution through microarchitectural covert timing channels. While initial defenses were channel-specific, recent solutions employ speculative information flow control in an attempt to automatically mitigate attacks via any channel. However, we demonstrate that the current state-of-the-art defense fails to mitigate attacks using speculative stores, still allowing arbitrary data leakage during transient execution. Furthermore, we show that the state of the art does not scale to protect data in registers, incurring 30.8–63.4% overhead on SPEC 2017, depending on the threat model.We then present DOLMA, the first defense to automatically provide comprehensive protection against all known transient execution attacks. DOLMA combines a lightweight speculative information flow control scheme with a set of secure performance optimizations. By enforcing a novel principle oftransient non-observability, DOLMA ensures that a time slice on a core provides a unit of isolation in the context of existing attacks. Accordingly, DOLMA can allow speculative TLB/L1 cache accesses and variable-time arithmetic without loss of security. On SPEC 2017, DOLMA achieves comprehensive protection of data in memory at 10.2–29.7% overhead, adding protection for data in registers at 22.6–42.2% overhead (8.2–21.2% less than the state of the art, with greater security).",
    "author": "Authors:Kevin Loughlin, Ian Neal, Jiacheng Ma, Elisa Tsai, Ofir Weisse, Satish Narayanasamy, and Baris Kasikci,University of Michigan",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/loughlin",
    "comment": ""
  },
  {
    "title": "Weaponizing Middleboxes for TCP Reflected Amplification",
    "abstract": "Abstract:Reflective amplification attacks are a powerful tool in the arsenal of a DDoS attacker, but to date have almost exclusively targeted UDP-based protocols. In this paper, we demonstrate that non-trivial TCP-based amplification is possible and can be orders of magnitude more effective than well-known UDP-based amplification. By taking advantage of TCP-noncompliance in network middleboxes, we show that attackers can induce middleboxes to respond and amplify network traffic. With the novel application of a recent genetic algorithm, we discover and maximize the efficacy of new TCP-based reflective amplification attacks, and present several packet sequences that cause network middleboxes to respond with substantially more packets than we send.We scanned the entire IPv4 Internet to measure how many IP addresses permit reflected amplification. We find hundreds of thousands of IP addresses that offer amplification factors greater than 100×. Through our Internet-wide measurements, we explore several open questions regarding DoS attacks, including the root cause of so-called \"mega amplifiers\". We also report on network phenomena that causes some of the TCP-based attacks to be so effective as to technically have infinite amplification factor (after the attacker sends a constant number of bytes, the reflector generates traffic indefinitely). We have made our code publicly available.",
    "author": "Authors:Kevin Bock,University of Maryland;Abdulrahman Alaraj,University of Colorado Boulder;Yair Fax and Kyle Hurley,University of Maryland;Eric Wustrow,University of Colorado Boulder;Dave Levin,University of MarylandDistinguished Paper Award Winner and Third Prize winner of the 2021 Internet Defense Prize",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/bock",
    "comment": ""
  },
  {
    "title": "Swiped: Analyzing Ground-truth Data of a Marketplace for Stolen Debit and Credit Cards",
    "abstract": "Abstract:This paper presents the first empirical study of ground-truth data from a major underground shop selling stolen credit and debit cards. To date, there is little quantitative knowledge about how this segment of the underground economy operates, despite causing fraud losses estimated at billions of dollars a year. Our analysis of four years of leaked transactional data allows us to characterize this shop's business model, sellers, customers, and finances. The shop earned close to $104M in gross revenue and listed over 19M unique card numbers for sale. Around 97% of the inventory was stolen magnetic stripe data, commonly used to produce counterfeit cards for in-person payments. Perhaps surprisingly, customers purchased only 40% of this inventory. In contrast, the shop sold 83% of its card-not-present inventory, used for online fraud, which appeared to be in short supply. Demand and pricing were not uniform, as buyers appeared to perceive some banks as having weaker countermeasures against fraud. Even multiple years into the U.S. EMV chip deployment, the supply of stolen magnetic stripe data continued to increase sharply. In particular, we identified a continuing supply of newly issued cards not equipped with EMV chips, especially among prepaid cards. Our findings suggest that improvements to EMV chip deployment in the U.S., combined with a limited supply of stolen card-not-present data, could be avenues to decreasing the revenue and profitability of this shop.",
    "author": "Authors:Maxwell Aliapoulios, Cameron Ballard, Rasika Bhalerao, Tobias Lauinger, and Damon McCoy,New York University",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/aliapoulios",
    "comment": ""
  },
  {
    "title": "YARIX: Scalable YARA-based Malware Intelligence",
    "abstract": "Abstract:YARA is the industry standard to search for patterns in malware data sets. Malware analysts heavily rely on YARA rules to identify specific threats, e.g., by scanning unknown malware samples for patterns that are characteristic for a certain malware strain. While YARA is tremendously useful to inspect individual files, its run time grows linearly with the number of input files, resulting in prohibitive performance penalties in large malware corpora.We present YARIX, a methodology to efficiently reveal files matching arbitrary YARA rules. In order to scale to large malware corpora, YARIX uses an invertedn-gram index that maps fixed-length byte sequences to lists of files in which they appear. To efficiently query such corpora, YARIX optimizes YARA searches by transforming YARA rules into index lookups to obtain a set of candidate files that potentially match the rule. Given the storage demands that arise when indexing binary files, YARIX compresses the disk footprint with variable byte delta encoding, abstracts from file offsets, and leverages a novel grouping-based compression methodology. This completeness-preserving approximation will then be scanned using YARA to get the actual set of matching files.Using 32M malware samples and 1404 YARA rules, we show that YARIX scales in both disk footprint and search performance. The index requires just ≈74% of the space required for storing the malware samples. Querying YARIX with a YARA rule in our test setup is five orders of magnitude faster than using standard sequential YARA scans.",
    "author": "Authors:Michael Brengel and Christian Rossow,CISPA Helmholtz Center for Information Security",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/brengel",
    "comment": ""
  },
  {
    "title": "Having Your Cake and Eating It: An Analysis of Concession-Abuse-as-a-Service",
    "abstract": "Abstract:Concession Abuse as a Service(CAaaS) is a growing scam service in underground forums that defrauds online retailers through the systematic abuse of their return policies (via social engineering) and the exploitation of loopholes in company protocols. Timely detection of such scams is difficult as they are fueled by an extensive suite of criminal services, such as credential theft, document forgery, and fake shipments. Ultimately, the scam enables malicious actors to steal arbitrary goods from merchants with minimal investment.In this paper, we perform in-depth manual and automated analysis of public and private messages from four large underground forums to identify the malicious actors involved in CAaaS, carefully study the operation of the scam, and define attributes to fingerprint the scam and inform mitigation strategies. Additionally, we surveyed users to evaluate their attitudes toward these mitigations and understand the factors that merchants should consider before implementing these strategies. We find that the scam is easy to scale—and can bypass traditional anti-fraud efforts—and thus poses a notable threat to online retailers.",
    "author": "Authors:Zhibo Sun, Adam Oest, and Penghui Zhang,Arizona State University;Carlos Rubio-Medrano,Texas A&M University - Corpus Christi;Tiffany Bao and Ruoyu Wang,Arizona State University;Ziming Zhao,Rochester Institute of Technology;Yan Shoshitaishvili and Adam Doupé,Arizona State University;Gail-Joon Ahn,Arizona State University and Samsung Research",
    "year": "2021",
    "publication": "security",
    "link": "https://www.usenix.org/conference/usenixsecurity21/presentation/sun-zhibo",
    "comment": ""
  }
]